-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 18, 2022 at 09:48 AM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 8.0.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `maal_salas`
--

-- --------------------------------------------------------

--
-- Table structure for table `add_daftrs`
--

CREATE TABLE `add_daftrs` (
  `id` bigint(100) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `add_daftrs`
--

INSERT INTO `add_daftrs` (`id`, `daftr_no`) VALUES
(4, 'وکیل اعلیٰ صاحب دفتر'),
(5, 'وکالت علیاء'),
(6, 'وکالت مال اوّل'),
(7, 'وکالت مال ثانی'),
(8, 'وکالت مال ثالث'),
(9, 'وکالت دایوان'),
(10, 'وکالت تبشیر'),
(11, 'وکالت تصنیف'),
(12, 'وکالت تعلیم'),
(13, 'وکالت زراعت'),
(14, 'وکالت اشاعت'),
(15, 'وکالت امانت'),
(16, 'وکالت آڈٹ'),
(17, 'وکالت کمیٹی آبادی'),
(18, 'چھوٹا گیسٹ ہاوس'),
(19, 'سرائے  فضلِ عمر گیسٹ ہاوس'),
(20, 'خلافت جوبلی'),
(21, 'کمپیوٹر سیکشن'),
(22, 'مجلس نصرت جہاں'),
(23, 'دفتر وقفِ نو'),
(24, 'مشیر قانونی'),
(25, 'سکیورٹی روم +سکیورٹی لائٹس+ کنٹرول روم چھت'),
(26, 'دفتر تعمیرات'),
(27, 'سٹوڈیو تحریکِ جدید'),
(28, 'واٹرپمپ دفاتر'),
(29, 'سیوریج پمپ'),
(30, 'لفٹ تحریکِ جدید'),
(31, 'کامن واش روم'),
(32, 'سائیکل سٹینڈ'),
(33, 'جاپانی ڈیسک'),
(34, 'فارمیسی ڈیسک وکالت تصنیف کوارٹر نمبر 8'),
(35, 'میٹنگ رومز (کارنفرنس روم شیشے والا کمرہ)'),
(36, 'جنریٹر روم'),
(37, 'لائبریری (دفتر تبشیر)'),
(38, 'مین گیٹ'),
(39, 'باغ پانی'),
(40, 'کانفرنس روم فرسٹ فلور (آڈیٹوریم)'),
(41, 'جنرل دفاتر'),
(42, 'سیمنٹ اندراج مرمت دفاتر'),
(43, 'کارواش پوائنٹ'),
(44, 'گراسی پلاٹ مشرقی جانب دفاتر نزد جنریٹر روم'),
(45, 'دفتر صدر مجلس کمیٹی روم'),
(46, 'جنوبی ونگ برآمدے دفتر تحریکِ جدید'),
(47, 'واٹر کولرزدفاترتحریکِ جدید'),
(48, 'گیسٹ ہاوس حلقہ دارالواقفین نزد چھوٹا گیٹ دارالصدر'),
(49, 'مین گیٹ دفاترز شمالی جانب'),
(50, 'سرائے  ناصر گیسٹ ہاوس'),
(51, 'ورکشاپ'),
(52, 'ریوارنگ کُرسیاں'),
(53, 'فیئر شاپ صنعت و تجارت'),
(54, 'نیو کمرہ تعمیر حلقہ سابقہ دفتر تعمیرات');

-- --------------------------------------------------------

--
-- Table structure for table `add_tameer_quaters`
--

CREATE TABLE `add_tameer_quaters` (
  `id` bigint(100) NOT NULL,
  `tameer_quater_number` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `add_tameer_quaters`
--

INSERT INTO `add_tameer_quaters` (`id`, `tameer_quater_number`) VALUES
(1, '324'),
(2, '324');

-- --------------------------------------------------------

--
-- Table structure for table `amad_daftr_entries`
--

CREATE TABLE `amad_daftr_entries` (
  `id` bigint(100) NOT NULL,
  `maal_type` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `amad_daftr_entries`
--

INSERT INTO `amad_daftr_entries` (`id`, `maal_type`, `detail`, `amount`, `date`) VALUES
(5, 'میاں گلاس ہاوس', 'دفا تر سرائے نا صر، وکا لت تصنیف،وکا لت تبشیر کیلئےشیشہ کا کام کروایا گیا۔', '3500', '2021-11-23'),
(6, 'زاہد ٹریڈرذ', 'سرائے ناصر کی ممٹی اور ٹینک کے شیشہ کیلئے ویدر شیٹ لگوائی گئی۔', '2800', '2021-11-23'),
(9, 'چوہدری الیکٹرک', 'جنرل دفاتر، وکالت سمری وبصری،وکالت تصنیف،مال اول،سٹوڈیو، صنعت و تجارت کیلئے سامان منگوایا گیا۔', '9850', '2021-11-23'),
(10, 'سندر الیکٹرک', 'صنٰت وتجارت کیلئے بجلی کا سامان منگوانا گیا', '350', '2021-11-23'),
(11, 'اقبال پینٹر', 'دفتر تبشیر کیلئے ڈسٹیمپر، لیکر پالش کا سامان منگوایا گیا', '13653', '2021-11-23'),
(13, 'اقبال پینٹر', 'دروازے،کھڑکی،کچن،لور، پلے دو دن مزوری برائے سرائے فضل عمر', '6000', '28/02/22'),
(14, 'ذاہد ٹریڈرذ', 'سرائے فضل عمر میں کثن میں لکژی کی مرمتوں کو پینٹ کروایا', '3040', '28/02/22'),
(15, 'چوہدری الیکٹرک', 'اوورہییڈ ٹینک دارالفتوح کےلیے بجلی کا سامان منگوایا', '40680', '03/03/22'),
(16, 'مرید بلوچ', 'سراتے فضل عمر ، سراءے ناصر میں کرسیوں کی مرمتیں ٹیبلوں کی مرمتیں', '2700', '09/03/22'),
(17, 'ناصر فائبر', 'پانی کی شارٹیج کے با عث ٹینکر منگوایا برائے جنرل دفاتر', '1500', '13/03/22'),
(18, 'اعجاز احمد', 'سرائے فضل عمر کی سیڑیوں کیلئے', '100', '13/03/22'),
(19, 'آصف موٹر وائنڈنگ', 'سرائے ناصر کے ٹینک پر مالیوں کی لگی موٹر مرمت کروائی', '1550', '16/03/22'),
(20, 'مرید بلوچ', 'دفتر سرائے فضل عمر،کامن واش روم،ورکشاپ،نئی چیک ،پوسٹ کیلئے دروازے،کرسیاں،بیڈ مشین سروس مرمتیں کروائی', '5400', '16/03/22'),
(21, 'ریاض الحسن', 'مشاورت کام برائے سرائے ناصر، چھوٹا گسٹ ہاوس', '42075', '16/03/22'),
(22, 'مبشر مارکٹ', 'برائے فضل عمر کے کمرہ نمبر 206 کے اے سی کی مرمت+ سروس', '1500', '17/03/22'),
(23, 'افضل برادرز', 'گھڑی کے لئے سیل منگوائے برائے دفتر مال ثالث', '60', '20/03/22'),
(24, 'ذاہد ٹریڈرذ', 'جنرل ،نرسری،سرائے فضل عمر،سرائے ناصر،تبشیر،جنریٹر روم، مال ثالث کیلئے پینٹ کا سامان منگوایا', '84050', '22/03/22'),
(25, 'مرید بلوچ', 'سرائے فضل عمر چھوٹا  گیسٹ ہاوس کشن والی کرسی مرمت ٹوٹل 2 یوم', '1800', '22/03/22'),
(26, 'الیاس انجینرنگ', '2 عدد لکڑی کی گولائیاں بنوائیں', '240', '24/03/22'),
(27, 'تبسم موٹر وائینڈنگ  ربوہ', 'بیرنگ', '800', '24/03/22'),
(28, 'ککو بھائی', '1 کین w.D-40', '450', '29/03/22'),
(29, 'ماڈرن پینٹ', 'چھوٹا گیسٹ ہاوس کی بیرونی دیوار کیلیئے ویدر شیلڈ بنوائی', '12900', '03/04/22'),
(30, 'بلال یاسین کراکری ہاوس', '3 عدد تیل بوتل سرائے ناصر', '560', '04/04/22'),
(31, 'بوٹا کراکری', '6 درجن پیالی سرائے ناصر', '12600', '04/04/22'),
(32, 'شافی اللہ', '2 عدد فرسٹ باسکٹ ، 1 عدد کیڈل سٹو ڈیو سرائے ناصر', '5400', '04/04/22'),
(33, 'آرف کراکری اسٹور', '1 درجن سوپ بمعہ گرین سرائے ناصر', '850', '04/04/22'),
(34, 'اکرام تھرماس ہاوس', '6 عدد تھرماس + 1عدد ویجیٹیبل کٹر سرائے ناصر', '5520', '04/04/22'),
(35, 'اےاے الیکٹرک', 'سینڈوچ میکر+بیکے ایل ڈیو آیرن سرائے ناصر', '6500', '04/04/22'),
(36, 'بٹ لائٹس', 'slim 5w neolux ww سرائے ناصر', '1700', '04/04/22'),
(37, 'ذبیدہ اسوسیٹ', 'استری + ٹیکس 17٪ سرائے ناصر', '35000', '04/04/22'),
(38, 'کاکا بوا سنس', 'baby soup spoon 10 عددد سرائے ناصر', '4800', '04/04/22'),
(39, 'انیل ٹاولس', '2 عدد ٹاولس', '1120', '04/04/22'),
(40, 'شاہ ٹریڈنگ کارپوریشن', 'دواِی برائے دیمک کنٹرول سرائے ناصر', '1400', '04/04/22'),
(41, 'ڈ ی اے', 'پٹرول، موٹروے،ٹول ٹیکس،ذیشانڈی اے،ڈرائورڈی اے ، شفیق ڈی اے ، عمران ڈی اے، زاہد ڈی اے برائے سرائے ناصر', '11760', '04/04/22'),
(42, 'کرونا پینٹ', '5عدد ویل چیر  وکالت مال ثالث', '1000', '04/04/22'),
(43, 'نایاب پٹرولیم سروس', 'پٹرول  سرائے ناصر', '1300', '04/04/22'),
(44, 'ہسکل پٹرولیم', 'پٹرول سرائے ناصڑ', '6100', '04/04/22'),
(45, 'سمارٹ پنڈی بھٹیاں موٹر وے', 'پیزا سرائے ناصر', '460', '04/04/22'),
(46, 'سمارٹ پنڈی بھٹیاں موٹر وے', 'پلازہ انٹری سرائے ناصر', '260', '04/04/22'),
(47, 'ٹول پلازہ', 'ٹول ٹیکس چناب نگر', '60', '04/04/22'),
(48, 'ٹبہ شاہ بولہ', 'ٹول ٹیکس سرائے ناصر', '50', '04/04/22'),
(49, 'ٹول پلازہ', 'ٹول ٹیکس لاہور رنگ روڈ سرائے ناصر', '45', '04/04/22'),
(50, 'کار جیپ', 'لاہور پارکنگ سرائےب ناصر', '30', '04/04/22'),
(51, 'نایاب پٹرولیم سروس', 'پٹرول سرائے ناصر', '4920', '04/04/22'),
(52, 'مٹنگ سرائے ناصر', '1 سوپ پاولز،سٹیل چمچ،استریاں،چینی دان،چھوٹی کٹوریاں،صابن،شیمپو،کنگی،تھرماس', '100000', '04/04/22'),
(53, 'طاہر الیکٹریشن', 'پی ٹی سی ایل تار برائے کمیٹی آبادی', '1350', '04/04/22'),
(54, 'وائٹ ہاوس', 'آوٹومیٹک مشین برایئے سرائے ناصر', '95000', '04/04/22'),
(55, 'اقبال پینٹر', 'بیرونی ویدرشیلڈ برائے دارالواقفین پرانا کام', '41060', '07/04/22'),
(56, 'میاں الیکٹرک', 'اگزاسٹ فین برائے سرائے ناصر', '1500', '07/04/22'),
(57, 'ماڈرن پینٹ', 'چھوٹا گیسٹ ہاوس کے بیرونی دیوار دفتر کی جانب کے لئے ویدر شیلڈ بنوائی', '12900', '09/04/22'),
(58, 'کرونا پینٹ', '5 عدد ویل ریوالونگ چئر کے لگوائے برا ئے مال ثالث', '1000', '09/04/22'),
(59, 'طاہر الیکٹریشن', 'تار 90 میٹر برائے کمیٹی آبادی', '1350', '09/04/22'),
(60, 'ذڈ کو الویٹر', '2 عدد لفٹ برائے سرائے ناصر+ 1 عدد لفٹ تحریک جدید ذاہد احمد', '72000', '09/04/22'),
(61, 'مرید بلوچ', 'برائے جنرل دفاتر جوائنٹ شیٹ مرمت', '450', '09/04/22'),
(62, 'میاں الیکٹرک', '8\" اگزاسٹ فین شیشہ والا', '1500', '09/04/22'),
(63, 'زاہد ٹریڈرذ', 'پینٹ کا سامان منگوایا برائے جنرل دفاتر', '52355', '09/04/22');

-- --------------------------------------------------------

--
-- Table structure for table `amad_daftr_letter_entries`
--

CREATE TABLE `amad_daftr_letter_entries` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `name_letter_person` varchar(1000) NOT NULL,
  `contact_no` varchar(1000) NOT NULL,
  `contact_code` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `name_staff` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `amad_daftr_letter_entries`
--

INSERT INTO `amad_daftr_letter_entries` (`id`, `date`, `name_letter_person`, `contact_no`, `contact_code`, `daftr_no`, `name_staff`, `detail`) VALUES
(1, '27/02/22', 'نائب وکیل تنفیز', '0000000', '0000', 'سرائے فضل عمر', 'nill', 'ڈائننگ  ہال کی 20 سی 22 کرسیاں مرمت'),
(3, '27/02/22', 'نائب وکیل تنفیز', '0000000', '0000', 'سرائے  ناصر', 'nill', 'ڈائننگ ہال کے میزوں کی مرمتیں'),
(4, '06/03/22', 'عطاء الرحمان', '0000000', '0000', 'دفترامانت', 'nill', 'ٹیبل کے دو داراز لاک خراب ، ایک عدد کمپیوٹر ٹیبل کا کی بورڈ سٹینڈ لگنے والا'),
(5, '07/03/22', 'وکیل اعلی', '0000000', '0000', 'وکالت علیاء', 'nill', 'گملوں اور درختوں کو رنگ کروانا'),
(6, '09/03/22', 'وکیل تعلیم', '0000000', '0000', 'وکالت تعلیم', 'nill', 'دفتر کے ھال کے مغربی جانب روشنی کم ھے ھال کے وسط میں ایک بیم لائیٹ لگوانے کے لیے لکھا گیا'),
(7, '10/03/22', 'وکیل تعلیم', '0000000', '0000', 'کالت تعلیم', 'nill', 'جامعہ احمدیہ کے تعمیر شدہ کوارترز کی چھت پراگر 1500گیلن (6000 لیٹر) کے تین بڑے فائبر ٹینک رکھ دینےکی درخواست'),
(8, '15/03/22', 'وکیل المال ثانی', '0000000', '0000', 'وکالت المال ثانی', 'nill', 'فرش کی چند ٹائلیں اکھژی،دو عدد سوئچ بٹن خراب،ایک عدد انرجی سیور خراب'),
(9, '19/03/22', 'وکیل مال اول', '0000000', '0000', 'وکالت مال اول', 'مبشر', 'عدد3 بلب اور 1عدد ٹیوب لائٹ خراب'),
(10, '24/03/22', 'وکیل اشاعت', '0000000', '0000', 'وکالت اشاعت', 'nill', 'نئی ریوالونگ کرسی عنایت کرنے کے لیے لکھا گیا'),
(11, '24/03/22', 'وکیل اشاعت', '0000000', '0000', 'وکالت اشاعت', 'nill', 'دفتر ھزا کے میٹنگ روم  باتھ کا کموڈ خراب ھے'),
(12, '24/03/22', 'وکیل وقف نو', '0000000', '0000', 'وکالت وقف نو', 'مبشر', 'مٹننگ روم کا کموڈ خراب، ایک عدد ٹیوب لائٹ خراب'),
(13, '24/03/22', 'وکیل اشاعت', '0000000', '0000', 'وکالت اشاعت', 'nill', 'revolving کرسی خراب'),
(14, '28/03/22', 'وکیل تعمیل و تنفیز', '0000000', '0000', 'سرائے  ناصر', 'nill', 'چھت پر پانی کے پائی کے پائیپ گرمی سے بھت گرم ھو جاتے ھین جس کی وجہ سے واٹر سپلائی شدید گرم ھو جاتی ھے  پانی کے پائیپوں پر انسولیشن کروانے کی درخواست کی گئی'),
(15, '28/03/22', 'وکیل تعمیل و تنفیز', '0000000', '0000', 'سرائے فضل عمر', 'nill', '14 عدد کمروں کے واشرومز میں اگزاسٹ فین  لگوانے کے لیے لکھا گیا'),
(16, '29/03/22', 'سیکٹری مجلس نصرت جہاں', '0000000', '0000', 'مجلس نصرت جہاں', 'nill', 'دفتر کے اے سی کی سروس ہونی ہے'),
(17, '03/04/22', 'وکیل وقف نو', '0000000', '0000', 'وکالت وقف نو', 'nill', 'کی بورڈ ٹرے خراب'),
(18, '06/04/22', 'وکیل مال ثانی', '0000000', '0000', 'وکالت مال ثانی', 'nill', 'اے سی کی سروس کرنے کی ضرورت'),
(19, '09/04/22', 'وکیل وقف نو', '0000000', '0000', 'وکالت وقف نو', 'nill', 'شیشے کو دروازہ کابلے مرمت'),
(20, '09/04/22', 'وکیل تبشیر', '0000000', '0000', 'وکالت تبشیر', 'nill', 'گیس لیکیج'),
(21, '11/04/22', 'وکیل تعلیم', '0000000', '0000', 'وکالت تعلیم', 'nill', 'شعبہ امتحانات میں AC ٹھیک کام نہیں کر رہا'),
(22, '12/04/22', 'وکیل مال اول', '0000000', '0000', 'وکالت مال اول', 'nill', 'یال کا LED bبلب خراب'),
(23, '12/04/22', 'ریاض احمد خان', '0000000', '0000', 'دفتر آڈٹ', 'nill', 'دو عدد بلب خراب'),
(24, '12/04/22', 'وکیل تعلیم', '0000000', '0000', 'وکالت تعلیم', 'nill', 'مین ہال میں اے سی خراب،ٹیوب لائٹ خراب'),
(25, '12/04/22', 'وکیل تصنیف', '0000000', '0000', 'وکالت تصنیف', 'nill', 'ایک عدد فین ڈمر خراب، اے سی خراب اور دوسرے اے سی بھی سروس کرانے ہیں'),
(26, '13/04/22', 'افسر صاھب امانت', '0000000', '0000', 'دفتر امانت', 'nill', 'وزٹنگ روم کا نوٹس بورڈ لگوانے والا ھے   1 ودد ریوالونگ چیئر خراب ھے'),
(27, '13/04/22', 'وکیل اشاعت', '0000000', '0000', 'وکالت اشاعت', 'مبشر', 'اگزاسٹ فین،ٹَیوب لائٹ ،AC کراب'),
(28, '13/04/22', 'وکیل وقف نو', '0000000', '0000', 'وکالت وقف نو', 'nill', 'کی بورڈ ،شیشہ کا دروازہ خراب'),
(29, '13/04/22', 'زیشان احمد ظفر', '0000000', '0000', 'دارالواقفین گیسٹ کواٹر', 'nill', 'پینٹ،باتھ روم کے سیپریج سسٹم کیں مسئلہ،سیلنگ فین کا کپسٹر، انرجی سیور، کی بورڈ بجلی کی تاروں کی بے ترتیبی، دروازوں کی معمولی رگڑائی،ٹیبل خراب'),
(30, '16/04/22', 'ناصر احمد شمس', '0000000', '0000', 'وکالت تبشیر', 'مبشر', 'وکیل تبشیر کے کمرے کی ٹیوب لائیٹ خراب ھے'),
(31, '16/04/22', 'ریاض احمد', '0000000', '0000', 'دارالواقفین', 'nill', 'دارالواقفین میں بجلی  سینٹری  سول ورکس کے مرمتوں کے کام ھونے والے ھیں'),
(32, '17/04/22', 'نائب وکیل تنفیز', '0000000', '0000', 'کوارٹرز 77A,B', 'nill', 'موٹر خراب،کیبنٹ کو فریم گلا،فلش ٹینکی خراب،کموڈ تبدیل ہونے والا،مسلم شاور نیا لگانا،اگزاسٹ فین مرمت،کمرے،کچن،باتھ روم کی جالیاں تبدیل کرنی،دیواروں کی فلنگ اور پینٹ کرنے والا،دیوارو ں سے اے سی اتروایا تھا پلستر کرنے والا، چھت اور کھڑکواں کے بیرونی شیڈ مرمت، مین گیٹ جھک گیا،سیوریج کے مین ہول کا ڈھکن لگنے والا،موٹر سے ٹینک کو جانے والا پائپ گلا،اگزاسٹ فین مرمت،ڈمر کیپ ا درجن اگر میسر ہوسکے');

-- --------------------------------------------------------

--
-- Table structure for table `amad_quater_entries`
--

CREATE TABLE `amad_quater_entries` (
  `id` bigint(255) NOT NULL,
  `maal_type` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `amad_quater_entries`
--

INSERT INTO `amad_quater_entries` (`id`, `maal_type`, `detail`, `amount`, `date`) VALUES
(281, 'ناصر احمد پینٹر', 'کوارٹر نمبر 53 دارالصدر کیلئے رنگ کا سامان منگوایا گیا', '10690', '28/12/21'),
(282, 'مون الیکٹریشن', 'کوارٹر نمبر 43 بیٹری کیلئے ٹرمینل منگوایا', '3490', '28/12/21'),
(283, 'مرید بلوچ', 'دفتر وقف نو+کامن واش روم کیلیے مرمتوں کا کام کیا کل ایوم مستری + مزدور', '900', '27/02/22'),
(284, 'مرید بلوچ', 'کوارٹر نمبر 26 لاک+ دروازے+فریم + گراوت مرمت ۱یوم مستری +مزدور', '1900', '27/02/22'),
(285, 'مرید بلوچ', 'کوارٹر نمبر 64 + دفتر وقف نو+ تبشیر میں مرمتوں کا کام کیا گیا ۱یوم مستری + مزدور', '900', '27/02/22'),
(286, 'مرید بلوچ', 'کوارٹر نمبر 63 دارالصر کیبنٹ + دروازے +اسیسریر مرمت مستری + مزدور ۱ یوم', '1900', '27/02/22'),
(287, 'مرید بلوچ', 'کوارٹر نمبر 63 دارالصر کیبنٹ + دروازے +اسیسریر مرمت مستری + مزدور ۱ یوم', '1900', '27/02/22'),
(288, 'مرتضع مستری', 'کوارٹر نمبر 44 چھت مرمت ۱یوم   مستری + مزدور', '1900', '27/02/22'),
(289, 'مرتضع مستری', 'کوارٹر نمبر 64 مرمتیں کروائی مستری +مزدور۱ یوم', '1900', '27/02/22'),
(290, 'مرتضع مستری', 'کوارٹر نمبر 26 فرش مرمت مستری + مزدور ۱یوم', '1900', '27/02/22'),
(291, 'عوامی بلڈنگ مٹیریل', 'سیمنٹ 15 بیگز جنرل کوارٹرز+کرایہ سیمنٹ', '11145', '27/02/22'),
(292, 'زاویہ اینڈ ڈزائن', 'کوارتر نمبر 21.22 میں سول کا کام کیا', '18000', '27/02/22'),
(293, 'چوہدری الیکٹرک', 'تار 7/29v برائے کوارٹر نمبر 10 گز 56', '3808', '27/02/22'),
(294, 'جاوید الیکٹرک', 'الیکٹرک وائرنگ مرمت برائے کوارٹر نمبر 10', '5000', '27/02/22'),
(295, 'جاوید الیکٹرک', 'الیکٹرک وائرنگ مرمت برائے کوارٹر نمبر 10', '5000', '27/02/22'),
(296, 'آصف موٹر وائنڈنگ', 'لال  2HP پمپ موٹر وائنڈنگ اعدد برائے کوارٹر جنرل فیکڑری ایریا', '1500', '27/02/22'),
(297, 'اقبال پینٹر', 'دروازے میٹ برائےکوارٹر نمبر 4 دارالصدر', '15000', '28/02/22'),
(298, 'اقبال پینٹر', 'پرانا کام ڈسٹیمپر برائے کوارٹر نمبر 17 دارالفتوح', '2000', '28/02/22'),
(299, 'ناصر پینٹر', 'کوارتر نمبر 65 داراصدر میں پینٹ کا کام کروایا', '10690', '01/03/22'),
(300, 'زہیب احمد الیکٹریشن', 'کوارٹر نمبر 64 متفرق کام', '1200', '01/03/22'),
(301, 'عوامی بلڈنگ مٹیریل', 'سیمنٹ + کرایہ  برائے دارالصدر جنرل', '7430', '01/03/22'),
(302, 'عوامی بلڈنگ مٹیریل', 'دارالصدر 26 پٹی +چپس+بلری+ ریڑھا+کرایہ', '9940', '01/03/22'),
(303, 'مرید بلوچ', 'کوارٹر نمبر 65 کرسیاں دروازے ۱ یوم', '900', '02/03/22'),
(304, 'مرتضع مستری', '64 کوارتر نمبر ا یوم مستری + مزدور', '1900', '02/03/22'),
(305, 'بحرین سٹیل', 'فیکٹری ایریا 133 مین گیٹ مرمت', '3600', '02/03/22'),
(306, 'چوہدری الیکٹرک', 'کامن واش روم، چھوٹا کیسٹ ہاوس، مشیر کانونی، دیوان،علیاء میں الیکٹرک کا سامان منگوایا', '3160', '02/03/22'),
(307, 'عبدالحلیم ریاض پینٹر', 'کوارٹر نمبر 46  میں پینٹ، ڈسٹیمپر کا کام کروایا', '22361', '03/03/22'),
(308, 'چوہدری الیکٹرک', 'کوارٹر نمبر 21,22,61,62,63,64  دارالصدر ،33،39دارالفتوح, نماز سینٹر ،فیکٹری ایریا، اوورہییڈ ٹینک  میں الیکٹرک کا سامان منگوایا', '3770', '02/03/22'),
(309, 'ناصر احمد پینٹر', 'کوارٹر نمبر67 دارالصدر میں سفیدی،پینٹ،ڈسٹیمپر کروایا', '6609', '02/03/22'),
(311, 'عامر سینٹری ورکس', 'مرمت جی آی لائن ،ائر پائپن لگوائی ،البو تبدیل کروائی', '8000', '03/03/22'),
(312, 'مرتضع مستری', 'کواٹر نمبر 64.23.35 دارالصدر . دارالفتوح جنرل ورکس  مرمتیں', '10450', '09/03/22'),
(313, 'مرید بلوچ', 'کواٹر 36 دارالسدر .149 نمبر.     دروازوں کی مرمت', '2700', '09/03/22'),
(314, 'طاھر ماربل', 'کواٹر نمبر 26 دارالصدر چپس کی مرمت اور نئی چپس ڈالی گئی', '12477', '09/03/22'),
(315, 'عبدالستار رکشہ ڈرائیور', 'کرایہ رکشہ لکڑی پھٹے شفٹ  1 چکر تعمیر کواٹر سے ورکشاپ', '300', '09/03/22'),
(316, 'عوامی بلڈنگ مٹیریل', '10 بوری سیمنٹ + کرایہ', '7430', '10/03/22'),
(317, 'ناصر احمد پینٹر', 'دارالصدر 26 میں سفیدی کروائی', '6490', '13/03/22'),
(318, 'مرتضع مستری', 'کوارٹر نمبر 35،78،79 دارالصدر ،118 دارالنصر میں باتھ ،فرش،کچن،سیوریج لائن کی مرمتیں کیں', '11400', '16/03/22'),
(319, 'شفیق احمد', 'کوارٹر نمبر 78،79 دارالصدر میں پلستر مرمتیں', '3100', '16/03/22'),
(320, 'ناصر احمد پینٹر', 'درالصدر میں گیٹ اور کوارٹرز کے چھوٹے تمام گیٹ رنگ کئے گئے اور درختوں کو ہرمچی کی', '32725', '17/03/22'),
(321, 'جہلم الیکٹرک', 'عدد1  شیٹ4.5*7.5	برائے کوارٹر 62', '100', '17/03/22'),
(322, 'تبسم الیکیٹرک', '1عدد موٹر پمپ مرمت کروایا', '1300', '19/03/22'),
(323, 'مرید بلوچ', 'کوارٹر دارالصدر چیک پوسٹ  کادروازہ،79 دارالصدر دروازے ،کچن کیبنٹ مرمت ٹوٹل 3 یوم', '2700', '22/03/22'),
(324, 'شفیق مستری', 'دارالصدر 79 پلستر کی مرمتیں', '1200', '22/03/22'),
(325, 'فضیل سینٹری', 'برائے مسجد محمود باونڈری وال', '53900', '29/03/22'),
(326, 'ناصر احمد پینٹر', 'برائے دارالنصر 99 ڈسٹیمپر، پینٹ ، ڈسٹیمپر الماری کروائی', '14717', '29/03/22'),
(327, 'عوامی بلڈنگ مٹیریل', 'برائے دارالنصر118 ریڑھا ریت+۱بوری سیمبٹ منگوائی', '1475', '29/03/22'),
(328, 'عوامی بلڈنگ مٹیریل', 'برائے دارالصدر 35 بوری 10 سیمنٹ +کرایہ سیمنٹ', '7910', '29/03/22'),
(329, 'ناصر احمد پینٹر', 'برائے کوارٹر 116 دارالنصر غربی میں ڈسٹیمپر ،پینٹ ڈسٹیمپر الماری کروائی', '15917', '31/03/22'),
(330, 'ندیم مسیح', 'سیپٹک ٹینک کی صفائی برائے دارالفتوح کالونی', '30000', '03/04/22'),
(331, 'عمران احمد بلڈنگ', 'ٹرالی ریت + ٹرالی ملبہ برائے دارالصر اٹھوایا', '7900', '06/04/22'),
(332, 'الاحمد ٹریڈرذ', 'پلمبنگ کا سامان منگوایا برائے جنرل کوارٹرز', '2390', '06/04/22'),
(333, 'آصف موٹر وائنڈنگ', 'برائے دارالفتوح کوارٹرز کےلئے موٹر پمپ مرمت + موٹر سروس +وال فٹنگ', '1700', '06/04/22'),
(334, 'مرید بلوچ', 'دارالنصر 94،137 میں دروازوں اور کچن کیبنٹ ،الماری کی مرمت', '1350', '06/04/22'),
(335, 'مرید بلوچ', 'دارالنصر 94،137 میں دروازوں اور کچن کیبنٹ ،الماری کی مرمت', '1350', '06/04/22'),
(336, 'ذڈ کو الویٹر', 'لفٹ مرمت برائے سرائے ناصر', '48000', '06/04/22'),
(337, 'ذڈ کو الویٹر', 'لفٹ مرمت', '24000', '06/04/22'),
(338, 'اقبال پینٹر', 'بیرونی ویدرشیلڈ برائے دارالواقفین پرانا کام', '41060', '07/04/22'),
(339, 'زاہد ٹریڈرذ', 'پینبٹ کا سامان منگواہا برائے دارالواقفین', '50440', '09/04/22'),
(340, 'ناصر احمد پینٹر', 'سفیدی اور پینٹ کروایا برائے دارالصدر 74', '5895', '09/04/22'),
(341, 'مرید بلوچ', 'درالصدر 137۔دارالنصر 94 میں مرمتیں کیں', '1350', '09/04/22'),
(342, 'اقبال پینٹر', 'جنرل دفاتر میں پینٹ کا متفرق کام کیا گیا', '44000', '09/04/22'),
(343, 'ندیم مسیح', 'دارالفتوح کاونی کے سیپٹک ٹینک کی صفائی کروائی', '30000', '09/04/22'),
(344, 'طارہر احمد مستری', 'دیوار بر سیمنٹ کی جالیاں لگانے پر برائے بیت محمود', '3800', '09/04/22'),
(345, 'الاحمد ٹریڈرذ', 'پلمبنگ کا متفرق سامان منگوایا برائے جنرک کوارٹرز', '2390', '09/04/22'),
(346, 'الاحمد ٹریڈرذ', 'پینٹ کا سامان منگوایا برائے جنرل دارالصدر کواٹرز', '2390', '09/04/22'),
(347, 'آصف موٹر وائنڈنگ', 'برائے دارالفتوح کواٹرز سیپٹک ٹینک مرمت+ موٹر گندے پانی والی سروس', '1700', '09/04/22'),
(348, 'عمران احمد بلڈنگ', 'ٹرالی ریت+ ٹرالی ملبہ برائے دارالصرر جنرل', '7900', '09/04/22'),
(349, 'اقبال پینٹر', 'دارالواقفین میں ویدر شیٹ لگوائی', '41060', '09/04/22'),
(350, 'چوہدری الیکٹرک', 'چینج اوور + پاور پلگ منگوایا 19 دارالفتوح', '700', '09/04/22'),
(351, 'چوہدری الیکٹرک', 'دارالصدر کوارٹر نمبر 137،23،63،35۔45 دارالنصر 114، دارالفتوح 39 کے لئے بجلی کا سامان منگوایا', '4505', '10/04/22'),
(352, 'عوامی بلڈنگ مٹیریل', '10 بوری سیمنٹ + کرایہ چپس+ کرایہ سیمنٹ برائے جنرل دارالصدر', '8500', '13/04/22'),
(353, 'عوامی بلڈنگ مٹیریل', '5 بوری سیمنٹ +کرایہ دارالنصر 94', '4350', '13/04/22'),
(354, 'عوامی بلڈنگ مٹیریل', 'چپس 27 بوری + ماربل پٹی 175 فٹ برائے دارالصدر جنرل', '7500', '13/04/22'),
(355, 'عوامی بلڈنگ مٹیریل', 'ریت برائے 94 دارالنصر', '700', '13/04/22'),
(356, 'مرتضع مستری', 'مرمتیں برائے دارالفتوح 35،دارالصدر 137، دارالنصر 94', '9850', '13/04/22'),
(357, 'ہائیر اسٹور', '2 عدد فلور اسسٹینڈنگ AC برائے تبشیر لائیبریری منگوایا', '350000', '13/04/22'),
(358, 'المکہ برکس', '1000 اینٹ  برائے بیت محمود', '10000', '18/04/22'),
(359, 'بحرین سٹیل', 'برائے دارالصدر 64،63،144۔10 دارالنصر94 جالی،ارل ،لاک فریم کنڈاتار مرمت', '26160', '18/04/22'),
(360, 'طارق احمد ووڈورکس', 'الماری نکلوائی اور مرمت کروائی', '1500', '18/04/22');

-- --------------------------------------------------------

--
-- Table structure for table `amad_quater_letter_entries`
--

CREATE TABLE `amad_quater_letter_entries` (
  `id` bigint(100) NOT NULL,
  `name_letter_person` varchar(1000) NOT NULL,
  `contact_no` varchar(1000) NOT NULL,
  `contact_code` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `name_staff` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `amad_quater_letter_entries`
--

INSERT INTO `amad_quater_letter_entries` (`id`, `name_letter_person`, `contact_no`, `contact_code`, `quater_no`, `name_staff`, `detail`, `date`) VALUES
(1, 'صباح النظر ملک', '0000000', '0000', 'دارالصدر 140', 'nill', 'کچن کے سنک کی ایک ٹوٹی خراب', '15/02/22'),
(2, 'سید عطا الحی قمر', '0000000', '0000', 'دارالصدر 44', 'nill', 'صحن بعض جگہوں سے ٹوٹا ہوا ہے', '15/02/22'),
(3, 'طارق ارشد', '7979615', '0333', 'دارالصدر26', 'nill', 'سول کی مرمتیں (فرشٗ بارڈرٗ چپسیں) ٗ  لکڑی کی مرمتیں(لاک ٗ المارِی) سوکھا تنا(مالی) ٗ پلمبنگ کی مرمتیں (کموڈ ٗ پانی کی لائن ٗ سنک) ٗ لوہے کی مرمتیں (کھڑکی ٗ تالے ٗ شاور اور واش کی درمیانی دیوار ختم کرنی ہے)', '15/02/22'),
(4, 'سعید شعیب عمراحمد', '55595505', '0335', 'دارالصدر 68', 'مبشر', 'موجودہ نالی ٹوٹ پھوٹ گئی', '27/02/22'),
(5, 'عطاء الکریم', '6707224', '0333', 'دارالانوار39', 'مبشر', '(الیکٹرک ورکس)ا-ٹی-وی لاونچ کے واش روم میں یو پی ایس کا کنکشن بلب کو دینا ہے ۲-واش روم کے ہولڈر خراب ۳-واش روم کی بلب  کا ہولڈر تبدیل کرنا۴-دو کمروں کے بجلی کے بورڈ میں تار لگانی ہے ۵-کمری میں اے سی کی کنکشن میں جو بورڈ ہے اس میں کرنٹ نہیں۶- کچن میں اگزاسٹ فین کو یو پی ایس کو کنکشن دینا ۷-لاونچ کےواش روم کی چھت ٹپکتی ہے اور چھت سے پانی بلب میں آتا (سول ورکس)بالکنی کی دیواروں میں خلا۔ خلا کو بند کرنے کی درخواست', '27/02/22'),
(7, 'شممیم پرویز', '0000000', '0000', 'دارالصدر 9', 'ثمر', 'پانی کی پائپ لائن جوڈ سے مسسلسل لیک کررہی ہے', '05/03/22'),
(8, 'سیف اللہ', '0000000', '0000', 'دارالصدر 78', 'nill', '1:باہر کی دیوار  اندر اور باہر سے ٹیپ ہونے والی، سیمنٹ اکھڑ گیا،چھت کے اوپر بھیب سیمنٹ لگنے والا\r\n2:کچن اور کمرے کی الماریاں خراب \r\nکچن کی ٹوٹی کا پانی بہت  کم آتا', '06/03/22'),
(9, 'طارق ارشد', '7979615', '0333', 'دارالصدر26', 'nill', 'دیواروں اور دروازوں کا رنگ متاثر', '07/03/22'),
(10, 'مبشر منظور', '7965896', '0306', 'دارالفتوح غربی', 'nill', 'گندے پانی کا کوئی حل نکال کر بدبو اور گندے پانی سے نجات دلواِئی جائے', '07/03/22'),
(11, 'محمد داود ظفر', '6528059', '0334', 'دارالصدر 81', 'nill', 'روشندان کے لئے جالی اور جالی نما دروازہ کی ضرورت', '07/03/22'),
(12, 'عبدالشافی', '0000000', '0000', 'دارالصدر 64', 'nill', 'درخت نکلواکر صحن اور دیوار کی مرمت', '07/03/22'),
(13, 'مبارک احمد طاہر', '0000000', '0000', 'دارالنصر 117', 'nill', 'مین واٹر سپلائی میں گند پھنس گیا', '07/03/22'),
(14, 'امین احمد تنویر', '3095826', '0333', 'دارالنصر غربی حبیب 116', 'nill', 'رنگ روغن کرنے والا ہے', '09/03/22'),
(15, 'عبدالسلام طاھر', '0000000', '0000', '22 نمبر دارالفتوح', 'nill', 'چھت سے لیکج کی وجہ سے چھت پر دراڑیں پڑ گئی ھیں مرمت کے لیے لکھا گیا', '10/03/22'),
(16, 'مبشر احمد', '0000000', '0000', 'دارالفتوح کا لونی ٹربائن', 'nill', 'دارالفتوح کالونی میں ٹربائن چلانے کیلئے جنریٹر کا موبل آئل 150گھنٹے چلنے پر آئل +فلٹر تبدیل ہوتا رہا ہےجو کہ اب جنریٹر 143 گھنٹے چل رہا ہے', '10/03/22'),
(17, 'عبدالحلیم', '6366058', '0334', '99 دارالنصر غربی حببیب', 'nill', 'سفیدی کروانے کی درخواست', '12/03/22'),
(18, 'محمد شفیق کارکن وکالت مال الثانی', '0000000', '0000', '74 دارالصدر', 'nill', 'کواٹر میں رنگ و روغن کا کام ھونے والا ھے', '13/03/22'),
(19, 'حافظ محمد ابراہیم', '6706931', '0333', 'دارالصدر 28', 'nill', 'شیڈ کی مرمت،کوارٹر کے اندرونی حصہ کی  مرمتیں،سفیدی کرنے والی ہے', '13/03/22'),
(20, 'عدنان احمد', '7782089', '0331', 'دارالصدر 144', 'nill', 'فرش خراب،کچن اور باتھ روم میں چپس بھی خراب،دیوار پر لگی سیمنٹ کی لیر خراب', '14/03/22'),
(21, 'کلریم احمد', '0000000', '0000', 'دارالصدر62', 'nill', 'گل کی جانب پردہ دوبارہ بنا کر دینے کی اجازت،گیٹ کو ڈور کلوزر لگا ہوا تھا خراب ہو گیا', '15/03/22'),
(22, 'عبدالاطیسید', '6371937', '0334', '42 دارالفتوح غربی', 'nill', 'ٹی وی لاونچ میں سوئچ بورڈ میں فالٹ', '15/03/22'),
(23, 'وکیل تصنیف', '0000000', '0000', 'دارالصدر 4', 'nill', 'واش رہم کے واش بیسن میں خلا اس کو بند کرنے کی ضرورت', '17/03/22'),
(24, 'طاہر احمد', '0000000', '0000', 'دارالصدر 25', 'nill', 'لکڈی کے دروازے کھولنے اور بند کرنے میں مشکل،پانی والی ٹینکی کے پاس مشترکہ دیوار پر نمی موجود', '20/03/22'),
(25, 'سید حنیف احمد قمر', '47913083', '0334', 'دارالصدر 50', 'مبشر', 'پینکھے کا سوئچ خراب', '20/03/22'),
(26, 'نوید مبشر', '0000000', '0000', 'بیت محمود', 'مبشر', 'مین گیٹ کے اوپر دو لائٹس خراب', '22/03/22'),
(27, 'نوید مبشر', '0000000', '0000', 'بیت محمود', 'nill', 'لکڑی کے فریم میں دروازے لگائے وہ قابل مرمت', '20/03/22'),
(28, 'ثاقب کامران صاحب', '0000000', '0000', '19 دارالصدر', 'nill', 'کواٹر میں دونوں طرف صحن کی مرمت اور بعض جگہ وے اینٹ بیٹھ رہی ہے', '24/03/22'),
(29, 'امین احمد تنویر', '3095826', '0333', '116 دارالنصر غربی حبیب', 'nill', 'چونے کی بجاِئے ڈسٹیمپر کرنے کی ضرورت', '24/03/22'),
(30, 'مبشر احمد ڈار', '0000000', '0000', 'دارالصدر 137', 'nill', 'رنگ وروغن کرنا ہے اور بیڈ روم اور ڈاننگ روم کا فرش خراب', '22/03/22'),
(31, 'مبارک احمد طاہر', '6713661', '0333', 'دارانصر غربی حببیب 117', 'nill', 'لکڑی کی مرمت، فلش ٹینکی لیکیج ، صحن کاگروٹ بمعہ گلی', '24/03/22'),
(32, 'عمران احمد', '0000000', '0000', 'دارالنصر 94', 'nill', 'سامنے اور عقبی صحن میں بعض جگہوں میں مرمتیں، واش روم سے نکلنے والی نالی کی مرمت، کوارٹر کے اندر چپس کا فرش ٹوٹا نیز واش روم،کچن اور کمروں کے فرش کی رگڑائی۔ کمروں کی دیوار میں سیمنٹ کی مرمت۔ واش روم میں اگزاسٹ فین لگانے کے لئے شوکٹھا بنوانی ہے۔مین لکڑی کا دروازہ تبدیل کرنا۔الماریوں کے قبضے مرمت اور لاک کی جگہ ٹوٹی۔کمروں کے دروازے ٹھیک طرح سے بند نہہیں ہوتے۔پانی کی سپلاِئی کی مرمت۔ٹالیٹکی ٹینکی مرمت اور بیسن کی مرمت۔ واش روم کاشاور مرمت۔ٹائلیٹ سیٹ ،نلکالیک ۔کچن کے نلکے کا ہینڈل وال ٹوٹا۔لائٹس اور پھنکوں کی مرمت', '27/03/22'),
(36, 'نوید احمد', '0333 6716541', '0333', '139', 'nill', 'واش بیسن ٹوٹ گیا ھے نیا بیہسن لگوانے کے لیے لکھا گیا', '28/03/22'),
(37, 'محمد مدثر', '6714953', '0333', '114', 'nill', 'بجلی کے بورڈ خراب ھیں    کچن کے کیبنٹ نعے بننے والے ھیں   فلش ٹینکی خرزاب ھے  وائیٹ واش ھونے والا ھے', '28/03/22'),
(38, 'طارق محمود منہاس', '0000000', '0000', '38/20 دارالیمن غربی شکر', 'nill', 'گٹر بند ہے', '28/03/22'),
(39, 'اہلیہ حافظ عبد الحفیظ', '0000000', '0000', 'دارالصدر 23', 'nill', 'چھت کے شیڈ اور نالی میں کریکس', '28/03/22'),
(40, 'کاشف علی', '9660495', '0331', '19 دارالفتوح', 'nill', 'سیپٹک ٹینک کے دو پائپ برآمدے میں آرہے ہیں لیک کررہے ہیں', '29/03/22'),
(41, 'ملک طاہر', '0000000', '0000', 'دارالصدر24', 'nill', 'پانی کا پاۃپ باہر سے لیک', '29/03/22'),
(42, 'صبغت اللہ', '5644967', '0333', 'دارالفتوح 17', 'مبشر', 'چینج اوور اور پاور پلگ خراب', '30/03/22'),
(43, 'مرزا فرید احمد', '0000000', '0000', '115دارالنصر', 'nill', 'مشین کو برامدہ میں واش بیسن کی جگہ اور واش بیسن کو باتھ روم میں کونے میں لگوانے کی اجازت', '31/03/22'),
(44, 'طاھر احمد', '0000000', '0000', '34 دارالفتوح', 'nill', 'کواٹر کے لیے درج زیل کام کروانے کی درخواست آئی ۔ ڈسٹمپر ۔  پینٹ  ۔ ٹی وی ٹرالی کی مرمت  ۔ پائیپ کور بالکنی میں', '03/04/22'),
(45, 'نادر محمود', '7634365', '0346', '13 دارالصدر', 'ثمر', 'نل کی لیکج ھے', '03/04/22'),
(46, 'نسیم فرحت', '0000000', '0000', 'دارلصدر23', 'nill', 'نالیاں،شیڈذ،بلب ہولڈرز کی مرمت', '03/04/22'),
(47, 'احسن الجزاء', '4668603', '0335', 'دارالصدر 80', 'nill', 'پانی کی ٹینکی میں دراڈیں پڑنے پربیرونی کوارٹر کی چھت پر رکھنے کی ضرورت', '04/04/22'),
(48, 'طارق حیات', '6713675', '0333', 'دارالصدر 37', 'nill', 'گیس کنکشن میں لیکلیج کا شبہ', '07/04/22'),
(49, 'صبغت اللہ', '0000000', '0000', 'دارالصدر 55', 'مبشر', 'بجلی خراب، فریج، موٹر ۔استری خراب', '11/04/22'),
(50, 'مبارز محمود', '4725507', '0334', '32 دارالفتوح', 'nill', 'پینٹ،سینٹری،بجلی،اور لکڑی کے کام ہونےہیں', '12/04/22'),
(51, 'زیشان احمد ظفر', '0000000', '0000', 'گیسٹ کواتر دارالواقفین', 'nill', 'کواتر دارالواقفین وکالت تبشیر کے ایک مربی صاحب کو الاٹ کرنا مقصود ہے  جس کے مندرجہ زیل کام ہونے والے ھیں  \r\nکواتر کا اندرون رنگ ھونے والا ھے  سیوریج کا کام ھونے والا ھے    بجلی کے کام ھونے والے ھیں   کارپینٹَر کے کام ھونے والے ھیں', '13/04/22'),
(52, 'ومران احمد مربی سلسہ', '0000000', '0000', '94 دارالنصر', 'nill', 'رنگ اور سفیدی کام کروانا مقصود ھے', '13/04/22'),
(53, 'ومران احمد مربی سلسلہ', '0000000', '0000', '94 دارالنصر', 'nill', 'کواٹر کے سیپٹک ٹینک کی صفائی کروانے والی ھے', '13/04/22'),
(54, 'زاھد احمد بٹ', '0000000', '0000', '46 دارالصدر', 'nill', 'کموڈ قابل مرمت ھے', '16/04/22'),
(55, 'عبدالسلام انجم', '0000000', '0000', 'دارالنصر 118', 'شمر', 'کموڈ خراب واش روم کا', '17/04/22'),
(56, 'ملک محمد اکرام', '9764247', '0333', 'دارالنص 93', 'ثمر', 'دو واش رومز کی فلش ٹینکیاں اور مسلم شاور خراب', '18/04/22');

-- --------------------------------------------------------

--
-- Table structure for table `amad_tameer_quater_entries`
--

CREATE TABLE `amad_tameer_quater_entries` (
  `id` bigint(100) NOT NULL,
  `maal_type` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `amad_tameer_quater_entries`
--

INSERT INTO `amad_tameer_quater_entries` (`id`, `maal_type`, `detail`, `amount`, `date`) VALUES
(7, 'کلیم احمد سلیمی بلڈرز', 'برائے تعمیر کوارٹرز دارالفتوح فائنل بل سکنڈ فلور فرش پالش مکمل', '71527', '16/02/22'),
(8, 'عبدالستار رکشہ ڈرائیور', 'سامان شفٹ تعمیر کواٹر سے اورھیڈ ٹینک 3 چکر', '1000', '09/03/22'),
(9, 'عبدالستار رکشہ ڈرائیور', 'سامان شفٹ تعمیر کواٹر سے اورھیڈ ٹینک 3 چکر', '1000', '09/03/22'),
(10, 'چوہدری الیکٹرک', 'راول لیگ + LED 12/w بلب منگوایا', '200', '09/04/22'),
(11, 'عامر سینٹری ورکس', 'باتھ رومز+ کچن فٹنگ+ باتھ سیٹ+کموڈ+ بیسن مکمل', '57750', '13/04/22'),
(12, 'طارق احمد ووڈورکس', 'لکڑی کا  متفرق کام کروایا', '300000', '13/04/22');

-- --------------------------------------------------------

--
-- Table structure for table `amad_tank_entries`
--

CREATE TABLE `amad_tank_entries` (
  `id` bigint(100) NOT NULL,
  `maal_type` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `amad_tank_entries`
--

INSERT INTO `amad_tank_entries` (`id`, `maal_type`, `detail`, `amount`, `date`) VALUES
(3, 'آمد بل بلڈنگ کنٹریکٹر', 'تعمیر کوارٹر دارالفتوح اورہیڈواٹر ٹینک کورڈ ایریا میں پلستر مکمل کیا', '83277 روپے', '2021-11-23'),
(4, 'آمد بل عوامی بلڈنگ میٹریل', 'اور ہیڈ ٹینک دارالفتوح کیلئے 30 عدد بوری بجوائی گئی', '21060 روپے', '2021-11-23'),
(5, 'آمد بل وقار ٹریڈرذ', 'اوور ہیڈ ٹینک سے 60 بوری سیمنٹ منگوائی گئی', '40320 روپے', '2021-11-24'),
(6, 'آمد بل وقار ٹریڈرذ', 'بوری سیمنٹ20عدد برائے اوور ہیڈ ٹینک دارالفتوح منگوائی گئی', '12240 روپے', '2021-11-24'),
(7, 'آمد بل تاج پائپ سٹورلاہور', 'برائے اوور ہیڈ ٹیینک ان لائن اورآوٹ لائن پائپ خریدے گئے', '108436 روپے', '2021-11-24'),
(8, 'الاحمد ٹریڈرذ', '3تالے برائے کمرہ ٹربائین کمرہ جات', '660', '28/02/22'),
(9, 'چوہدری الیکٹرک', 'بجلی کا سامان منگوایا', '40680', '28/02/22'),
(10, 'بحرین سٹیل', 'گلاس فکسنگ  کھڑکی برائے تعمیر کوارٹرز دارالفتوح', '167336', '03/03/22'),
(11, 'کلیم احمد سلیمی', 'فرش، رگڑائی تعمیر کوارٹرز دارالفتوح', '61232', '03/03/22'),
(12, 'مبارک اسٹیل ڈیکوریٹر', 'بیرونی دروازے+ پائپ +چادر منگوائے برائے تعمیر اوورہیڈ تینک', '42525', '13/03/22'),
(13, 'مبارک اسٹیل ڈیکوریٹر', 'ریلنگ سیڑھی + پائپ+ چھوٹا پائپ برائے اوور ہیڈ ٹینک دارالفتوح', '60225', '13/03/22'),
(14, 'طارق احمد ووڈورکس', 'سلائڈنگ دروازے +لیبر+کرایہ رکشہ', '16250', '17/03/22'),
(15, 'جاوید الیکٹرک', 'گراونڈ فلور ٹوٹل کورڈ ایریا ، فرسٹ فلور، سیکنڈ فلور تھرڈ فلور کروانے پر', '22265', '17/03/22'),
(16, 'عمران احمد بلڈنگ', 'اوور ہیڈ ٹینک کی سائڈ سے ملبہ اٹھوایا', '32500', '17/03/22'),
(17, 'وسیم احمد بلڈنگ', 'اوور ہیڈٹینک دارالفتوح کے گرد اپروسس فرش وغیرہ', '26498', '22/03/22'),
(18, 'عمران احمد بلڈنگ', 'سیمنٹ منگوایا', '5200', '09/04/22'),
(19, 'ذاہد ٹریڈرذ', 'پینٹَ کا سامان منگوایا', '23705', '09/04/22');

-- --------------------------------------------------------

--
-- Table structure for table `chair_bill_daftrs`
--

CREATE TABLE `chair_bill_daftrs` (
  `id` bigint(100) NOT NULL,
  `chair_detail` varchar(1000) NOT NULL,
  `chair_amount` varchar(1000) NOT NULL,
  `name` varchar(1000) NOT NULL,
  `per_chair_rate` varchar(1000) NOT NULL,
  `per_seat_rate` varchar(1000) NOT NULL,
  `seat_amount` varchar(1000) NOT NULL,
  `seat_detail` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `chair_daftrs`
--

CREATE TABLE `chair_daftrs` (
  `id` bigint(100) NOT NULL,
  `chair_detail` varchar(1000) NOT NULL,
  `chair_amount` varchar(1000) NOT NULL,
  `name` varchar(1000) NOT NULL,
  `per_chair_rate` varchar(1000) NOT NULL,
  `per_seat_rate` varchar(1000) NOT NULL,
  `seat_amount` varchar(1000) NOT NULL,
  `seat_detail` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `chair_daftrs`
--

INSERT INTO `chair_daftrs` (`id`, `chair_detail`, `chair_amount`, `name`, `per_chair_rate`, `per_seat_rate`, `seat_amount`, `seat_detail`, `daftr_no`, `date`) VALUES
(1, 'بان', '1', 'اعجاز احمد', '1', '22.11', '4.5', '-', 'سرائے  فضلِ عمر گیسٹ ہاوس', '13/03/22');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_bills`
--

CREATE TABLE `daftr_bills` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `mistri_days` varchar(1000) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `mazdur_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_bill_cable_dicts`
--

CREATE TABLE `daftr_bill_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_bill_cable_dicts`
--

INSERT INTO `daftr_bill_cable_dicts` (`id`, `detail`, `laber_name`, `daftr_no`, `day`, `date`, `total`) VALUES
(2, 're', 'uoi', 'وکالت مال ثانی', 'gf', '12/26/2021', '2');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_bill_carpenters`
--

CREATE TABLE `daftr_bill_carpenters` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_bill_marbels`
--

CREATE TABLE `daftr_bill_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `murbah_rate` varchar(1000) NOT NULL,
  `per_murbah_rate` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_bill_marbels`
--

INSERT INTO `daftr_bill_marbels` (`id`, `date`, `day`, `daftr_no`, `detail`, `murbah_rate`, `per_murbah_rate`, `laber_name`) VALUES
(2, '10/12/2021', 'hgf', '324', 'm', '2', '2', 'de');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_bill_painters`
--

CREATE TABLE `daftr_bill_painters` (
  `id` bigint(100) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `kaam_no_1` varchar(1000) NOT NULL,
  `kaam_no_2` varchar(1000) NOT NULL,
  `kaam_no_3` varchar(1000) NOT NULL,
  `rukbah_kaam_no1` varchar(1000) NOT NULL,
  `rukbah_kaam_no2` varchar(1000) NOT NULL,
  `rukbah_kaam_no3` varchar(1000) NOT NULL,
  `per_murbah_rate_kaam1` varchar(1000) NOT NULL,
  `per_murbah_rate_kaam2` varchar(1000) NOT NULL,
  `per_murbah_rate_kaam3` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_bill_painters`
--

INSERT INTO `daftr_bill_painters` (`id`, `painter_name`, `daftr_no`, `day`, `date`, `kaam_no_1`, `kaam_no_2`, `kaam_no_3`, `rukbah_kaam_no1`, `rukbah_kaam_no2`, `rukbah_kaam_no3`, `per_murbah_rate_kaam1`, `per_murbah_rate_kaam2`, `per_murbah_rate_kaam3`) VALUES
(6, 'xZ', 'وکالت مال اوّل', 'ty', '11/19/2021', 'ڈسٹیمپر', 'سفیدی', 'پینٹ', '2', '2', '2', '2', '2', '2');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_bill_paint_days`
--

CREATE TABLE `daftr_bill_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_bill_paint_days`
--

INSERT INTO `daftr_bill_paint_days` (`id`, `total_days`, `painter_name`, `detail`, `daftr_no`, `day`, `date`, `total`) VALUES
(2, '2', 'xZ', 'bj', 'وکالت مال اوّل', 'gf', '22/12/2021', '2'),
(3, '2', 'fds', 'bnmm,', 'وکالت علیاء', 'hgf', '08/01/22', '2');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_cable_dicts`
--

CREATE TABLE `daftr_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_chakars`
--

CREATE TABLE `daftr_chakars` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `name` varchar(1000) NOT NULL,
  `chakar` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_details`
--

CREATE TABLE `daftr_details` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `saman` varchar(5000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_details`
--

INSERT INTO `daftr_details` (`id`, `store_name`, `saman`, `amount`, `daftr_no`, `date`, `per_rate`) VALUES
(2, 'ذاہد ٹریڈرز', 'انپل پینٹ', '4', 'سرائے  فضلِ عمر گیسٹ ہاوس', '28/02/22', '650'),
(3, 'ذاہد ٹریڈرز', 'ڈبی انپل پینٹ', '1', 'سرائے  فضلِ عمر گیسٹ ہاوس', '28/02/22', '200'),
(4, 'ذاہد ٹریڈرز', 'مٹی تیل', '1.5', 'سرائے  فضلِ عمر گیسٹ ہاوس', '28/02/22', '160'),
(5, 'بحرین سٹیل', 'شٹر+گریس مرمت', '4', 'کارواش پوائنٹ', '03/03/22', '750'),
(6, 'چوہدری الیکٹرک', '12/w LED بلب', '2', 'کامن واش روم', '03/03/22', '200'),
(7, 'چوہدری الیکٹرک', '12/w LED بلب', '2', 'مشیر قانونی', '03/03/22', '100'),
(8, 'چوہدری الیکٹرک', '12/w LED بلنب', '1', 'وکالت دایوان', '03/03/22', '200'),
(9, 'چوہدری الیکٹرک', '18/w LED  بلب', '450', 'وکالت علیاء', '03/03/22', '1'),
(10, 'چوہدری الیکٹرک', '12/w LED بلب', '3', 'وکالت علیاء', '03/03/22', '200'),
(11, 'چوہدری الیکٹرک', 'سویچ بٹن چائنہ فٹنگ', '1', 'وکالت علیاء', '03/03/22', '60'),
(12, 'ناصر فائبر', 'پانی کی شارٹیج کے باعث ٹینکر منگوایا', '1', 'جنرل دفاتر', '13/03/22', '1500'),
(13, 'آصف موٹر وائنڈنگ', 'ایمپلیر', '1', 'باغ پانی', '16/03/22', '300'),
(14, 'آصف موٹر وائنڈنگ', 'واٹر سیل', '1', 'باغ پانی', '16/03/22', '100'),
(15, 'آصف موٹر وائنڈنگ', 'سموکر بمعہ ربڑ جین', '1', 'باغ پانی', '16/03/22', '150'),
(16, 'آصف موٹر وائنڈنگ', 'لیبر موتر پمپ مرمت +فٹنگ', '1', 'باغ پانی', '16/03/22', '1000'),
(17, 'مبارک مارکٹ', 'کمرہ نمبر 206 کے اے سی کی مرمت+ سروس', '1', 'سرائے  فضلِ عمر گیسٹ ہاوس', '17/03/22', '1500'),
(18, 'افضل برادرز', 'گھڑی کے لئے سیل منگوائے', '1', 'وکالت مال ثالث', '20/03/22', '60'),
(19, 'مبارک مارکٹ', 'عدد 3 سپلٹ یونٹ گیس چارجنگ', '3', 'سرائے  فضلِ عمر گیسٹ ہاوس', '21/03/22', '3500'),
(20, 'مبارک مارکٹ', 'سپلٹ یونٹ کپسٹر', '1', 'سرائے  فضلِ عمر گیسٹ ہاوس', '21/03/22', '1500'),
(21, 'مبارک مارکٹ', 'سروس وال تبدیل', '1', 'سرائے  فضلِ عمر گیسٹ ہاوس', '21/03/22', '1700'),
(22, 'مبارک مارکٹ', 'سپلٹ مکمل سروس', '3', 'سرائے  فضلِ عمر گیسٹ ہاوس', '21/03/22', '1500'),
(23, 'ذاہد ٹریڈرز', 'تھز', '2', 'جنرل دفاتر', '21/03/22', '1650'),
(24, 'ذاہد ٹریڈرز', 'ڈرمی ویدرشیٹ', '4', 'جنرل دفاتر', '21/03/22', '11000'),
(25, 'ذاہد ٹریڈرز', 'تار برش', '6', 'جنرل دفاتر', '21/03/22', '100'),
(26, 'ذاہد ٹریڈرز', 'روڈ مارکر', '4', 'جنرل دفاتر', '21/03/22', '2800'),
(27, 'ذاہد ٹریڈرز', 'ہرمچی', '1', 'جنرل دفاتر', '21/03/22', '2500'),
(28, 'ذاہد ٹریڈرز', 'کیمیکل', '5', 'جنرل دفاتر', '21/03/22', '1750'),
(29, 'ذاہد ٹریڈرز', 'نیل', '1', 'جنرل دفاتر', '21/03/22', '600'),
(30, 'ذاہد ٹریڈرز', 'تیل مٹی', '11', 'جنرل دفاتر', '21/03/22', '155'),
(31, 'ذاہد ٹریڈرز', 'انپل پینٹ', '3', 'جنرل دفاتر', '21/03/22', '600'),
(32, 'ذاہد ٹریڈرز', 'پٹرول', '6', 'جنرل دفاتر', '21/03/22', '150'),
(33, 'ذاہد ٹریڈرز', 'ریگمال', '2', 'جنرل دفاتر', '21/03/22', '40'),
(34, 'ذاہد ٹریڈرز', 'انپل پینٹ', '2', 'جنرل دفاتر', '21/03/22', '2300'),
(35, 'ذاہد ٹریڈرز', 'کیچر', '9', 'سرائے  فضلِ عمر گیسٹ ہاوس', '21/03/22', '25'),
(36, 'ذاہد ٹریڈرز', 'گلو', '2', 'سرائے  ناصر گیسٹ ہاوس', '21/03/22', '400'),
(37, 'ذاہد ٹریڈرز', 'ڈبی پیچ 1.5 سیاہ', '1', 'سرائے  ناصر گیسٹ ہاوس', '21/03/22', '150'),
(38, 'ذاہد ٹریڈرز', 'کالے ڈبی پیچ 3\"', '1', 'سرائے  ناصر گیسٹ ہاوس', '21/03/22', '350'),
(39, 'ذاہد ٹریڈرز', 'ڈور کلوزر', '2', 'وکالت تبشیر', '21/03/22', '1600'),
(40, 'ذاہد ٹریڈرز', 'ڈبی کالے پیچ 1\"', '1', 'جنرل دفاتر', '21/03/22', '120'),
(41, 'ذاہد ٹریڈرز', 'ہینڈل لاک', '1', 'جنریٹر روم', '21/03/22', '1150'),
(42, 'ذاہد ٹریڈرز', 'چینل 16\" وزنی', '2', 'وکالت مال ثالث', '21/03/22', '480'),
(43, 'ذاہد ٹریڈرز', 'برش 2\"', '1', 'وکالت مال ثالث', '21/03/22', '50'),
(44, 'ذاہد ٹریڈرز', 'CT دستی', '6', 'وکالت تبشیر', '21/03/22', '25'),
(45, 'ذاہد ٹریڈرز', '3/4 لیمینیشن شیٹ', '1', 'جنریٹر روم', '21/03/22', '2200'),
(46, 'ذاہد ٹریڈرز', 'دراز لاک', '10', 'جنریٹر روم', '21/03/22', '130'),
(47, 'ذاہد ٹریڈرز', 'چٹخنی', '5', 'جنریٹر روم', '21/03/22', '40'),
(48, 'الیاس انجینرنگ ورکس', 'کھراد سے کرسی کے لیے گولائیاں بنوائی گئی', '1', 'سرائے  فضلِ عمر گیسٹ ہاوس', '24/03/22', '240'),
(49, 'تبسم الیکٹرکس موٹروائینڈنگ ربوہ', 'بیرنگ 6203 بیرنگ 6202 + لیبرفٹنگ', '2', 'سرائے  ناصر گیسٹ ہاوس', '24/03/22', '400'),
(50, 'تبسم الیکٹرکس موٹروائینڈنگ ربوہ', 'بیرنگ 6203 بیرنگ 6202 + لیبرفٹنگ', '2', 'سرائے  ناصر گیسٹ ہاوس', '24/03/22', '400'),
(51, 'ککو بھائی', 'کین w-D-40', '1', 'لفٹ تحریکِ جدید', '29/03/22', '450'),
(52, 'ماڈرن پینٹ', '4200/14 گیلن ویدرشیلڈ', '3', 'چھوٹا گیسٹ ہاوس', '03/04/22', '4200'),
(53, 'ماڈرن پینٹ', 'وائٹ سیمنٹ', '3', 'چھوٹا گیسٹ ہاوس', '03/04/22', '100'),
(54, 'کرونا پینٹ', 'ویل چیر', '5', 'وکالت مال ثالث', '04/04/22', '200'),
(55, 'طاہر الیکٹریشن', 'پی ٹی سی ایل تار', '15', 'وکالت کمیٹی آبادی', '04/04/22', '90'),
(56, 'ذڈ کو الویٹر', 'لفٹ مرمت', '6', 'لفٹ تحریکِ جدید', '06/04/22', '4000'),
(57, 'ذڈ کو الویٹر', 'لفٹ مرمت برائے سرائے ناصر', '6', 'لفٹ تحریکِ جدید', '06/04/22', '8000'),
(58, 'میاں الیکٹرک', '8\" اگزاسٹ فین شیشہ والا', '1', 'سرائے  ناصر گیسٹ ہاوس', '07/04/22', '1500'),
(59, 'ماڈرن پینٹ', 'گیلن ویدر شیلڈ', '3', 'چھوٹا گیسٹ ہاوس', '09/04/22', '4200'),
(60, 'ماڈرن پینٹ', 'کلو وال کوٹ', '5', 'چھوٹا گیسٹ ہاوس', '09/04/22', '60'),
(61, 'کرونا پینٹ', 'ویل چئر', '5', 'جنرل دفاتر', '09/04/22', '200'),
(62, 'طاہر الیکٹریشن', 'تار میٹر', '90', 'وکالت کمیٹی آبادی', '09/04/22', '15'),
(63, 'میاں الیکٹرک', '8\" ازاسٹ فین شیشہ والا', '1', 'سرائے  ناصر گیسٹ ہاوس', '09/04/22', '1500'),
(64, 'ذاہد ٹریڈرز', 'ویدر شیلڈ', '9', 'جنرل دفاتر', '09/04/22', '2800'),
(65, 'ذاہد ٹریڈرز', 'ہرمچی', '10', 'جنرل دفاتر', '09/04/22', '250'),
(66, 'ذاہد ٹریڈرز', 'گلو ici', '3', 'جنرل دفاتر', '09/04/22', '430'),
(67, 'ذاہد ٹریڈرز', 'پلاسٹک پیرس', '3', 'جنرل دفاتر', '09/04/22', '30'),
(68, 'ذاہد ٹریڈرز', 'انمل پینٹ', '5', 'جنرل دفاتر', '09/04/22', '2300'),
(69, 'ذاہد ٹریڈرز', 'سلور', '2', 'جنرل دفاتر', '09/04/22', '950'),
(70, 'ذاہد ٹریڈرز', 'تیل مٹی', '15', 'جنرل دفاتر', '09/04/22', '155'),
(71, 'ذاہد ٹریڈرز', 'پترول', '5', 'جنرل دفاتر', '09/04/22', '150'),
(72, 'ذاہد ٹریڈرز', 'انمل پینٹ', '2', 'جنرل دفاتر', '09/04/22', '600'),
(73, 'ذاہد ٹریڈرز', 'روڈ مارکنگ', '2', 'جنرل دفاتر', '09/04/22', '2800'),
(74, 'ہائیر اسٹور', 'فلور اسسٹینڈنگ AC', '2', 'لائبریری (دفتر تبشیر)', '13/04/22', '175000');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_detail_carpenters`
--

CREATE TABLE `daftr_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_detail_carpenters`
--

INSERT INTO `daftr_detail_carpenters` (`id`, `date`, `detail`, `daftr_no`, `total_days`, `carpenter_name`, `inc_id`, `amount`, `rate`) VALUES
(2, '25/02/22', 'دروازے مرمت', 'کامن واش روم', '.5', 'مریدبلوچ', '1', '1', '900'),
(3, '25/02/22', 'کرسیاں مرمت', 'دفتر وقفِ نو', '.5', 'مریدبلوچ', '2', '1', '900');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_detail_mistris`
--

CREATE TABLE `daftr_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_detail_mistris`
--

INSERT INTO `daftr_detail_mistris` (`id`, `mistri_name`, `mistri_rate`, `mazdur_rate`, `date`, `daftr_no`, `mistri_total_days`, `detail`, `mazdur_total_days`, `inc_id`) VALUES
(1, 'ذاویہ ڈزائن', '12500', '1', '16/02/22', 'باغ پانی', '1', '۱: ۳عدد ٹو وال تعمیر براِئے مٹی رکوائی/ سپورٹ بمع اندرون وبیرون سطح پر ٹیپ ورک ۲:مرکزی ٹیپ بنوائی برائے نرسری پلیٹ فارم بمع ٹیپ ۳:تیار کردہ سیپٹس کے سامنے اینٹ کی سونگ ورکس بمع گراوٹ ۴: ریمپ ٹو دانر برائے نرسری  شیڈ ۵:چنائی کی ورک برائے لان کیاری', '1', '1');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_detail_painters`
--

CREATE TABLE `daftr_detail_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_marbels`
--

CREATE TABLE `daftr_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_paint_days`
--

CREATE TABLE `daftr_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_paint_days`
--

INSERT INTO `daftr_paint_days` (`id`, `total_days`, `painter_name`, `detail`, `daftr_no`, `date`, `total`) VALUES
(1, '2', 'اقبال پینٹر', 'دروازے 4 عدد کھڑکی ۱ عدد کچن لور پلے اوپر نیچے', 'سرائے  فضلِ عمر گیسٹ ہاوس', '28/02/22', '16000'),
(2, '45', 'ریاض الحسن پینٹر', 'مشاورت کام:سرائےکے سامنےروڈ مارک پینٹ کیا۔تحریک جدید میں درختوں کو ویدر شیٹ کی،تحریک جدید میں درختوِ کو ویدر شیٹ کروائی،تحریک جدید میں گملوں کو صفائی کرکے تاروالے کے ساتھ صفائی اور ویدر شیٹ اور ہرمچی کی گئی تقریبا 1200کے قریب ہے۔چھوٹا گیسٹ ہاوس کی دیوار کو ویدر شیٹ کی گئی مکمل یوم 45 -/38250 ٹیکیداری 10٪ -/3825', 'سرائے  ناصر گیسٹ ہاوس', '16/03/22', '45075'),
(3, '44', 'اقبال پینٹر', 'مین دیوار ویدرشیٹ ہرمچی، سیکورٹی پوسٹ اندر سے پوسٹ کی سیڑھی مین گیٹ 3 عدد باہر کے درخت ہرمچی روڈ مارکنگ برآمدوں میں مرمت وغیرہ  مزدوری 1 یوم 1000 روپے 1 آدمی', 'جنرل دفاتر', '09/04/22', '44000');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_paint_yomiya_bills`
--

CREATE TABLE `daftr_paint_yomiya_bills` (
  `id` bigint(100) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_steels`
--

CREATE TABLE `daftr_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_steel_bills`
--

CREATE TABLE `daftr_steel_bills` (
  `id` bigint(100) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `daftr_stores`
--

CREATE TABLE `daftr_stores` (
  `id` bigint(100) NOT NULL,
  `ishya_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `ext_amount` varchar(1000) NOT NULL,
  `saman_type` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `ext_naqas` varchar(1000) NOT NULL,
  `rate` text NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `naqas` varchar(1000) NOT NULL,
  `detail_shift` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_stores`
--

INSERT INTO `daftr_stores` (`id`, `ishya_name`, `detail`, `ext_amount`, `saman_type`, `date`, `maqam`, `ext_naqas`, `rate`, `amount`, `naqas`, `detail_shift`) VALUES
(9, 'تار 7.44', 'الیکٹرک ورکس', '.5', 'بجلی کا سامان', '24/03/22', 'دارالفتوح اسٹور', '.5', '13500', '6', '5', 'صعنت و تجارت شاپ اے سی');

-- --------------------------------------------------------

--
-- Table structure for table `daftr_yomiya_detail_carpenters`
--

CREATE TABLE `daftr_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `daftr_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `daftr_yomiya_detail_carpenters`
--

INSERT INTO `daftr_yomiya_detail_carpenters` (`id`, `date`, `inc_id`, `daftr_no`, `carpenter_name`, `detail`, `total_days`, `total`) VALUES
(2, '09/03/22', '7', 'سرائے  ناصر گیسٹ ہاوس', 'مریدبلوچ', 'دائینگ ٹیبلوں کی مرمت', '2', '1800'),
(3, '09/03/22', '7', 'سرائے  فضلِ عمر گیسٹ ہاوس', 'مریدبلوچ', 'کرسیوں کی مرمت', '1', '900'),
(4, '16/03/22', '7', 'سرائے  فضلِ عمر گیسٹ ہاوس', 'مریدبلوچ', 'کرسیاں مرمتیں،بیڈ مرمت،،دروازے مرمت،', '4', '3600'),
(5, '16/03/22', '7', 'کامن واش روم', 'مریدبلوچ', 'دروازے مرمت', '1', '900'),
(6, '16/03/22', '7', 'ورکشاپ', 'مریدبلوچ', 'مشین کی سروس', '1', '900'),
(7, '22/03/22', '11', 'سرائے  فضلِ عمر گیسٹ ہاوس', 'مریدبلوچ', '21/3/22 کوشن والی کرسی کی مرمت', '1', '900'),
(8, '22/03/22', '11', 'سرائے  فضلِ عمر گیسٹ ہاوس', 'مریدبلوچ', '22/3/22 کوشن والی کرسی کی مرمت', '1', '900'),
(9, '30/03/22', '16', 'سرائے  فضلِ عمر گیسٹ ہاوس', 'مریدبلوچ', 'کرسی کی مرمت', '1', '900'),
(10, '09/04/22', '19', 'جنرل دفاتر', 'مریدبلوچ', 'جوائنٹ شیٹ مرمت', '1.5', '450'),
(11, '18/04/22', '19', 'لائبریری (دفتر تبشیر)', 'طارو احمد ووڈورکس', 'الماری 7*5 مرمت', '1', '1500');

-- --------------------------------------------------------

--
-- Table structure for table `darul_factory_detail_steels`
--

CREATE TABLE `darul_factory_detail_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuhs`
--

CREATE TABLE `darul_fatuhs` (
  `id` bigint(100) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_fatuhs`
--

INSERT INTO `darul_fatuhs` (`id`, `fatuh_quater_no`) VALUES
(3, 'کوارٹر نمبر 13'),
(4, 'کوارٹر نمبر 14'),
(5, 'کوارٹر نمبر 15'),
(6, 'کوارٹر نمبر 16'),
(7, 'کوارٹر نمبر 17'),
(8, 'کوارٹر نمبر 18'),
(9, 'کوارٹر نمبر 19'),
(10, 'کوارٹر نمبر 20'),
(11, 'کوارٹر نمبر 21'),
(12, 'کوارٹر نمبر 22'),
(13, 'کوارٹر نمبر 23'),
(14, 'کوارٹر نمبر 24'),
(15, 'کوارٹر نمبر 25'),
(16, 'کوارٹر نمبر 26'),
(17, 'کوارٹر نمبر 27'),
(18, 'کوارٹر نمبر 28'),
(19, 'کوارٹر نمبر 29'),
(20, 'کوارٹر نمبر 30'),
(21, 'کوارٹر نمبر 31'),
(22, 'کوارٹر نمبر 32'),
(23, 'کوارٹر نمبر 33'),
(24, 'کوارٹر نمبر 34'),
(25, 'کوارٹر نمبر 35'),
(26, 'کوارٹر نمبر 36'),
(27, 'کوارٹر نمبر 37'),
(28, 'کوارٹر نمبر 38'),
(29, 'کوارٹر نمبر 39'),
(30, 'کوارٹر نمبر 40'),
(31, 'کوارٹر نمبر 41'),
(32, 'کوارٹر نمبر 42'),
(33, 'کوارٹر نمبر 44'),
(34, 'کوارٹر نمبر 45'),
(35, 'کوارٹر نمبر 46'),
(36, 'کوارٹر نمبر 47'),
(37, 'کوارٹر نمبر 48'),
(38, 'کوارٹر نمبر 49'),
(39, 'ٹربائین میٹھا پانی'),
(40, 'موٹر ڈریف لائن'),
(41, 'جرنیٹر ٹربائین'),
(42, 'جنرل کوارٹرذ دارالفتوح');

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuh_details`
--

CREATE TABLE `darul_fatuh_details` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `saman` varchar(5000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_fatuh_details`
--

INSERT INTO `darul_fatuh_details` (`id`, `store_name`, `fatuh_quater_no`, `saman`, `amount`, `date`, `per_rate`) VALUES
(1, 'چوہدری الیکٹرک', 'کوارٹر نمبر 33', 'ہولڈر', '7', '03/03/22', '40'),
(2, 'چوہدری الیکٹرک', 'کوارٹر نمبر 33', 'پییچ', '12', '03/03/22', '2.5'),
(3, 'چوہدری الیکٹرک', 'کوارٹر نمبر 38', 'سوئچ', '1', '03/03/22', '360'),
(4, 'آصف موٹر وائنڈنگ', 'جنرل کوارٹرذ دارالفتوح', 'سیپٹک ٹینک پمپ مرمت', '1', '09/04/22', '500'),
(5, 'آصف موٹر وائنڈنگ', 'جنرل کوارٹرذ دارالفتوح', 'موٹر گندے پانی والی سروس', '1', '09/04/22', '1200'),
(6, 'چوہدری الیکٹرک', 'کوارٹر نمبر 19', 'چینج اوور', '1', '09/04/22', '450'),
(7, 'چوہدری الیکٹرک', 'کوارٹر نمبر 19', 'پاور پلگ', '1', '09/04/22', '250'),
(8, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'کنگ 3/4 چائنہ', '20', '10/04/22', '10'),
(9, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'کیل 1\"', '2', '10/04/22', '30'),
(10, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'لائٹ پلگ لیگ', '2', '10/04/22', '250'),
(11, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'بورڈ 4*4 اوپن', '1', '10/04/22', '65'),
(12, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'LED وولٹ میٹر لائٹ', '1', '10/04/22', '240'),
(13, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'سوئچ', '12', '10/04/22', '30'),
(14, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'پیچ 1.5', '2', '10/04/22', '30'),
(15, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'پیچ 2\"', '2', '10/04/22', '40'),
(16, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'LED 18/w بلب', '1', '10/04/22', '450'),
(17, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'ڈمر پیانو', '1', '10/04/22', '120'),
(18, 'چوہدری الیکٹرک', 'کوارٹر نمبر 39', 'ہولڈر', '4', '10/04/22', '80');

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuh_detail_carpenters`
--

CREATE TABLE `darul_fatuh_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuh_detail_mistris`
--

CREATE TABLE `darul_fatuh_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_fatuh_detail_mistris`
--

INSERT INTO `darul_fatuh_detail_mistris` (`id`, `fatuh_quater_no`, `mistri_rate`, `mazdur_rate`, `mistri_name`, `date`, `mistri_total_days`, `detail`, `mazdur_total_days`, `inc_id`) VALUES
(1, 'کوارٹر نمبر 15', '1200', '700', 'مرتضع مستری', '16/02/22', '1', 'باتھ فلنگ ٹائیل مرمت کچن', '1', '1'),
(2, 'جنرل کوارٹرذ دارالفتوح', '1200', '700', 'مرتضع مستری', '16/02/22', '0.5', 'بیرنی پلنتھ کی مرمتیں', '0.5', '2'),
(3, 'جنرل کوارٹرذ دارالفتوح', '1200', '700', 'مرتضع مستری', '09/03/22', '1', 'سیورج لائین کی مرمتیں', '1', '3'),
(4, 'کوارٹر نمبر 29', '1200', '700', 'مرتضع مستری', '22/03/22', '1', '1\" پائپ اوور ہیڈ ٹینک کا فیل تبدیل کیا', '1', '4'),
(5, 'جنرل کوارٹرذ دارالفتوح', '30000', '1', 'ندیم مسیح', '03/04/22', '1', 'سیپٹک ٹینک کی صفائی', '1', '5'),
(6, 'کوارٹر نمبر 23', '1200', '700', 'مرتضع مستری', '09/04/22', '1', 'سیوریج کی مرمت', '1', '6'),
(7, 'جنرل کوارٹرذ دارالفتوح', '1200', '1', 'مرتضع مستری', '09/04/22', '1', 'مین ہول کی مرمت+ سیوریج کی مرمت', '1', '6'),
(8, 'کوارٹر نمبر 35', '1200', '700', 'مرتضع مستری', '13/04/22', '1', 'بالکنی میں مرمت', '1', '8');

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuh_detail_painters`
--

CREATE TABLE `darul_fatuh_detail_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuh_detail_steels`
--

CREATE TABLE `darul_fatuh_detail_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_fatuh_yomiya_detail_carpenters`
--

CREATE TABLE `darul_fatuh_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasars`
--

CREATE TABLE `darul_nasars` (
  `id` bigint(100) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_nasars`
--

INSERT INTO `darul_nasars` (`id`, `nasar_quater_no`) VALUES
(12, 'کوارٹر نمبر 92'),
(13, 'کوارٹر نمبر 93'),
(14, 'کوارٹر نمبر 94'),
(15, 'کوارٹر نمبر 95'),
(16, 'کوارٹر نمبر 96'),
(17, 'کوارٹر نمبر 97'),
(18, 'کوارٹر نمبر 98'),
(19, 'کوارٹر نمبر 99'),
(20, 'کوارٹر نمبر 100'),
(21, 'کوارٹر نمبر 101'),
(22, 'کوارٹر نمبر 102'),
(23, 'کوارٹر نمبر 103'),
(24, 'کوارٹر نمبر 104'),
(25, 'کوارٹر نمبر 105'),
(26, 'کوارٹر نمبر 106'),
(27, 'کوارٹر نمبر 107'),
(28, 'کوارٹر نمبر 108'),
(29, 'کوارٹر نمبر 109'),
(30, 'کوارٹر نمبر 110'),
(31, 'کوارٹر نمبر 111'),
(32, 'کوارٹر نمبر 112'),
(33, 'کوارٹر نمبر 113'),
(34, 'کوارٹر نمبر 114'),
(35, 'کوارٹر نمبر 115'),
(36, 'کوارٹر نمبر 116'),
(37, 'کوارٹر نمبر 117'),
(38, 'کوارٹر نمبر 118'),
(39, 'کوارٹر نمبر 119'),
(40, 'کوارٹر نمبر 120'),
(41, 'کوارٹر نمبر 121'),
(42, 'کوارٹر نمبر 122'),
(43, 'کوارٹر نمبر 123'),
(44, 'کوارٹر نمبر 124'),
(45, 'موٹر دارالنصر'),
(46, 'پارک دارالنصر'),
(47, 'جنرل کوارٹرذ دارالنصر');

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasar_details`
--

CREATE TABLE `darul_nasar_details` (
  `id` bigint(100) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `saman` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_nasar_details`
--

INSERT INTO `darul_nasar_details` (`id`, `nasar_quater_no`, `saman`, `date`, `store_name`, `amount`, `per_rate`) VALUES
(1, 'کوارٹر نمبر 118', 'ریت+ بوری سیمنٹ', '29/03/22', 'عوامی بلڈنگ مٹیریل', '1', '1475'),
(2, 'کوارٹر نمبر 114', 'سوئچ km', '10/04/22', 'چوہدری الیکٹرک', '10', '30'),
(3, 'کوارٹر نمبر 94', 'ریت', '13/04/22', 'عوامی بلڈنگ مٹیریل', '1', '700'),
(4, 'کوارٹر نمبر 94', 'سیمنٹ+کرایہ', '13/04/22', 'عوامی بلڈنگ مٹیریل', '5', '870');

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasar_detail_carpenters`
--

CREATE TABLE `darul_nasar_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasar_detail_mistris`
--

CREATE TABLE `darul_nasar_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_nasar_detail_mistris`
--

INSERT INTO `darul_nasar_detail_mistris` (`id`, `nasar_quater_no`, `mistri_name`, `mistri_rate`, `mazdur_rate`, `mistri_total_days`, `date`, `detail`, `mazdur_total_days`, `inc_id`) VALUES
(1, 'کوارٹر نمبر 118', 'مرتضع مستری', '1200', '700', '1', '16/03/22', 'سیوریج کی لائن ڈالی', '1', '1'),
(2, 'جنرل کوارٹرذ دارالنصر', 'مرتضع مستری', '1200', '700', '1', '22/03/22', 'وائر سپلائی لاِئن مرمت پر', '1', '2'),
(3, 'کوارٹر نمبر 94', 'مرتضع مستری', '1200', '700', '1', '09/04/22', 'پلستر کی مرمت تاریخ 2/4/22', '1', '3'),
(4, 'کوارٹر نمبر 94', 'مرتضع مستری', '1200', '700', '1', '09/04/22', 'دیواروں کی ٹیپ', '1', '3'),
(5, 'کوارٹر نمبر 94', 'مرتضع مستری', '1200', '700', '1', '09/04/22', 'پلستر کی مرمت تاریخ 6/4/22', '1', '3'),
(6, 'کوارٹر نمبر 94', 'مرتضع مستری', '1200', '700', '1', '13/04/22', 'واٹر سپلائی کی مرمت ۔فرش کی مرمت', '1', '6');

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasar_detail_painters`
--

CREATE TABLE `darul_nasar_detail_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_nasar_detail_painters`
--

INSERT INTO `darul_nasar_detail_painters` (`id`, `date`, `nasar_quater_no`, `painter_name`, `kaam`, `rakbah`, `per_murabah_rate`, `inc_id`) VALUES
(1, '29/03/22', 'کوارٹر نمبر 99', 'ناسر احمد پینٹر', 'ڈسٹیمپر', '4327', '2.5', '1'),
(2, '29/03/22', 'کوارٹر نمبر 99', 'ناسر احمد پینٹر', 'پینٹ', '1100', '3', '1'),
(3, '29/03/22', 'کوارٹر نمبر 99', 'ناسر احمد پینٹر', 'ڈسٹیمپر', '200', '3', '1'),
(4, '31/03/22', 'کوارٹر نمبر 116', 'ناسر احمد پینٹر', 'ڈسٹیمپر', '4327', '2.5', '4'),
(5, '31/03/22', 'کوارٹر نمبر 116', 'ناسر احمد پینٹر', 'پینٹ', '1400', '3', '4'),
(6, '31/03/22', 'کوارٹر نمبر 116', 'ناسر احمد پینٹر', 'ڈسٹیمپر', '300', '3', '4');

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasar_detail_steels`
--

CREATE TABLE `darul_nasar_detail_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_nasar_detail_steels`
--

INSERT INTO `darul_nasar_detail_steels` (`id`, `inc_id`, `detail`, `decorator_name`, `weight`, `amount`, `rate`, `date`, `nasar_quater_no`) VALUES
(1, '1', 'کھڑکیوں کا فریم، تبدیل،جالی کا دروازہ مرمت', 'بحرین سٹیل', '1', '2', '4250', '18/04/22', 'کوارٹر نمبر 94'),
(2, '1', 'کھڑکوں کی جالی تبدیل', 'بحرین سٹیل', '1', '2', '4250', '18/04/22', 'کوارٹر نمبر 94');

-- --------------------------------------------------------

--
-- Table structure for table `darul_nasar_yomiya_detail_carpenters`
--

CREATE TABLE `darul_nasar_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_nasar_yomiya_detail_carpenters`
--

INSERT INTO `darul_nasar_yomiya_detail_carpenters` (`id`, `date`, `inc_id`, `nasar_quater_no`, `carpenter_name`, `detail`, `total_days`, `total`) VALUES
(2, '09/04/22', '18', 'کوارٹر نمبر 94', 'مریدبلوچ', 'کچن کیبنٹ ، الماری کی مرمت', '1.5', '450');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadars`
--

CREATE TABLE `darul_sadars` (
  `id` bigint(100) NOT NULL,
  `quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadars`
--

INSERT INTO `darul_sadars` (`id`, `quater_no`) VALUES
(7, 'کوارٹر نمبر 1'),
(8, 'کوارٹر نمبر2'),
(9, 'کوارٹر نمبر3'),
(10, 'کوارٹر نمبر4'),
(11, 'کوارٹر نمبر5'),
(12, 'کوارٹر نمبر6'),
(13, 'کوارٹر نمبر7'),
(14, 'کوارٹر نمبر8'),
(15, 'کوارٹر نمبر9'),
(16, 'کوارٹر نمبر10'),
(17, 'کوارٹر نمبر11'),
(18, 'کوارٹر نمبر12'),
(19, 'کوارٹر نمبر13'),
(20, 'کوارٹر نمبر14'),
(21, 'کوارٹر نمبر15'),
(22, 'کوارٹر نمبر16'),
(23, 'کوارٹر نمبر17'),
(24, 'کوارٹر نمبر18'),
(25, 'کوارٹر نمبر19'),
(26, 'کوارٹر نمبر20'),
(27, 'کوارٹر نمبر21'),
(28, 'کوارٹر نمبر22'),
(29, 'کوارٹر نمبر23'),
(30, 'کوارٹر نمبر24'),
(31, 'کوارٹر نمبر25'),
(32, 'کوارٹر نمبر26'),
(33, 'کوارٹر نمبر26'),
(34, 'کوارٹر نمبر27'),
(35, 'کوارٹر نمبر28'),
(36, 'کوارٹر نمبر29'),
(37, 'کوارٹر نمبر30'),
(38, 'کوارٹر نمبر31'),
(39, 'کوارٹر نمبر32'),
(40, 'کوارٹر نمبر33'),
(41, 'کوارٹر نمبر34'),
(42, 'کوارٹر نمبر35'),
(43, 'کوارٹر نمبر36'),
(44, 'کوارٹر نمبر37'),
(45, 'کوارٹر نمبر38'),
(46, 'کوارٹر نمبر39'),
(47, 'کوارٹر نمبر40'),
(48, 'کوارٹر نمبر41'),
(49, 'کوارٹر نمبر42'),
(50, 'کوارٹر نمبر43'),
(51, 'کوارٹر نمبر44'),
(52, 'کوارٹر نمبر45'),
(53, 'کوارٹر نمبر46'),
(54, 'کوارٹر نمبر47'),
(55, 'کوارٹر نمبر48'),
(56, 'کوارٹر نمبر49'),
(57, 'کوارٹر نمبر50'),
(58, 'کوارٹر نمبر51'),
(59, 'کوارٹر نمبر52'),
(60, 'کوارٹر نمبر53'),
(61, 'کوارٹر نمبر54'),
(62, 'کوارٹر نمبر55'),
(63, 'کوارٹر نمبر56'),
(64, 'کوارٹر نمبر57'),
(65, 'کوارٹر نمبر58'),
(66, 'کوارٹر نمبر59'),
(67, 'کوارٹر نمبر60'),
(68, 'کوارٹر نمبر61'),
(69, 'کوارٹر نمبر62'),
(70, 'کوارٹر نمبر63'),
(71, 'کوارٹر نمبر64'),
(72, 'کوارٹر نمبر65'),
(73, 'کوارٹر نمبر66'),
(74, 'کوارٹر نمبر67'),
(75, 'کوارٹر نمبر68'),
(76, 'کوارٹر نمبر69'),
(77, 'کوارٹر نمبر70'),
(78, 'کوارٹر نمبر71'),
(79, 'کوارٹر نمبر72'),
(80, 'کوارٹر نمبر73'),
(81, 'کوارٹر نمبر74'),
(82, 'کوارٹر نمبر75'),
(83, 'کوارٹر نمبر76'),
(84, '77A کوارٹر نمبر'),
(85, 'کوارٹر نمبر78'),
(86, 'کوارٹر نمبر79'),
(87, 'کوارٹر نمبر80'),
(88, 'کوارٹر نمبر81'),
(89, 'کوارٹر نمبر82'),
(90, 'کوارٹر نمبر83'),
(91, 'کوارٹر نمبر84'),
(92, 'کوارٹر نمبر85'),
(93, 'کوارٹر نمبر86'),
(94, 'کوارٹر نمبر87'),
(95, 'کوارٹر نمبر88'),
(96, 'کوارٹر نمبر89'),
(97, 'کوارٹر نمبر90'),
(98, 'کوارٹر نمبر134'),
(99, 'کوارٹر نمبر135'),
(100, '136A کوارٹرنمبر '),
(101, 'کوارٹر نمبر137'),
(102, 'کوارٹر نمبر138'),
(103, 'کوارٹر نمبر139'),
(104, 'کوارٹر نمبر140'),
(105, 'کوارٹر نمبر141'),
(106, 'کوارٹر نمبر142'),
(107, 'کوارٹر نمبر143'),
(108, 'کوارٹر نمبر144'),
(109, 'کوارٹر نمبر145'),
(110, 'کوارٹر نمبر146'),
(111, 'کوارٹر نمبر147'),
(112, 'کوارٹر نمبر148'),
(113, 'کوارٹر نمبر149'),
(114, 'جنرل کوارٹرذ دارالصدر'),
(115, 'موٹر پمپ کوارٹرذ دارالصدر'),
(116, 'بیت محمود'),
(117, '77B کوارڑر نمبر'),
(118, 'چلڈرن پارک دارالصدر'),
(119, 'ورکشاپ دارالصدر');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_chakars`
--

CREATE TABLE `darul_sadar_chakars` (
  `id` bigint(100) NOT NULL,
  `chakar` varchar(1000) NOT NULL,
  `name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_chakars`
--

INSERT INTO `darul_sadar_chakars` (`id`, `chakar`, `name`, `detail`, `date`, `total`) VALUES
(3, '1', 'عبدالستار رکشہ ڈرائیور', 'لکڑی پھٹے پھٹیاں وغیرہ شیفٹ کی گئیں', '09/03/22', '300'),
(4, '1', 'ندیم مسیح', 'سیپٹک ٹینک کی صفائی کروائی', '09/04/22', '30000');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_details`
--

CREATE TABLE `darul_sadar_details` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `saman` varchar(5000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_details`
--

INSERT INTO `darul_sadar_details` (`id`, `store_name`, `saman`, `quater_no`, `date`, `per_rate`, `amount`) VALUES
(1, 'عوامی بلڈنگ مٹیریل', 'اینٹ ،بجری۲ ریڑھے ،ریٹ،کرایہ اینٹ،کرایہ بجری', 'جنرل کوارٹرذ دارالصدر', '16/02/22', '16700', '1'),
(2, 'چوہدری الیکٹرک', '7/29گز تار نیشن', 'کوارٹر نمبر10', '27/02/22', '68', '56'),
(3, 'جاوید الیکٹرک', 'الیکترک وائرنگ مرمت پینل بکس + ups وائرنگ', 'کوارٹر نمبر10', '27/02/22', '5000', '1'),
(4, 'جاوید الیکٹرک', 'الیکترک وائرنگ مرمت پینل بکس + ups وائرنگ', 'کوارٹر نمبر10', '27/02/22', '5000', '1'),
(5, 'عوامی بلڈنگ مٹیریل', 'سیمنٹ+کرایہ', 'جنرل کوارٹرذ دارالصدر', '01/03/22', '743', '10'),
(6, 'عوامی بلڈنگ مٹیریل', 'پٹی', 'کوارٹر نمبر26', '01/03/22', '12', '120'),
(7, 'عوامی بلڈنگ مٹیریل', 'چپس سفید', 'کوارٹر نمبر26', '01/03/22', '150', '20'),
(8, 'عوامی بلڈنگ مٹیریل', 'چپس گولڈن', 'کوارٹر نمبر26', '01/03/22', '180', '10'),
(9, 'عوامی بلڈنگ مٹیریل', 'کرایہ (بجری+پٹی+بوری)', 'کوارٹر نمبر26', '01/03/22', '23.33', '30'),
(10, 'عوامی بلڈنگ مٹیریل', 'بجری ریڑھے', 'کوارٹر نمبر26', '01/03/22', '1500', '2'),
(11, 'چوہدری الیکٹرک', 'ڈبہ سویچ', 'کوارٹر نمبر64', '03/03/22', '360', '1'),
(12, 'چوہدری الیکٹرک', 'پیانو ساکٹ', 'کوارٹر نمبر64', '03/03/22', '30', '6'),
(13, 'چوہدری الیکٹرک', '4*4 شیٹ بورڈ', 'کوارٹر نمبر21', '03/03/22', '70', '1'),
(14, 'چوہدری الیکٹرک', 'پییچ', 'کوارٹر نمبر21', '03/03/22', '2.5', '12'),
(15, 'چوہدری الیکٹرک', '4*4 شیٹ بورڈ', 'کوارٹر نمبر22', '03/03/22', '70', '1'),
(16, 'چوہدری الیکٹرک', 'پیگٹ گٹی', 'کوارٹر نمبر22', '03/03/22', '30', '1'),
(17, 'چوہدری الیکٹرک', '4*4شیٹ بورڈ', 'کوارٹر نمبر61', '03/03/22', '70', '1'),
(18, 'چوہدری الیکٹرک', '4*4شیٹ بورڈ', 'کوارٹر نمبر62', '03/03/22', '70', '1'),
(19, 'چوہدری الیکٹرک', '4*4شیٹ بورڈ', 'کوارٹر نمبر63', '03/03/22', '70', '1'),
(20, 'چوہدری الیکٹرک', '12/w LED بلب', 'بیت محمود', '03/03/22', '200', '1'),
(21, 'عوامی بلڈنگ مٹیریل', '10بوری سیمنٹ +کرایہ', 'چلڈرن پارک دارالصدر', '10/03/22', '743', '10'),
(22, 'جہلم الیکٹرک', 'عدد1 شیٹ4.5*7.5', 'کوارٹر نمبر62', '17/03/22', '100', '1'),
(23, 'تبسم الیکٹرک', 'موٹر بیرنگ', 'جنرل کوارٹرذ دارالصدر', '19/03/22', '500', '1'),
(24, 'تبسم الیکٹرک', 'شافٹ', 'جنرل کوارٹرذ دارالصدر', '19/03/22', '550', '1'),
(25, 'تبسم الیکٹرک', 'سیل', 'جنرل کوارٹرذ دارالصدر', '19/03/22', '100', '1'),
(26, 'تبسم الیکٹرک', 'وائر جین', 'جنرل کوارٹرذ دارالصدر', '19/03/22', '150', '1'),
(27, 'عوامی بلڈنگ مٹیریل', 'بوری سیمنٹ +کرایہ', 'جنرل کوارٹرذ دارالصدر', '27/03/22', '865', '10'),
(28, 'فضیل سینٹری', 'جالی سیمنٹ	15*15', 'بیت محمود', '29/03/22', '250', '212'),
(29, 'فضیل سینٹری', 'پکر لوڈر', 'بیت محمود', '29/03/22', '300', '3'),
(30, 'عوامی بلڈنگ مٹیریل', 'سیمنٹ', 'کوارٹر نمبر35', '29/03/22', '775', '10'),
(31, 'عوامی بلڈنگ مٹیریل', 'کرایہ سیمنٹ', 'کوارٹر نمبر35', '29/03/22', '15', '10'),
(32, 'آصف موٹر وائنڈنگ', 'سیپٹک موٹر پمپ مرمت', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '500', '1'),
(33, 'آصف موٹر وائنڈنگ', 'موٹر گندے پابی والی سروس +وال فٹننگ', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '1200', '1'),
(34, 'الاحمد ٹریڈرز', 'wd-40 سپرے', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '520', '1'),
(35, 'الاحمد ٹریڈرز', 'ڈک 4\" کٹائی', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '70', '1'),
(36, 'الاحمد ٹریڈرز', 'ڈک 4\" کٹائی 1m', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '50', '1'),
(37, 'الاحمد ٹریڈرز', 'زذ پلاس', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '340', '1'),
(38, 'الاحمد ٹریڈرز', 'کٹر پلاس', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '450', '1'),
(39, 'الاحمد ٹریڈرز', 'پلاس', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '430', '1'),
(40, 'الاحمد ٹریڈرز', 'رینچ', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '340', '1'),
(41, 'الاحمد ٹریڈرز', 'چابی 10m', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '120', '1'),
(42, 'الاحمد ٹریڈرز', 'ریتی برش', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '70', '1'),
(43, 'عمران احمد بلڈنگ', 'ٹرالی ریت', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '4000', '1'),
(44, 'عمران احمد بلڈنگ', 'ٹرالی ملبہ', 'جنرل کوارٹرذ دارالصدر', '06/04/22', '1300', '3'),
(45, 'الاحمد ٹریڈرز', 'wd-40', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '520', '1'),
(46, 'الاحمد ٹریڈرز', 'ڈک 4\" کٹائی', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '70', '1'),
(47, 'الاحمد ٹریڈرز', 'ڈک 4\" کٹائی 1m', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '50', '1'),
(48, 'الاحمد ٹریڈرز', 'ذر پلاس', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '340', '1'),
(49, 'الاحمد ٹریڈرز', 'کٹر پلاس', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '450', '1'),
(50, 'الاحمد ٹریڈرز', 'پلاس', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '430', '1'),
(51, 'الاحمد ٹریڈرز', 'رینچ', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '340', '1'),
(52, 'الاحمد ٹریڈرز', 'چابی', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '120', '1'),
(53, 'الاحمد ٹریڈرز', 'ریتی برش', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '70', '1'),
(54, 'عمران احمد بلڈنگ', 'ٹرالی ریت', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '400', '1'),
(55, 'عمران احمد بلڈنگ', 'ٹرالی ملبہ', 'جنرل کوارٹرذ دارالصدر', '09/04/22', '1300', '3'),
(56, 'چوہدری الیکٹرک', 'LED 18/w بلب', 'کوارٹر نمبر137', '10/04/22', '450', '1'),
(57, 'چوہدری الیکٹرک', 'ہولڈر', 'کوارٹر نمبر23', '10/04/22', '40', '4'),
(58, 'چوہدری الیکٹرک', 'شیٹ بورڈ 6*8', 'کوارٹر نمبر63', '10/04/22', '250', '1'),
(59, 'چوہدری الیکٹرک', 'شیٹ بورڈ 4*4', 'کوارٹر نمبر35', '10/04/22', '70', '1'),
(60, 'چوہدری الیکٹرک', 'شیٹ بورڈ 4*4', 'کوارٹر نمبر35', '10/04/22', '70', '1'),
(61, 'چوہدری الیکٹرک', 'بیل پوش پیانو', 'کوارٹر نمبر35', '10/04/22', '40', '2'),
(62, 'چوہدری الیکٹرک', 'شیٹ سادہ 6*8', 'کوارٹر نمبر45', '10/04/22', '140', '1'),
(63, 'چوہدری الیکٹرک', 'پاور لیگ شارجہ', 'کوارٹر نمبر45', '10/04/22', '250', '1'),
(64, 'چوہدری الیکٹرک', 'سرکٹ بریکر', 'کوارٹر نمبر45', '10/04/22', '350', '1'),
(65, 'عوامی بلڈنگ مٹیریل', 'چپس', 'جنرل کوارٹرذ دارالصدر', '13/04/22', '200', '27'),
(66, 'عوامی بلڈنگ مٹیریل', 'ماربل پٹی', 'جنرل کوارٹرذ دارالصدر', '13/04/22', '12', '175'),
(67, 'عوامی بلڈنگ مٹیریل', 'سیمنٹ', 'جنرل کوارٹرذ دارالصدر', '13/04/22', '850', '10'),
(68, 'عوامی بلڈنگ مٹیریل', 'کرایہ چپس+ کرایہ سیمنٹ', 'جنرل کوارٹرذ دارالصدر', '13/04/22', '450', '1'),
(69, 'المکہ برکس', 'اینٹ', 'بیت محمود', '18/04/22', '10', '1000');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_detail_carpenters`
--

CREATE TABLE `darul_sadar_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_detail_carpenters`
--

INSERT INTO `darul_sadar_detail_carpenters` (`id`, `date`, `quater_no`, `detail`, `carpenter_name`, `total_days`, `inc_id`, `rate`, `amount`) VALUES
(2, '25/02/22', 'کوارٹر نمبر26', 'دروازے مرمت+اسیزریز تبدیل کیے', 'مریدبلوچ', '1', '1', '900', '1'),
(3, '25/02/22', 'کوارٹر نمبر64', 'کیبنٹ مرمت +دروازے مرمت', 'مریدبلوچ', '2', '2', '900', '1'),
(4, '25/02/22', 'جنرل کوارٹرذ دارالصدر', 'اگزسٹ فریم تیار کیے ۲ عدد', 'مریدبلوچ', '.5', '3', '900', '1');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_detail_mistris`
--

CREATE TABLE `darul_sadar_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_detail_mistris`
--

INSERT INTO `darul_sadar_detail_mistris` (`id`, `mistri_name`, `mistri_rate`, `mazdur_rate`, `mistri_total_days`, `date`, `quater_no`, `detail`, `mazdur_total_days`, `inc_id`) VALUES
(1, 'ذاویہ ڈزائن', '9000', '1', '1', '16/02/22', 'کوارٹر نمبر21', '۱:مزکورہ کوارٹرز کی دیوار کا جزوی حصہ گراکر اینٹ صفائی۲:گراِئی گئی دیوار کی دوبارہ چنائی ورک بمعہ درازی لکھوائی اور پلستر ورک ۳:ڈی-پی-سی سے نیچے سٹوکو پلسٹر ۱۔۵۰اکھاڈ کر دوبارہ ری پلستر ورک کرنا۔۴:دونوں مزکورہ کوارٹرز کے دروازوں کے بیدہ جات بدل کر نئے پلستر تعمیر کر کے دبرہ کنکریٹ بھرائی۔', '1', '1'),
(2, 'ذاویہ ڈزائن', '9000', '1', '1', '16/02/22', 'کوارٹر نمبر22', '۱:مزکورہ کوارٹرز کی دیوار کا جزوی حصہ گراکر اینٹ صفائی۲:گراِئی گئی دیوار کی دوبارہ چنائی ورک بمعہ درازی لکھوائی اور پلستر ورک ۳:ڈی-پی-سی سے نیچے سٹوکو پلسٹر ۱۔۵۰اکھاڈ کر دوبارہ ری پلستر ورک کرنا۔۴:دونوں مزکورہ کوارٹرز کے دروازوں کے بیدہ جات بدل کر نئے پلستر تعمیر کر کے دبرہ کنکریٹ بھرائی۔', '1', '2'),
(3, 'مرتضع مستری', '1200', '700', '3', '16/02/22', 'کوارٹر نمبر43', 'چھت مرمتیں،نالی مرمتیں،شیڈ مرمتیں،چھت ٹائیل', '3', '3'),
(4, 'مرتضع مستری', '1200', '700', '3', '16/02/22', 'کوارٹر نمبر44', 'چھت پر ٹائیل مرمت ،گراوٹ', '3', '4'),
(5, 'مرتضع مستری', '1200', '700', '1', '25/02/22', 'کوارٹر نمبر26', 'شیڈ مرمت+ پلسٹر مرمت٫فرش مرمت', '1', '5'),
(6, 'مرتضع مستری', '1200', '700', '1', '25/02/22', 'کوارٹر نمبر65', 'پلستر مرمتیں', '1', '6'),
(7, 'مرتضع مستری', '1200', '700', '2', '25/02/22', 'کوارٹر نمبر64', 'شیڈ مرمت + پلستر مترمت', '2', '7'),
(8, 'مرتضع مستری', '1200', '700', '1', '25/02/22', 'کوارٹر نمبر44', 'چھت مرمت ٹائیل گراوٹ', '1', '8'),
(9, 'مرتضع مستری', '1200', '700', '3', '02/03/22', 'کوارٹر نمبر26', 'مرمتیں + کمرے کا فرش نیا ڈالا', '3', '9'),
(10, 'مرتضع مستری', '1200', '700', '3', '02/03/22', 'کوارٹر نمبر64', 'دیوار بنانے پر', '5', '10'),
(11, 'مرتضع مستری', '1200', '700', '1.5', '09/03/22', 'سلیکٹ کریں', 'متفرق مرمتیں  شید مرمت کحرکی کی مرمت   پلستر کی مرمتیں', '1.5', '11'),
(12, 'مرتضع مستری', '1200', '700', '1', '09/03/22', 'کوارٹر نمبر23', 'فرش کی مرمتیں گیٹ کا بیرا پلستر کی مرمتیں', '1', '12'),
(13, 'مرتضع مستری', '1200', '700', '1.5', '09/03/22', 'کوارٹر نمبر64', 'متفرق مرمتیں شید مرمت کحرکی کی مرمت پلستر کی مرمتیں', '1.5', '13'),
(14, 'مرتضع مستری', '1200', '700', '1', '09/03/22', 'کوارٹر نمبر35', 'کموڈ کی تبدیلی  شیڈ مرمت  گیٹ بیرا مرمت', '1', '14'),
(15, 'مرتضع مستری', '1200', '700', '3', '16/03/22', 'کوارٹر نمبر35', 'باتھ میں فرش ڈالنے پر،صحن میں مرمتیں،کچن میں کام،ٹائلوں کی تبدیلی', '3', '15'),
(16, 'مرتضع مستری', '1200', '700', '1', '16/03/22', 'کوارٹر نمبر78', 'صحن کی مرمت + پلستر', '1', '16'),
(17, 'مرتضع مستری', '1200', '700', '1', '16/03/22', 'کوارٹر نمبر79', 'صحن کی مرمت', '1', '16'),
(18, 'شفیق مستری', '1200', '700', '1', '16/03/22', 'کوارٹر نمبر78', 'پلستر مرمتیں', '1', '18'),
(19, 'شفیق مستری', '1200', '700', '1', '16/03/22', 'کوارٹر نمبر79', 'پلستر مرمتیں', '1', '18'),
(20, 'ذاویہ ڈزائن', '17666', '1', '1', '19/03/22', 'کوارٹر نمبر61', 'مزکورہ بالا تینوں کوارٹَرز کی باونڈری وال بمعہ دروازہ جات گرائی اور دروازہ چنائی ورک بمیہ درازی نکلوائی ، پلستر ورک برائے دیوار بمطابق ڈیزائن ، دروازہ جات لگوائی بمعہ پلرز کی کنکریٹ بھرائی ورک، باونڈری وال کی ڈی-سی- پی سی سے نیچے زیر سائڈ چپس پلستر  سٹاکو اکھاڑ کر سطح تیاری کرنا اور دوبارہ سٹاکو پلستر کروائی ، مکمل عمومی صفائی ورکس برائے سائٹ', '1', '20'),
(21, 'ذاویہ ڈزائن', '17666', '1', '1', '19/03/22', 'کوارٹر نمبر62', 'مزکورہ بالا تینوں کوارٹَرز کی باونڈری وال بمعہ دروازہ جات گرائی اور دروازہ چنائی ورک بمیہ درازی نکلوائی ، پلستر ورک برائے دیوار بمطابق ڈیزائن ، دروازہ جات لگوائی بمعہ پلرز کی کنکریٹ بھرائی ورک، باونڈری وال کی ڈی-سی- پی سی سے نیچے زیر سائڈ چپس پلستر سٹاکو اکھاڑ کر سطح تیاری کرنا اور دوبارہ سٹاکو پلستر کروائی ، مکمل عمومی صفائی ورکس برائے سائٹ', '1', '20'),
(22, 'ذاویہ ڈزائن', '17666', '1', '1', '19/03/22', 'کوارٹر نمبر63', 'مزکورہ بالا تینوں کوارٹَرز کی باونڈری وال بمعہ دروازہ جات گرائی اور دروازہ چنائی ورک بمیہ درازی نکلوائی ، پلستر ورک برائے دیوار بمطابق ڈیزائن ، دروازہ جات لگوائی بمعہ پلرز کی کنکریٹ بھرائی ورک، باونڈری وال کی ڈی-سی- پی سی سے نیچے زیر سائڈ چپس پلستر  سٹاکو اکھاڑ کر سطح تیاری کرنا اور دوبارہ سٹاکو پلستر کروائی ، مکمل عمومی صفائی ورکس برائے سائٹ', '1', '20'),
(23, 'ذاویہ ڈزائن', '14300', '1', '1', '19/03/22', 'کوارٹر نمبر35', 'تفصیل برایئے سکوپ آف ورکس:بیرونی فرسٹ باونڈری وال تڑوائی بمعہ اینٹ صفائی کروایئی ودوبارہ تعیر کروائی بمعہ درازی نکلوائی ،فرسٹ صحن میں سولنگ کا کچھ حصہاکھیڑ کر دوبارہ درست لیول سے تیار کرنا بمعہ پانی ڈرین کی مکمل مرمت لگوائی، بیک یارڈ میں سویلنگ اکھاڑوائی بمعہ دوبارہ سولنگ لگوائی اور گراوٹ اپ ٹو فٹنگ لیول، ائیر کولر کی جگہ پر چنائی لگا کر پلستر ورک مکمل،\r\nکیر ٹو:۳ عدد لوڈر برائے ریت ٹو مزکورہ کواترٹر بمعہ واپس کیر ٹو سٹور ، ۱/۲ ریڑھا بجری بمعہ واپس کیتر ٹو سٹور', '1', '23'),
(24, 'مرتضع مستری', '1200', '700', '1', '22/03/22', 'کوارٹر نمبر79', 'چھتوں کی مرمتیں (لینٹر و پلستر مرمت)', '1', '24'),
(25, 'مرتضع مستری', '1200', '700', '1', '22/03/22', 'کوارٹر نمبر35', 'کچن سلیب لے لیے تغیے لگائے ،پلستر و فرش مرمت', '1', '24'),
(26, 'مرتضع مستری', '1200', '700', '1', '22/03/22', 'کوارٹر نمبر85', '22/3/22 چھت لینٹر اور پلستر کی مرمتیں', '1', '24'),
(27, 'مرتضع مستری', '1200', '700', '1', '22/03/22', 'کوارٹر نمبر85', '23/3/22 لینٹر کی مرمتیں', '1', '24'),
(28, 'شفیق مستری', '1200', '1', '1', '22/03/22', 'کوارٹر نمبر79', 'پلستر کی مرمتیں', '1', '28'),
(29, 'مرتضع مستری', '1200', '700', '1', '30/03/22', 'کوارٹر نمبر85', 'لینٹر مرمت /پلستر مرمت', '1', '29'),
(30, 'مرتضع مستری', '1200', '700', '1', '30/03/22', 'کوارٹر نمبر85', 'لینٹر مرمت /پلستر مرمت', '1', '29'),
(31, 'مرتضع مستری', '1200', '700', '1', '30/03/22', 'کوارٹر نمبر85', 'لینٹر مرمت /پلستر مرمت', '1', '29'),
(32, 'مرتضع مستری', '1200', '700', '1', '30/03/22', 'کوارٹر نمبر85', 'پلستر مرمت', '1', '29'),
(33, 'مرتضع مستری', '1200', '700', '1', '30/03/22', 'کوارٹر نمبر137', 'فرش کی رگڑائی', '1', '29'),
(34, 'مرتضع مستری', '1200', '700', '1', '30/03/22', 'کوارٹر نمبر137', 'فرش ڈالنے پر', '1', '29'),
(35, 'طاہر احمد مستری', '1200', '700', '1', '09/04/22', 'بیت محمود', 'دوار پر سیمنت کی جالیاں لگا نے پر', '1', '35'),
(36, 'طاہر احمد مستری', '1200', '700', '1', '09/04/22', 'بیت محمود', 'دوار پر سیمنت کی جالیاں لگا نے پر بروز سوموار', '1', '35'),
(37, 'مرتضع مستری', '1200', '700', '4', '13/04/22', 'کوارٹر نمبر137', 'ریت وبجری جمع فرش،واٹر سپلائی کی مرمت،فرش کی مرمت،ماربل پٹی لگائی،فرش کنکریٹ کچہ کیا', '4.5', '37');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_detail_painters`
--

CREATE TABLE `darul_sadar_detail_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_detail_painters`
--

INSERT INTO `darul_sadar_detail_painters` (`id`, `date`, `quater_no`, `painter_name`, `per_murabah_rate`, `rakbah`, `inc_id`, `kaam`) VALUES
(1, '01/03/22', 'کوارٹر نمبر65', 'ناصر احمد پینٹر', '1.5', '4327', '1', 'سفیدی'),
(2, '01/03/22', 'کوارٹر نمبر65', 'ناصر احمد پینٹر', '3', '300', '1', 'ڈسٹیمپر'),
(3, '01/03/22', 'کوارٹر نمبر65', 'ناصر احمد پینٹر', '3', '1100', '1', 'پینٹ'),
(4, '02/03/22', 'کوارٹر نمبر67', 'ناصر احمد پینٹر', '1.5', '2700', '2', 'سفیدی'),
(5, '02/03/22', 'کوارٹر نمبر67', 'ناصر احمد پینٹر', '3', '100', '2', 'ڈسٹیمپر'),
(6, '02/03/22', 'کوارٹر نمبر67', 'ناصر احمد پینٹر', '3', '753', '2', 'پینٹ'),
(7, '13/03/22', 'کوارٹر نمبر26', 'ناسر احمد پینٹر', '1.5', '4327', '7', 'سفیدی'),
(8, '22/03/22', 'کوارٹر نمبر64', 'ریاض الحسن پینٹر', '1.50', '4327', '8', 'سفیدی'),
(9, '22/03/22', 'کوارٹر نمبر64', 'ریاض الحسن پینٹر', '3', '1100', '8', 'پینٹ'),
(10, '22/03/22', 'کوارٹر نمبر64', 'ریاض الحسن پینٹر', '3', '300', '8', 'ڈسٹیمپر'),
(11, '07/04/22', 'کوارٹر نمبر74', 'ناسر احمد پینٹر', '1.5', '2700', '11', 'سفیدی'),
(12, '07/04/22', 'کوارٹر نمبر74', 'ناسر احمد پینٹر', '3', '615', '11', 'پینٹ'),
(13, '09/04/22', 'کوارٹر نمبر74', 'ناسر احمد پینٹر', '1.5', '2700', '13', 'سفیدی'),
(14, '09/04/22', 'کوارٹر نمبر74', 'ناسر احمد پینٹر', '3', '615', '13', 'پینٹ');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_detail_steels`
--

CREATE TABLE `darul_sadar_detail_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_detail_steels`
--

INSERT INTO `darul_sadar_detail_steels` (`id`, `inc_id`, `detail`, `decorator_name`, `weight`, `amount`, `rate`, `quater_no`, `date`) VALUES
(1, '1', 'کھڑکی کو جالی لگوائی', 'بحرین سٹیل', '18', '1', '220', 'کوارٹر نمبر64', '18/04/22'),
(2, '1', 'ارل اور لاک ڈبی مرمت', 'بحرین سٹیل', '1', '1', '1500', 'کوارٹر نمبر63', '18/04/22'),
(3, '1', 'کنڈا اتار (کھاردار)لگوائی', 'بحرین سٹیل', '1', '1', '1500', 'کوارٹر نمبر144', '18/04/22');

-- --------------------------------------------------------

--
-- Table structure for table `darul_sadar_yomiya_detail_carpenters`
--

CREATE TABLE `darul_sadar_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_sadar_yomiya_detail_carpenters`
--

INSERT INTO `darul_sadar_yomiya_detail_carpenters` (`id`, `date`, `inc_id`, `quater_no`, `carpenter_name`, `detail`, `total_days`, `total`) VALUES
(2, '02/03/22', '1', 'جنرل کوارٹرذ دارالصدر', 'مریدبلوچ', 'ورکشاپ میں متفرق کا م کیا', '2', '1800'),
(3, '02/03/22', '2', 'کوارٹر نمبر65', 'مریدبلوچ', 'دروازے مرمت + اسیسریز مرمت', '1', '900'),
(4, '02/03/22', '3', 'کوارٹر نمبر40', 'مریدبلوچ', 'دروازے مرمت + اسیسریز تبدیل', '1', '900'),
(5, '02/03/22', '4', 'کوارٹر نمبر36', 'مریدبلوچ', 'دروازے مرمت + کچن کیبنٹ مرمت', '1', '900'),
(6, '09/03/22', '5', 'کوارٹر نمبر36', 'مرید بلوچ', 'دروازوں کی مرمت', '1', '900'),
(7, '09/03/22', '5', 'کوارٹر نمبر149', 'مریدبلوچ', 'دروازون کی مرمت', '2', '1800'),
(8, '16/03/22', '7', 'کوارٹر نمبر35', 'مرتضع مستری', 'باتھ میں فرش ڈالنے پر،صحن میں مرمتیں،کچن میں کام،ٹائلوں کی تبدیلی', '3', '5700'),
(9, '22/03/22', '8', 'جنرل کوارٹرذ دارالصدر', 'مریدبلوچ', 'چیک پوسٹ کا دروازہ  (نئے بناَئے جانے والے واش روم)', '1', '900'),
(10, '22/03/22', '8', 'کوارٹر نمبر79', 'مریدبلوچ', '19/3/22 دروازے کچن وکیبنٹ مرمت', '1', '900'),
(11, '22/03/22', '8', 'کوارٹر نمبر79', 'مریدبلوچ', '20/3/22 دروازے کچن وکیبنٹ مرمت', '1', '900'),
(12, '30/03/22', '11', 'کوارٹر نمبر85', 'مریدبلوچ', 'کچن کیبنٹ کی مرمت', '1', '900'),
(13, '30/03/22', '11', 'کوارٹر نمبر85', 'مریدبلوچ', 'الماروں کی مرمت', '1', '900'),
(14, '30/03/22', '11', 'کوارٹر نمبر85', 'مریدبلوچ', 'الماریوںکی مرمت', '1', '900'),
(15, '30/03/22', '11', 'سلیکٹ کریں', 'مریدبلوچ', 'کھڑکیں کو جالی لگانے پر', '1', '900'),
(16, '30/03/22', '11', 'سلیکٹ کریں', 'مریدبلوچ', 'کیھڑکیوں اور دروازیں کی مرمت', '1', '900'),
(17, '06/04/22', '16', 'کوارٹر نمبر137', 'مریدبلوچ', 'دروازوں کی مرمت', '1', '900'),
(18, '06/04/22', '16', 'کوارٹر نمبر137', 'مریدبلوچ', 'کچن کیبنٹ ،الماری کی مرمت', '.5', '450'),
(19, '09/04/22', '18', 'کوارٹر نمبر137', 'مریدبلوچ', 'دروازوں کی مرمت', '1', '900');

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeens`
--

CREATE TABLE `darul_waqfeens` (
  `id` bigint(100) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_waqfeens`
--

INSERT INTO `darul_waqfeens` (`id`, `waqfeen_quater_no`) VALUES
(5, 'کوارٹر نمبر 91');

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeen_details`
--

CREATE TABLE `darul_waqfeen_details` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `saman` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_waqfeen_details`
--

INSERT INTO `darul_waqfeen_details` (`id`, `store_name`, `saman`, `date`, `waqfeen_quater_no`, `amount`, `per_rate`) VALUES
(1, 'ذاہد ٹریڈرز', 'ڈرمی ویدرشیلڈ', '09/04/22', 'کوارٹر نمبر 91', '1', '11000'),
(2, 'ذاہد ٹریڈرز', 'کین ویدر شیلڈ', '09/04/22', 'کوارٹر نمبر 91', '14', '2800'),
(3, 'ذاہد ٹریڈرز', 'پیکٹ پاسٹک پیرس', '09/04/22', 'کوارٹر نمبر 91', '3', '30'),
(4, 'ذاہد ٹریڈرز', 'کرایہ', '09/04/22', 'کوارٹر نمبر 91', '1', '150');

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeen_detail_carpenters`
--

CREATE TABLE `darul_waqfeen_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeen_detail_mistris`
--

CREATE TABLE `darul_waqfeen_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeen_detail_painters`
--

CREATE TABLE `darul_waqfeen_detail_painters` (
  `id` bigint(100) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_waqfeen_detail_painters`
--

INSERT INTO `darul_waqfeen_detail_painters` (`id`, `waqfeen_quater_no`, `date`, `painter_name`, `per_murabah_rate`, `rakbah`, `kaam`, `inc_id`) VALUES
(1, 'کوارٹر نمبر 91', '07/04/22', 'اقبال بلڈنگ پینٹر', '5', '8212', 'ویدر شیٹ', '1'),
(2, 'کوارٹر نمبر 91', '09/04/22', 'اقبال بلڈنگ پینٹر', '5', '8212', 'ویدر شیٹ', '2');

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeen_detail_steels`
--

CREATE TABLE `darul_waqfeen_detail_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_waqfeen_yomiya_detail_carpenters`
--

CREATE TABLE `darul_waqfeen_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_details`
--

CREATE TABLE `darul_yaman_details` (
  `id` bigint(100) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `saman` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_detail_carpenters`
--

CREATE TABLE `darul_yaman_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_detail_mistris`
--

CREATE TABLE `darul_yaman_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_yaman_detail_mistris`
--

INSERT INTO `darul_yaman_detail_mistris` (`id`, `mistri_name`, `mistri_rate`, `mazdur_rate`, `mistri_total_days`, `yaman_quater_no`, `detail`, `date`, `mazdur_total_days`, `inc_id`) VALUES
(1, 'مرتضع مستری', '1200', '700', '1', 'کوارٹر 38/20 دارالیمن غربی', 'سیوریج کی مرمت', '08/04/22', '1', '1');

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_detail_painters`
--

CREATE TABLE `darul_yaman_detail_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_detail_steels`
--

CREATE TABLE `darul_yaman_detail_steels` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_quaters`
--

CREATE TABLE `darul_yaman_quaters` (
  `id` bigint(100) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `darul_yaman_quaters`
--

INSERT INTO `darul_yaman_quaters` (`id`, `yaman_quater_no`) VALUES
(2, 'کوارٹر 38/20 دارالیمن غربی');

-- --------------------------------------------------------

--
-- Table structure for table `darul_yaman_yomiya_detail_carpenters`
--

CREATE TABLE `darul_yaman_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `electric_bill_tameer_quaters`
--

CREATE TABLE `electric_bill_tameer_quaters` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL,
  `qisth` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `covered_area` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `electric_bill_water_tanks`
--

CREATE TABLE `electric_bill_water_tanks` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL,
  `qisth` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `covered_area` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `electric_tameer_quaters`
--

CREATE TABLE `electric_tameer_quaters` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL,
  `qisth` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `covered_area` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `electric_water_tanks`
--

CREATE TABLE `electric_water_tanks` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL,
  `qisth` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `covered_area` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `electric_water_tanks`
--

INSERT INTO `electric_water_tanks` (`id`, `store_name`, `detail`, `rate`, `adaigi`, `qisth`, `security_rate`, `covered_area`, `date`) VALUES
(1, 'جاوید الیکٹرک', 'گراونڈ فلور', '15', '2', '1', '1', '625', '16/03/22'),
(2, 'جاوید الیکٹرک', 'فرسٹ فلور', '15', '2', '1', '1', '625', '17/03/22'),
(3, 'جاوید الیکٹرک', 'سیکنڈ فلور', '15', '2', '1', '1', '625', '17/03/22'),
(4, 'جاوید الیکٹرک', 'تھرڈ فلور', '15', '1', '1', '1171', '625', '17/03/22');

-- --------------------------------------------------------

--
-- Table structure for table `factory_areas`
--

CREATE TABLE `factory_areas` (
  `id` bigint(100) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `factory_areas`
--

INSERT INTO `factory_areas` (`id`, `factory_quater_no`) VALUES
(11, 'کوارٹر نمبر 122'),
(12, 'کوارٹر نمبر 123'),
(13, 'کوارٹر نمبر 124'),
(14, 'کوارٹر نمبر 125'),
(15, 'کوارٹر نمبر 126'),
(16, 'کوارٹر نمبر 127'),
(17, 'کوارٹر نمبر 128'),
(18, 'کوارٹر نمبر 128'),
(19, 'کوارٹر نمبر 129'),
(20, 'کوارٹر نمبر 130'),
(21, 'کوارٹر نمبر 131'),
(22, 'کوارٹر نمبر 132'),
(23, 'کوارٹر نمبر 133'),
(24, 'کوارٹر نمبر 134'),
(25, 'کوارٹر نمبر 135'),
(26, '136B کوارٹر نمبر'),
(27, 'موٹر فیکٹری ایریا'),
(28, 'جنرل کوارٹر فیکٹری ایریا'),
(29, 'سیمنٹ اندراج مرمت کوارٹرذ'),
(30, 'ریت + بجری');

-- --------------------------------------------------------

--
-- Table structure for table `factory_area_details`
--

CREATE TABLE `factory_area_details` (
  `id` bigint(100) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `saman` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `per_rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `factory_area_details`
--

INSERT INTO `factory_area_details` (`id`, `store_name`, `saman`, `date`, `factory_quater_no`, `per_rate`, `amount`) VALUES
(1, 'آصف موٹر وائنڈنگ', 'لال فٹ پمپ شافٹ پمپ خراد نئی بنائی', '15/02/22', 'موٹر فیکٹری ایریا', '1200', '1'),
(2, 'آصف موٹر وائنڈنگ', 'واٹر سیل', '15/02/22', 'موٹر فیکٹری ایریا', '120', '1'),
(3, 'آصف موٹر وائنڈنگ', 'قابلے ربڑ جین', '15/02/22', 'موٹر فیکٹری ایریا', '80', '1'),
(4, 'آصف موٹر وائنڈنگ', 'لیبر موٹر پمپ مرمت+ فٹینگ', '15/02/22', 'موٹر فیکٹری ایریا', '1000', '1'),
(5, 'آصف موٹر وائنڈنگ', 'موٹر لال پمپ وائنڈنگ مرمت + فلنگ', '27/02/22', 'جنرل کوارٹر فیکٹری ایریا', '1500', '1'),
(6, 'عامر سینٹری ورکس', 'مین واٹر سپلائی لائن 2\" بائپ لگوائی', '03/03/22', 'جنرل کوارٹر فیکٹری ایریا', '8000', '1'),
(7, 'دکانوں کا نقشہ برائے منظور میوسپل کمیٹی آبادی چناب نگر', 'فیس 188640+متفرق211360', '05/04/22', 'جنرل کوارٹر فیکٹری ایریا', '400000', '1');

-- --------------------------------------------------------

--
-- Table structure for table `factory_area_detail_carpenters`
--

CREATE TABLE `factory_area_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `factory_area_detail_mistris`
--

CREATE TABLE `factory_area_detail_mistris` (
  `id` bigint(100) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `mistri_total_days` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `mazdur_total_days` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `factory_area_detail_painters`
--

CREATE TABLE `factory_area_detail_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `factory_area_yomiya_detail_carpenters`
--

CREATE TABLE `factory_area_yomiya_detail_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `factory_area_yomiya_detail_carpenters`
--

INSERT INTO `factory_area_yomiya_detail_carpenters` (`id`, `date`, `inc_id`, `factory_quater_no`, `carpenter_name`, `detail`, `total_days`, `total`) VALUES
(2, '02/03/22', '1', 'کوارٹر نمبر 133', 'مریدبلوچ', 'دروازے ٹھیک کروائے', '.5', '450');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ishya_quater_tameers`
--

CREATE TABLE `ishya_quater_tameers` (
  `id` bigint(100) NOT NULL,
  `ishya_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `naqas` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ishya_quater_tameers`
--

INSERT INTO `ishya_quater_tameers` (`id`, `ishya_name`, `detail`, `amount`, `date`, `muhala`, `naqas`, `rate`) VALUES
(1, 'نعمان سینٹری سٹور', 'فلیشن ہینڈ  سٹیل', '1', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '1', '627'),
(2, 'نعمان سینٹری سٹور', 'سلوشن 250 گرام', '5', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '5', '334'),
(3, 'نعمان سینٹری سٹور', 'سلوشن  75 گرام', '1', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '1', '125'),
(4, 'نعمان سینٹری سٹور', 'w-c سیٹ', '1', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '1', '1600'),
(5, 'نعمان سینٹری سٹور', 'آری بلیڈ', '1', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '1', '40'),
(6, 'نعمان سینٹری سٹور', 'ساکٹ  4\"', '4', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '4', '272'),
(7, 'نعمان سینٹری سٹور', 'اینڈ کیپ 4\"', '3', '15/02/22', 'تعمیر کوارٹرز دارالفتوح', '3', '240'),
(8, 'چوہدری الیکٹرک', 'راول لیگ', '2', '09/04/22', 'تعمیر کوارٹرز دارالفتوح', '1', '30'),
(9, 'چوہدری الیکٹرک', 'ٰٖLed 12/w بلب', '1', '09/04/22', 'تعمیر کوارٹرز دارالفتوح', '1', '200');

-- --------------------------------------------------------

--
-- Table structure for table `ishya_rateds`
--

CREATE TABLE `ishya_rateds` (
  `id` bigint(100) NOT NULL,
  `ishya_name` varchar(1000) NOT NULL,
  `ishya_type` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ishya_rateds`
--

INSERT INTO `ishya_rateds` (`id`, `ishya_name`, `ishya_type`, `amount`, `date`) VALUES
(5, 'دال چنا', 'دالیں', '136 روپے', '2021-11-23'),
(10, 'دال مسور', 'دالیں', '186 روپے', '2021-11-23'),
(11, 'ٰثابت مسر', 'دالیں', '170 روپے', '2021-11-23'),
(12, 'کا لا چنا', 'دالیں', '136 روپے', '2021-11-23'),
(13, 'سفید چنا چھوٹا', 'دالیں', '146 روپے', '2021-11-23'),
(14, 'سفید چنا بڑا', 'دالیں', '180 روپے', '2021-11-23'),
(15, 'سرخ لوبیا', 'دالیں', '246 روپے', '2021-11-23');

-- --------------------------------------------------------

--
-- Table structure for table `ishya_water_tanks`
--

CREATE TABLE `ishya_water_tanks` (
  `id` bigint(100) NOT NULL,
  `ishya_name` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `naqas` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ishya_water_tanks`
--

INSERT INTO `ishya_water_tanks` (`id`, `ishya_name`, `rate`, `detail`, `date`, `naqas`, `amount`) VALUES
(3, 'چوہدری الیکٹرک', '3400', 'کواِئل تار 3/29  سنگل نیوایج', '28/02/22', '1', '4'),
(4, 'چوہدری الیکٹرک', '7250', 'کوائل تار 7/29 سنگل نیوایج', '28/02/22', '1', '2'),
(5, 'چوہدری الیکٹرک', '130', 'شیٹ 7 ہول 4.5*9.5', '28/02/22', '1', '8'),
(6, 'چوہدری الیکٹرک', '60', 'شیٹ 2 ہول 4.5*4.5', '28/02/22', '1', '1'),
(7, 'چوہدری الیکٹرک', '180', 'شیٹ بورڈ 6ہول   6*8', '28/02/22', '1', '2'),
(8, 'چوہدری الیکٹرک', '40', 'فین شیٹ 6', '28/02/22', '1', '9'),
(9, 'چوہدری الیکٹرک', '30', 'ساکٹ پیانو km', '28/02/22', '1', '18'),
(10, 'چوہدری الیکٹرک', '120', 'ڈمر پیانو km', '28/02/22', '1', '12'),
(11, 'چوہدری الیکٹرک', '10', 'گول ٹکی  4\"', '28/02/22', '1', '6'),
(12, 'چوہدری الیکٹرک', '20', 'کنگ 3/4 کلاسک', '28/02/22', '1', '80'),
(13, 'چوہدری الیکٹرک', '1650', 'DB بکس14 *10', '28/02/22', '1', '1'),
(14, 'چوہدری الیکٹرک', '330', 'بریکر 10/A سنگل لائٹ سٹیل', '28/02/22', '1', '8'),
(15, 'چوہدری الیکٹرک', '750', 'بریکر 63/A کائل', '28/02/22', '1', '1'),
(16, 'چوہدری الیکٹرک', '240', 'وولٹ میٹر DG', '28/02/22', '1', '1'),
(17, 'چوہدری الیکٹرک', '30', 'گول لائٹ DP', '28/02/22', '1', '2'),
(18, 'چوہدری الیکٹرک', '30', 'راہل پلگ', '28/02/22', '1', '3'),
(19, 'چوہدری الیکٹرک', '20', 'ملٹی بکس', '28/02/22', '1', '12'),
(20, 'چوہدری الیکٹرک', '40', 'سلوشن ٹیپ', '28/02/22', '1', '6'),
(21, 'چوہدری الیکٹرک', '40', 'ہولڈر', '28/02/22', '1', '6'),
(22, 'چوہدری الیکٹرک', '40', 'سلنگ روذ', '28/02/22', '1', '3'),
(23, 'چوہدری الیکٹرک', '25', '1.4 پییچ', '28/02/22', '1', '2'),
(24, 'چوہدری الیکٹرک', '60', 'بورڈ 4*4', '28/02/22', '1', '2'),
(25, 'چوہدری الیکٹرک', '340', 'شیٹ بورڈ8*10', '28/02/22', '1', '2'),
(26, 'الاحمدٹریڈرذ', '220', 'تالےبرائے کمرہ جات ٹربائین', '28/02/22', '1', '3'),
(27, 'بحرین سٹیل', '208', '5mm برل گلاس', '03/03/22', '1', '804.5'),
(28, 'عمران احمد بلڈنگ', '1300', 'ٹرالی ملبہ', '17/03/22', '1', '25'),
(29, 'عمران احمد بلڈنگ', '1300', 'سیمنٹ سفید', '09/04/22', '1', '4'),
(30, 'ذاہد ٹریڈرذ', '400', 'ارل 10\"', '09/04/22', '1', '3'),
(31, 'ذاہد ٹریڈرذ', '50', 'دستی 6\"', '09/04/22', '1', '6'),
(32, 'ذاہد ٹریڈرذ', '3', 'چٹخنی', '09/04/22', '1', '150'),
(33, 'ذاہد ٹریڈرذ', '10', 'ICI گلو', '09/04/22', '1', '400'),
(34, 'ذاہد ٹریڈرذ', '12', 'ریگمال', '09/04/22', '1', '40'),
(35, 'ذاہد ٹریڈرذ', '4', 'انمل پینٹ', '09/04/22', '1', '2300'),
(36, 'ذاہد ٹریڈرذ', '155', 'تیل مٹی', '09/04/22', '1', '12'),
(37, 'ذاہد ٹریڈرذ', '600', 'انمل پینٹ', '09/04/22', '1', '1'),
(38, 'ذاہد ٹریڈرذ', '2300', 'مٹی تیل', '09/04/22', '1', '1'),
(39, 'ذاہد ٹریڈرذ', '150', 'پٹرول', '09/04/22', '1', '3');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2021_10_24_032252_create_amad_quater_letter_entry_table', 2);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `quater_bills`
--

CREATE TABLE `quater_bills` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `mistri_days` varchar(1000) NOT NULL,
  `mistri_name` varchar(1000) NOT NULL,
  `mistri_rate` varchar(1000) NOT NULL,
  `mazdur_rate` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `mazdur_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_bill_cable_dicts`
--

CREATE TABLE `quater_bill_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_bill_carpenters`
--

CREATE TABLE `quater_bill_carpenters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `carpenter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_bill_marbels`
--

CREATE TABLE `quater_bill_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `murbah_rate` varchar(1000) NOT NULL,
  `per_murbah_rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_bill_marbels`
--

INSERT INTO `quater_bill_marbels` (`id`, `date`, `day`, `maqam`, `detail`, `quater_no`, `laber_name`, `murbah_rate`, `per_murbah_rate`) VALUES
(3, '10/12/2021', 'gf', 'فیکٹری ایریا', 'm,', '321', 'de', '2', '2'),
(4, '11/10/2021', 'hgf', 'دارالنصر', 'hugjn', '321', 'uoi', '2', '2');

-- --------------------------------------------------------

--
-- Table structure for table `quater_bill_painters`
--

CREATE TABLE `quater_bill_painters` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `per_murbah_rate_kaam1` varchar(1000) NOT NULL,
  `rukbah_kaam_no1` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `rukbah_kaam_no2` varchar(1000) NOT NULL,
  `rukbah_kaam_no3` varchar(1000) NOT NULL,
  `per_murbah_rate_kaam3` varchar(1000) NOT NULL,
  `per_murbah_rate_kaam2` varchar(1000) NOT NULL,
  `kaam_no_1` varchar(1000) NOT NULL,
  `kaam_no_2` varchar(1000) NOT NULL,
  `kaam_no_3` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_bill_painters`
--

INSERT INTO `quater_bill_painters` (`id`, `date`, `day`, `maqam`, `per_murbah_rate_kaam1`, `rukbah_kaam_no1`, `painter_name`, `quater_no`, `rukbah_kaam_no2`, `rukbah_kaam_no3`, `per_murbah_rate_kaam3`, `per_murbah_rate_kaam2`, `kaam_no_1`, `kaam_no_2`, `kaam_no_3`) VALUES
(8, '11/19/2021', 'gh', 'دارالیمن', '2', '2', 'kl', '321', '2', '2', '2', '2', 'پینٹ', 'ڈسٹیمپر', 'سفیدی');

-- --------------------------------------------------------

--
-- Table structure for table `quater_bill_painter_days`
--

CREATE TABLE `quater_bill_painter_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_bill_painter_days`
--

INSERT INTO `quater_bill_painter_days` (`id`, `total_days`, `painter_name`, `detail`, `quater_no`, `day`, `date`, `total`, `muhala`) VALUES
(1, '2', 'kl', 'ghbmn', 'sad', 'gh', '15/01/22', '2', 'دارالیمن');

-- --------------------------------------------------------

--
-- Table structure for table `quater_bill_paint_days`
--

CREATE TABLE `quater_bill_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_bill_paint_days`
--

INSERT INTO `quater_bill_paint_days` (`id`, `total_days`, `painter_name`, `detail`, `date`, `quater_no`, `total`) VALUES
(6, '1', 'اقبال پینٹر', '4 دروازے میٹ', '28/02/22', 'کوارٹر نمبر4', '1500'),
(7, '35', 'ناصر احمد پینٹر', '10فیصد ٹھیکیداری فی یومیہ ریٹ /850 کالونی درالصدر میں گیٹ اور کوارٹرز کے چھوٹے تمام گیٹ رنگ کئے گئے اور درختوں کو ہرمچی کی', '17/03/22', 'جنرل کوارٹرذ دارالصدر', '32725');

-- --------------------------------------------------------

--
-- Table structure for table `quater_factory_cable_dicts`
--

CREATE TABLE `quater_factory_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_factory_marbels`
--

CREATE TABLE `quater_factory_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_factory_paint_days`
--

CREATE TABLE `quater_factory_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `factory_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_fatuh_cable_dicts`
--

CREATE TABLE `quater_fatuh_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_fatuh_marbels`
--

CREATE TABLE `quater_fatuh_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_fatuh_paint_days`
--

CREATE TABLE `quater_fatuh_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(100) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `fatuh_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_fatuh_paint_days`
--

INSERT INTO `quater_fatuh_paint_days` (`id`, `total_days`, `painter_name`, `detail`, `fatuh_quater_no`, `date`, `total`) VALUES
(1, '2', 'اقبال پینٹر', 'ڈسٹیمپر پرانا کام', 'کوارٹر نمبر 17', '28/02/22', '2000');

-- --------------------------------------------------------

--
-- Table structure for table `quater_nasar_cable_dicts`
--

CREATE TABLE `quater_nasar_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_nasar_marbels`
--

CREATE TABLE `quater_nasar_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_nasar_paint_days`
--

CREATE TABLE `quater_nasar_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `nasar_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_sadar_cable_dicts`
--

CREATE TABLE `quater_sadar_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_sadar_cable_dicts`
--

INSERT INTO `quater_sadar_cable_dicts` (`id`, `detail`, `laber_name`, `quater_no`, `date`, `total`) VALUES
(1, 'دیواروں   میں   جھری لگائی', 'زھیب زالیکٹریشن', 'کوارٹر نمبر64', '01/03/22', '1200');

-- --------------------------------------------------------

--
-- Table structure for table `quater_sadar_marbels`
--

CREATE TABLE `quater_sadar_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_sadar_marbels`
--

INSERT INTO `quater_sadar_marbels` (`id`, `date`, `detail`, `laber_name`, `quater_no`, `inc_id`, `color`, `size`, `amount`, `rate_per_bag`, `total_days`) VALUES
(1, '09/03/22', 'چپس رگڑائی  کمرہ بیٹک  ھال ۔ کمرہ 1 کمرہ 2 کمرہ 3 ۔ کچن', 'طاھر ماربل', 'کوارٹر نمبر26', '1', 'سفید گرے', '825', '1', '11', '1'),
(2, '09/03/22', 'نئی چپس برآمدہ', 'طاھر ماربل', 'کوارٹر نمبر26', '2', 'سفید گرے', '243', '1', '14', '1');

-- --------------------------------------------------------

--
-- Table structure for table `quater_steel_bills`
--

CREATE TABLE `quater_steel_bills` (
  `id` bigint(100) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_steel_bills`
--

INSERT INTO `quater_steel_bills` (`id`, `quater_no`, `day`, `date`, `muhala`, `decorator_name`, `amount`, `weight`, `rate`, `detail`) VALUES
(1, 'sad', 'das', '15/01/22', 'دارالنصر', 'hdf', '2', '2', '2', 'fkjdaad'),
(2, 'sdf', 'gf', '11/10/2021', 'دارالیمن', 'uyt', '2', '2', '2', 'hvbn');

-- --------------------------------------------------------

--
-- Table structure for table `quater_stores`
--

CREATE TABLE `quater_stores` (
  `id` bigint(100) NOT NULL,
  `ishya_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `saman_type` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `ext_amount` varchar(1000) NOT NULL,
  `ext_naqas` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `naqas` varchar(1000) NOT NULL,
  `detail_shift` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_stores_tameers`
--

CREATE TABLE `quater_stores_tameers` (
  `id` bigint(100) NOT NULL,
  `ishya_name` varchar(100) NOT NULL,
  `saman_type` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `ext_amount` varchar(1000) NOT NULL,
  `ext_naqas` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `naqas` varchar(1000) NOT NULL,
  `detail_shift` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_tameer_steels`
--

CREATE TABLE `quater_tameer_steels` (
  `id` bigint(100) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_tameer_thekedars`
--

CREATE TABLE `quater_tameer_thekedars` (
  `id` bigint(100) NOT NULL,
  `thekedar_name` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `thekedar_type` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `mrubah_rate` varchar(1000) NOT NULL,
  `mrubah_per_rate` varchar(1000) NOT NULL,
  `progress` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `quater_tameer_thekedars`
--

INSERT INTO `quater_tameer_thekedars` (`id`, `thekedar_name`, `muhala`, `thekedar_type`, `detail`, `mrubah_rate`, `mrubah_per_rate`, `progress`, `security_rate`, `date`, `adaigi`) VALUES
(1, 'کلیم احمد سلیمی', 'دارالفتوح', 'سول ورکس', 'کام مکمل بمعہ فرش سکنڈ فلور', '3391.5', '370', '6', '3764', '16/02/22', '1'),
(2, 'عامر ریاض', 'دارالفتوح', 'سینٹری  کنٹریکٹر', 'باتھ رومز+کچن فٹنگ ،باتھ سیٹ،کموڈ،بیسن مکمل', '6875', '21', '40', '1', '13/04/22', '1');

-- --------------------------------------------------------

--
-- Table structure for table `quater_waqfeen_cable_dicts`
--

CREATE TABLE `quater_waqfeen_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_waqfeen_marbels`
--

CREATE TABLE `quater_waqfeen_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_waqfeen_paint_days`
--

CREATE TABLE `quater_waqfeen_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `waqfeen_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_yaman_cable_dicts`
--

CREATE TABLE `quater_yaman_cable_dicts` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_yaman_marbels`
--

CREATE TABLE `quater_yaman_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `laber_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `size` varchar(1000) NOT NULL,
  `color` varchar(1000) NOT NULL,
  `rate_per_bag` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `quater_yaman_paint_days`
--

CREATE TABLE `quater_yaman_paint_days` (
  `id` bigint(100) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `yaman_quater_no` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `sadar_paint_yomiya_bills`
--

CREATE TABLE `sadar_paint_yomiya_bills` (
  `id` bigint(100) NOT NULL,
  `quater_no` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `total` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `total_days` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `steel_decorator_bill_tameers`
--

CREATE TABLE `steel_decorator_bill_tameers` (
  `id` bigint(100) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `kraya_chakr` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `per_kg` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `steel_decorator_bill_tanks`
--

CREATE TABLE `steel_decorator_bill_tanks` (
  `id` bigint(100) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `per_kg` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `kraya_chakr` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `steel_decorator_tanks`
--

CREATE TABLE `steel_decorator_tanks` (
  `id` bigint(100) NOT NULL,
  `decorator_name` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `steel_decorator_tanks`
--

INSERT INTO `steel_decorator_tanks` (`id`, `decorator_name`, `detail`, `date`, `inc_id`, `weight`, `rate`, `amount`) VALUES
(1, 'مبارک اسٹیل ڈیکوریٹر', 'ریلنگ سیڑی ، پائپ \"2*2\"(16گیج)', '13/03/22', '1', '219', '275', '1'),
(2, 'مبارک اسٹیل ڈیکوریٹر', 'بیررونی دروازے، پائپ (16گیج)،چادر (18 گیج)', '13/03/22', '2', '47.25', '300', '3');

-- --------------------------------------------------------

--
-- Table structure for table `stores`
--

CREATE TABLE `stores` (
  `id` bigint(255) NOT NULL,
  `ishya_name` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `saman_type` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `naqas` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `stores`
--

INSERT INTO `stores` (`id`, `ishya_name`, `maqam`, `detail`, `amount`, `saman_type`, `date`, `naqas`, `rate`) VALUES
(1, 'کرش', 'چلڈرن پارک اسٹور', 'سول ورکس میٹیل', '40', 'سول کا سامان', '27/03/22', '20', '68'),
(2, 'سیمنٹ', 'چلڈرن پارک اسٹور', 'سول ورکس میٹیریل', '130', 'سول کا سامان', '27/03/22', '126', '710'),
(3, 'ریت چناب', 'چلڈرن پارک اسٹور', 'سول ورکس میٹیل', '250', 'سول کا سامان', '27/03/22', '50', '16'),
(4, 'سرامکس تائیل 24\" * 24\"', 'سلیکٹ کریں', 'سول ورکس', '14', 'سلیکٹ کریں', '14/02/22', '1', '2100'),
(5, 'سرمکس ٹائیل 16\" * 10\"', '150 دارالصدر اسٹور', 'سول ورکس', '4', 'سول کا سامان', '14/02/22', '0', '1800'),
(6, 'سرامکس ٹائیل 12\"*12\"', '150 دارالصدر اسٹور', 'سرامکس ڑائیل', '8', 'سول کا سامان', '14/02/22', '0', '1800'),
(7, 'سراکس ٹئیل 12\"*8\"', '150 دارالصدر اسٹور', 'سول ورکس', '12', 'سول کا سامان', '14/02/22', '0', '1800'),
(8, 'سرامکس ٹائیل 16\"*16\"', '150 دارالصدر اسٹور', 'سول ورکس', '5', 'سول کا سامان', '14/02/22', '0', '1800'),
(9, 'سرامکس ٹئیل 6\"*6\"', '150 دارالصدر اسٹور', 'سول ورکس', '30', 'سول کا سامان', '14/02/22', '0', '1600'),
(10, 'پولتھین شیٹ', 'اسٹور 150', 'سول ورکس ', '1', 'سول ورکس ', '27/03/22', '0', '3500'),
(11, 'فلنگ ٹائیل ', 'اسٹور 150', 'سول ورکس میٹریل ', '7', 'سول ورکس ', '27/03/22', '1', '350'),
(12, 'سرامکس ٹائیل 12\"*12\"', '150 دارالصدر اسٹور', 'سول ورکس', '12', 'سینٹری کا سامان', '05/03/22', '0', '1200'),
(13, 'بچومن پیپر', '150 دارالصدر اسٹور', 'تارکول والا کاغز', '8', 'سول کا سامان', '05/03/22', '0', '500'),
(14, 'کنڈا تار', '150 دارالصدر اسٹور', 'اریزر وائیر وزن کلو', '17', 'سول کا سامان', '05/03/22', '11', '450'),
(15, 'ربڑھ رول', '150 دارالصدر اسٹور', 'ربڑھ رول', '1', 'ھارڈوئیر کا سامان', '05/03/22', '0', '100'),
(16, 'بجر', 'چلڈرن پارک اسٹور', 'بجر مقدار فی فٹ', '300', 'سول کا سامان', '05/03/22', '150', '32'),
(17, 'پائیپ 1\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی پائیپ', '5', 'سینٹری کا سامان', '05/03/22', '1', '700'),
(18, 'پائیپ 1.5\" پی وی سی', '150 دارالصدر اسٹور', 'پائیپ پی وی سی', '8', 'سینٹری کا سامان', '05/03/22', '2', '900'),
(19, 'پائیپ پی وی سی 3\"', '150 دارالصدر اسٹور', 'پی وی سی پائیپ', '10', 'سینٹری کا سامان', '05/03/22', '1', '1800'),
(20, 'پائیپ 6\" پی وی سی', '150 دارالصدر اسٹور', 'پائیپ پی وی سی', '1', 'سینٹری کا سامان', '05/03/22', '0', '8500'),
(21, 'پائیپ 8\" پی وی سی', '150 دارالصدر اسٹور', 'پائییپ پی وی سی', '3', 'سینٹری کا سامان', '05/03/22', '0', '9500'),
(22, 'ایلبو 2\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '27', 'سینٹری کا سامان', '05/03/22', '0', '120'),
(23, 'ایلبو3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '130', 'سینٹری کا سامان', '05/03/22', '1', '275'),
(24, 'ایلبو 2\"*45°', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '65', 'سینٹری کا سامان', '05/03/22', '0', '80'),
(25, 'ایلبو 3\"*45 ڈگری', '150 دارالصدر اسٹور', 'پی وپ سی فٹنگ', '51', 'سینٹری کا سامان', '05/03/22', '0', '265'),
(26, 'ایلبو 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '63', 'سینٹری کا سامان', '05/03/22', '0', '280'),
(27, 'ایلبو پی وی سی 6\"*45°', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '1', 'سینٹری کا سامان', '05/03/22', '0', '950'),
(28, 'ایلبو پی وی سی 10\"', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '0', '1050'),
(29, 'پلگ ایلبو 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '9', 'سینٹری کا سامان', '05/03/22', '0', '450'),
(30, 'پلگ ایلبو 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '7', 'سینٹری کا سامان', '05/03/22', '0', '250'),
(31, 'ٹی 2\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '9', 'سینٹری کا سامان', '05/03/22', '0', '195'),
(32, 'ٹی 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '206', 'سینٹری کا سامان', '05/03/22', '0', '330'),
(33, 'ٹی 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '77', 'سینٹری کا سامان', '05/03/22', '0', '465'),
(34, 'پلگ ٹی 2\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '1', 'سینٹری کا سامان', '05/03/22', '0', '150'),
(35, 'پلگ تی 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '34', 'سینٹری کا سامان', '05/03/22', '1', '350'),
(36, 'پلگ ٹی 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '50', 'سینٹری کا سامان', '05/03/22', '0', '550'),
(37, 'وائے ٹی 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '54', 'سینٹری کا سامان', '05/03/22', '0', '365'),
(38, 'وائے ٹی 4\" پی وی بسی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '30', 'سینٹری کا سامان', '05/03/22', '0', '470'),
(39, 'وائے ٹی 6*4\"', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '10', 'سینٹری کا سامان', '05/03/22', '0', '1100'),
(40, 'پلگ وائے ٹی 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '21', 'سینٹری کا سامان', '05/03/22', '0', '380'),
(41, 'پلگ وائے ٹی 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '15', 'سینٹری کا سامان', '05/03/22', '0', '465'),
(42, 'ساکٹ 2\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '32', 'سینٹری کا سامان', '05/03/22', '0', '75'),
(43, 'ساکٹ 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '6', 'سینٹری کا سامان', '05/03/22', '0', '180'),
(44, 'ساکٹ 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '6', 'سینٹری کا سامان', '05/03/22', '0', '195'),
(45, 'ساکٹ 6\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '5', 'سینٹری کا سامان', '05/03/22', '0', '550'),
(46, 'بش ساکٹ 4\"*3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '3', 'سینٹری کا سامان', '05/03/22', '0', '165'),
(47, 'بش ساکٹ 4\"*2\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '12', 'سینٹری کا سامان', '05/03/22', '0', '265'),
(48, 'بش ساکٹ 3\"*2\" پی وی سی', 'سلیکٹ کریں', 'پی وی سی فٹنگ', '7', 'سلیکٹ کریں', '05/03/22', '0', '220'),
(49, 'کاول 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '0', '195'),
(50, 'کاول 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '9', 'سینٹری کا سامان', '05/03/22', '0', '220'),
(51, 'اینڈ کپ 2\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '21', 'سینٹری کا سامان', '05/03/22', '0', '65'),
(52, 'پی ٹریپ 4\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '0', '750'),
(53, 'پی ٹریپ 3\" پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '35', 'سینٹری کا سامان', '05/03/22', '0', '475'),
(54, 'پی ٹریپ 2\" سرامکس', '150 دارالصدر اسٹور', 'سرامکس فٹنگ', '21', 'سینٹری کا سامان', '05/03/22', '0', '220'),
(55, 'پی ٹریپ 3\" سرامکلس', '150 دارالصدر اسٹور', 'سرامکس فٹنگ', '8', 'سینٹری کا سامان', '05/03/22', '0', '330'),
(56, 'فلور ٹریپ پی وی سی', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '14', 'سینٹری کا سامان', '05/03/22', '0', '650'),
(57, 'جستی کلپ 5\"', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '12', 'سینٹری کا سامان', '05/03/22', '0', '120'),
(58, 'جستی کلپ 4\"', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '60', 'سینٹری کا سامان', '05/03/22', '0', '45'),
(59, 'جستی کلپ 3\"', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '168', 'سینٹری کا سامان', '05/03/22', '2', '35'),
(60, 'جستی کلپ 1.1/2\"', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '24', 'سینٹری کا سامان', '05/03/22', '0', '28'),
(61, 'جستی کلپ 1.1/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '45', 'سینٹری کا سامان', '05/03/22', '0', '25'),
(62, 'پی وی سی سلوشن 125 گرام', '150 دارالصدر اسٹور', 'پی وی سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '1', '245'),
(63, '25 ایم ایم پائیپ پی پی آر سی', '150 دارالصدر اسٹور', 'پی پی آر سی پائیپ', '14', 'سینٹری کا سامان', '05/03/22', '13', '425'),
(64, 'پائیپ 32 ایم ایم پی پی آر سی', '150 دارالصدر اسٹور', 'پی پی آر سی پائیپ', '6', 'سینٹری کا سامان', '05/03/22', '0', '750'),
(65, 'پائیپ 40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی پائیپ', '2', 'سینٹری کا سامان', '05/03/22', '0', '1050'),
(66, 'ایلبو 32 ایم ایم ۔ پی پی آر سی', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '12', 'سینٹری کا سامان', '05/03/22', '0', '40'),
(67, 'ایلبو 40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '30', 'سینٹری کا سامان', '05/03/22', '0', '45'),
(68, 'ایلبو 32 ایم ایم * º45', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '20', 'سینٹری کا سامان', '05/03/22', '0', '40'),
(69, 'ایلبو 25 ایم ایم * 1/2\"', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '8', 'سینٹری کا سامان', '05/03/22', '8', '100'),
(70, '25*3/4\" ایلبو', '150 دارالصدر اسٹور', 'پی پی آر سی ایلبو', '60', 'سینٹری کا سامان', '05/03/22', '0', '120'),
(71, '32*25 ایلبو', '150 دارالصدر اسٹور', 'پی پی آر سی ایلبو', '80', 'سینٹری کا سامان', '05/03/22', '0', '65'),
(72, '32*3/4\" اایلبو', '150 دارالصدر اسٹور', 'پی پی آر سی  ایلبو', '10', 'سینٹری کا سامان', '05/03/22', '0', '180'),
(73, '32*1\" ایلبو', '150 دارالصدر اسٹور', 'پی پی آر سی ایلبو', '6', 'سینٹری کا سامان', '05/03/22', '0', '240'),
(74, 'ساکٹ 25 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '4', 'سینٹری کا سامان', '05/03/22', '2', '25'),
(75, 'ساکٹ 40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '40', 'سینٹری کا سامان', '05/03/22', '0', '55'),
(76, 'اینگل آئیرن 1\'', 'اسٹور150', 'سول ورکس ', '12', 'سول ورکس ', '27/03/22', '0', '350'),
(77, 'ساکٹ 50 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '0', '55'),
(78, '25*1/2\" ایلبو', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '6', 'سینٹری کا سامان', '05/03/22', '5', '65'),
(79, '25*3/4\" ساکٹ', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '1', 'سینٹری کا سامان', '05/03/22', '0', '85'),
(80, '32*1\" ساکٹ', '150 دارالصدر اسٹور', 'پی پی آْر سی ساکٹ', '8', 'سینٹری کا سامان', '05/03/22', '0', '145'),
(81, 'ساکٹ 40*32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '6', 'سینٹری کا سامان', '05/03/22', '0', '65'),
(82, '40*1.1/4\" ساکٹ', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '1', 'سینٹری کا سامان', '05/03/22', '0', '225'),
(83, '40*25 ساکٹ', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '5', 'سینٹری کا سامان', '05/03/22', '0', '65'),
(84, 'ساکٹ 50*40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '5', 'سینٹری کا سامان', '05/03/22', '0', '85'),
(85, '63*2\" ساکٹ', '150 دارالصدر اسٹور', 'پی پی آر سی ساکٹ', '1', 'سینٹری کا سامان', '05/03/22', '0', '385'),
(86, 'ساکٹ 50*32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '44', 'سینٹری کا سامان', '05/03/22', '0', '175'),
(87, 'ساکٹ 63*40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '0', '235'),
(88, 'ٹی 32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '40', 'سینٹری کا سامان', '05/03/22', '0', '52'),
(89, 'ٹی 40*25 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '4', 'سینٹری کا سامان', '05/03/22', '0', '130'),
(90, 'ٹی 40*32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '22', 'سینٹری کا سامان', '05/03/22', '0', '195'),
(91, 'ٹی 50*50 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '2', 'سینٹری کا سامان', '05/03/22', '0', '190'),
(92, 'ٹی 25ایم ایم *1/2\"', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '5', 'سینٹری کا سامان', '06/03/22', '0', '85'),
(93, 'ٹی 32ایم ایم *3/4\"', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '30', 'سینٹری کا سامان', '06/03/22', '0', '155'),
(94, 'کراس بنڈ 25 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '12', 'سینٹری کا سامان', '06/03/22', '0', '125'),
(95, 'کراس بنڈ 32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '44', 'سینٹری کا سامان', '06/03/22', '0', '152'),
(96, 'یونین 32 ایہم ایم', '150 دارالصدر اسٹور', 'پی پی آرسی فٹنگ', '3', 'سینٹری کا سامان', '06/03/22', '0', '245'),
(97, 'گیٹ وال 40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آرسی فٹنگ', '4', 'سینٹری کا سامان', '06/03/22', '0', '650'),
(98, 'پلگ 1/2\"', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '100', 'سینٹری کا سامان', '06/03/22', '22', '15'),
(99, 'پلگ 3/4\"', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '65', 'سینٹری کا سامان', '06/03/22', '5', '18'),
(100, 'پی پی آرسی کلمپ 40 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنف', '50', 'سینٹری کا سامان', '06/03/22', '0', '40'),
(101, 'کلمپ 32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '40', 'سینٹری کا سامان', '06/03/22', '0', '40'),
(102, 'کلمپ 25 ایم ایم', '150 دارالصدر اسٹور', 'پی پی ارسی فٹنگ', '23', 'سینٹری کا سامان', '06/03/22', '0', '30'),
(103, 'ایںڈ کپ 25 ایم ایم', '150 دارالصدر اسٹور', 'پی پیارسی فٹنگ', '5', 'سینٹری کا سامان', '06/03/22', '5', '20'),
(106, 'اند کپ 32 ایم ایم', '150 دارالصدر اسٹور', 'پی پی آر سی فٹنگ', '25', 'سینٹری کا سامان', '06/03/22', '0', '35'),
(107, 'اند کپ 50 ایم ایم  پی پی آر سی', '150 دارالصدر اسٹور', 'پی پی آرسی فٹنگ', '4', 'سینٹری کا سامان', '06/03/22', '0', '75'),
(108, 'جی آئی پائیپ 3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '06/03/22', '0', '1200'),
(109, 'ایلبو 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '20', 'سینٹری کا سامان', '06/03/22', '2', '170'),
(110, 'ایلبو 1.1/2\"', '150 دارالصدر اسٹور', 'جی آئِ فٹنگ', '4', 'سینٹری کا سامان', '06/03/22', '0', '210'),
(111, 'ایلبو 1.1/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '21', 'سینٹری کا سامان', '06/03/22', '0', '195'),
(112, 'ایلبو 3\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '06/03/22', '0', '458'),
(113, 'ایف ایم ایلبو 1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '25', 'سینٹری کا سامان', '06/03/22', '2', '75'),
(114, 'ایف ایم ایلبو 3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '15', 'سینٹری کا سامان', '06/03/22', '0', '87'),
(115, 'ایف ایم ایلبو 1.1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '18', 'سینٹری کا سامان', '06/03/22', '0', '245'),
(116, 'ایلبو 1\"*1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '10', 'سینٹری کا سامان', '06/03/22', '1', '98'),
(117, 'ایلبو 1\"*3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '2', 'سینٹری کا سامان', '06/03/22', '1', '110'),
(118, 'ساکٹ 3/4\"*1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '27', 'سینٹری کا سامان', '06/03/22', '2', '75'),
(119, 'ساکٹ 1\"*3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '2', 'سینٹری کا سامان', '06/03/22', '1', '90'),
(120, 'ساکٹ 2\"*1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '06/03/22', '0', '245'),
(121, 'ساکٹ 1/2\"', '150 دارالصدر اسٹور', 'جی آئِ فٹنگ', '19', 'سینٹری کا سامان', '06/03/22', '12', '35'),
(122, 'ساکٹ 1\" * 1.1/2\"', '150 دارالصدر اسٹور', 'جی آئِ فٹنگ', '2', 'سینٹری کا سامان', '06/03/22', '0', '180'),
(123, 'ساکٹ 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '20', 'سینٹری کا سامان', '06/03/22', '2', '58'),
(124, 'ساکٹ 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '20', 'سینٹری کا سامان', '06/03/22', '2', '58'),
(125, 'ساکٹ 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '20', 'سینٹری کا سامان', '06/03/22', '2', '58'),
(126, 'ساکٹ 1.1/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '15', 'سینٹری کا سامان', '06/03/22', '0', '75'),
(127, 'ساکٹ 1.1/2\"', '150 دارالصدر اسٹور', 'جی آئِ فٹنگ', '17', 'سینٹری کا سامان', '06/03/22', '2', '85'),
(128, 'ٹی 1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '128', 'سینٹری کا سامان', '08/03/22', '8', '45'),
(129, 'ٹی 3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '32', 'سینٹری کا سامان', '08/03/22', '8', '75'),
(130, 'ٹی 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '10', 'سینٹری کا سامان', '08/03/22', '2', '85'),
(131, 'ٹی 1.1/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '4', 'سینٹری کا سامان', '08/03/22', '0', '135'),
(132, 'ٹی 2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '3', 'سینٹری کا سامان', '08/03/22', '0', '256'),
(133, 'ٹی 2\"*1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '08/03/22', '0', '258'),
(134, 'ٹی 1/2\"*3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '25', 'سینٹری کا سامان', '08/03/22', '9', '62'),
(135, 'ٹی 3/4\"*1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '19', 'سینٹری کا سامان', '08/03/22', '0', '95'),
(136, 'ٹی 1\"*1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '20', 'سینٹری کا سامان', '08/03/22', '0', '92'),
(137, 'تی 1.1/2\"*3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '08/03/22', '0', '195'),
(138, 'ٹی 1.1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '5', 'سینٹری کا سامان', '08/03/22', '0', '185'),
(139, 'ٹی 2.1/2\"  *  1.1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '15', 'سینٹری کا سامان', '08/03/22', '0', '268'),
(140, 'کراس ٹی 3\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '08/03/22', '0', '650'),
(141, 'دیگی پلگ 3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '8', 'سینٹری کا سامان', '08/03/22', '0', '25'),
(142, 'بیرل نپل 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '14', 'سینٹری کا سامان', '08/03/22', '2', '88'),
(143, 'بیرل نپل 1.5\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '52', 'سینٹری کا سامان', '08/03/22', '4', '175'),
(144, 'بیرل نپل 1.1/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '47', 'سینٹری کا سامان', '08/03/22', '0', '100'),
(145, 'بیرل نپل 3\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '08/03/22', '0', '550'),
(146, 'دیگی پلگ 1/2\"*1.1/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '3', 'سینٹری کا سامان', '08/03/22', '0', '75'),
(147, 'دیگی بش 1.5*3/4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '20', 'سینٹری کا سامان', '08/03/22', '4', '108'),
(148, 'دیگی بش 3/4\"1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '13', 'سینٹری کا سامان', '08/03/22', '2', '45'),
(149, 'یونین 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '12', 'سینٹری کا سامان', '08/03/22', '0', '158'),
(151, 'یونین 1.5\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '48', 'سینٹری کا سامان', '08/03/22', '3', '178'),
(152, 'یونین 2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '7', 'سینٹری کا سامان', '08/03/22', '2', '358'),
(153, 'یونین 3\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '4', 'سینٹری کا سامان', '08/03/22', '0', '450'),
(154, 'یونین 4\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '1', 'سینٹری کا سامان', '08/03/22', '0', '850'),
(155, 'کراس بنڈ 1/2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '21', 'سینٹری کا سامان', '08/03/22', '3', '78'),
(156, 'کراس بنڈ 3/4\"', '150 دارالصدر اسٹور', 'جی آئِ فٹنگ', '28', 'سینٹری کا سامان', '08/03/22', '1', '88'),
(157, 'کراس بنڈ 3/4\"', '150 دارالصدر اسٹور', 'جی آئِ فٹنگ', '28', 'سینٹری کا سامان', '08/03/22', '1', '88'),
(158, 'ھینڈل وال 1\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '4', 'سینٹری کا سامان', '08/03/22', '4', '550'),
(159, 'دھاگہ  پیکٹ', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '13', 'سینٹری کا سامان', '08/03/22', '6', '90'),
(160, 'پوتین ڈبہ 250 گرام', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '24', 'سینٹری کا سامان', '08/03/22', '22', '60'),
(161, 'سلوشن ٹیپ رول 2\"', '150 دارالصدر اسٹور', 'جی آئی فٹنگ', '10', 'سینٹری کا سامان', '08/03/22', '3', '120'),
(162, 'ٹاول راڈ پلا سٹک', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '12', 'سینٹری کا سامان', '09/03/22', '0', '250'),
(163, 'سوپ ڈش پلاسٹک', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '36', 'سینٹری کا سامان', '09/03/22', '0', '300'),
(164, 'برش ھولڈر', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '12', 'سینٹری کا سامان', '09/03/22', '0', '275'),
(165, 'کموڈ کور', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '4', 'سینٹری کا سامان', '09/03/22', '0', '750'),
(166, 'وینیٹی', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '1', 'سینٹری کا سامان', '09/03/22', '0', '2000'),
(167, 'بیسن ویسٹ', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '8', 'سینٹری کا سامان', '09/03/22', '1', '450'),
(168, 'ربڑھ کنکشن', '150 دارالصدر اسٹور', 'باتھ اسیسریش', '20', 'سینٹری کا سامان', '09/03/22', '10', '180'),
(169, 'واشر بوتل ٹریپ', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '11', 'سینٹری کا سامان', '09/03/22', '0', '110'),
(170, 'ھیڈ کیچر', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '18', 'سینٹری کا سامان', '09/03/22', '3', '40'),
(171, 'شاور مکسر اولڈ', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '2', 'سینٹری کا سامان', '09/03/22', '0', '2500'),
(172, 'شاور آرم', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '5', 'سینٹری کا سامان', '09/03/22', '0', '550'),
(173, 'سنک مکسر اولڈ', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '1', 'سینٹری کا سامان', '09/03/22', '0', '4500'),
(174, 'مین ھول کور گول  کاست آئیرن', '150 دارالصدر اسٹور', 'سینٹری', '2', 'سینٹری کا سامان', '09/03/22', '0', '550'),
(175, 'ایلبو1.1/2\" پریشر پائیپ', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '5', 'سینٹری کا سامان', '09/03/22', '0', '150'),
(176, 'ایلبو1\"', '150 دارالصدر اسٹور', 'پریشرپائیپ فٹنگ', '2', 'سینٹری کا سامان', '09/03/22', '1', '95'),
(177, 'ساکٹ 2\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '10', 'سینٹری کا سامان', '09/03/22', '0', '95'),
(178, 'ساکٹ 1\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '6', 'سینٹری کا سامان', '09/03/22', '1', '65'),
(179, 'ساکٹ 1.5\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '3', 'سینٹری کا سامان', '09/03/22', '0', '78'),
(180, 'ایف ایم ساکٹ1.1/2\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '1', 'سینٹری کا سامان', '09/03/22', '0', '95'),
(181, 'ایند کپ 3\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '6', 'سینٹری کا سامان', '09/03/22', '0', '140'),
(182, 'ٹی 2\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '1', 'سینٹری کا سامان', '09/03/22', '0', '165'),
(183, 'ٹی 1.1/2\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '5', 'سینٹری کا سامان', '09/03/22', '0', '95'),
(184, 'ساکٹ 1\"*2\"', '150 دارالصدر اسٹور', 'پرشرپائیپ فٹنگ', '3', 'سینٹری کا سامان', '09/03/22', '0', '152'),
(185, 'سٹیل جالی 6\"*6\"', '150 دارالصدر اسٹور', 'باتھ فلور', '20', 'سینٹری کا سامان', '09/03/22', '3', '500'),
(186, 'پلاستک جالی 6\"*6\"', '150 دارالصدر اسٹور', 'باتھ فلور', '7', 'سینٹری کا سامان', '09/03/22', '0', '250'),
(187, 'پتری جالی گول 6\"', '150 دارالصدر اسٹور', 'بتھ فلور', '22', 'سینٹری کا سامان', '09/03/22', '2', '60'),
(188, 'سریا جالی 6\"*6\"', 'چلڈرن پارک اسٹور', 'پرنالہ جالی', '4', 'سینٹری کا سامان', '09/03/22', '0', '350'),
(189, 'انسٹینٹ گیزر   اولڈ', 'چلڈرن پارک اسٹور', 'گیزر', '2', 'سینٹری کا سامان', '09/03/22', '0', '4500'),
(190, 'بیسن اینگل', '150 دارالصدر اسٹور', 'باتھ اسیسریز', '26', 'سینٹری کا سامان', '09/03/22', '0', '150'),
(191, 'ٹائیل سپیسر', 'اسٹور 150', 'سول ورکس', '2', 'سول ورکس', '27/03/22', '1', '150'),
(192, 'پائیپ 3/4\"پی وی سی', '150 دارالصدر اسٹور', 'الیکتریکل', '2000', 'بجلی کا سامان', '10/03/22', '160', '8'),
(193, 'پائیپ 1\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '200', 'بجلی کا سامان', '10/03/22', '40', '15'),
(194, 'ایلبو 3/4\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '110', 'بجلی کا سامان', '10/03/22', '6', '8'),
(195, 'ایلبو 1\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '30', 'بجلی کا سامان', '10/03/22', '4', '14'),
(196, 'جنگشن بکس 3/4\" لینٹر ڈبی', '150 دارالصدر اسٹور', 'الیکٹریکل', '328', 'بجلی کا سامان', '10/03/22', '0', '25'),
(197, 'جنگشن بکس 1\" لینٹر ڈبی', '150 دارالصدر اسٹور', 'الیکٹریکل', '170', 'بجلی کا سامان', '10/03/22', '0', '28'),
(198, 'جنگشن بکس 3/4\" وال', '150 دارالصدر اسٹور', 'الیکٹریکل', '394', 'بجلی کا سامان', '10/03/22', '6', '25'),
(199, 'جنگشن بکس 1\" وال', '150 دارالصدر اسٹور', 'الیکٹریکل', '82', 'بجلی کا سامان', '10/03/22', '0', '30'),
(200, 'ساکٹ 3/4\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '250', 'بجلی کا سامان', '10/03/22', '10', '8'),
(201, 'ساکٹ 1\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '121', 'بجلی کا سامان', '10/03/22', '0', '10'),
(202, 'فین بکس', '150 دارالصدر اسٹور', 'الیکٹریکل', '12', 'بجلی کا سامان', '10/03/22', '0', '120'),
(203, 'جنگشن بکس کور 4\"', '150 دارالصدر اسٹور', 'الیکٹریکل  جنشن بکس کور ( پیکٹ )', '4', 'بجلی کا سامان', '10/03/22', '0', '6'),
(204, 'الیکٹرک  بکس 4\"*4\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '12', 'بجلی کا سامان', '10/03/22', '0', '30'),
(205, 'الیکٹریک بکس 4\"*7\" پی وی سی', '150 دارالصدر اسٹور', 'الیکٹریکل', '80', 'بجلی کا سامان', '10/03/22', '0', '45'),
(212, 'ڈش کیبل آرجی 7', '150 دارالصدر اسٹور', 'الیکٹریکل', '1.5', 'بجلی کا سامان', '10/03/22', '1', '7500'),
(213, 'انٹرکام کیبل 2 پئیر', '150 دارالصدر اسٹور', 'الیکٹریکل  انٹرکام کیبل کوائیل', '7', 'بجلی کا سامان', '10/03/22', '0', '2000'),
(214, 'ٹیلی فون کیبل', '150 دارالصدر اسٹور', 'الیکتریکل', '1', 'بجلی کا سامان', '10/03/22', '0', '2000'),
(215, 'فون ساکٹ', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '3', 'بجلی کا سامان', '10/03/22', '0', '25'),
(216, 'ٹیوب راڈ   ( گولڈن )', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '10', 'بجلی کا سامان', '10/03/22', '0', '150'),
(217, 'بلب سٹریٹ لائیٹ 2000 واٹ  ( اولڈ ؐ)', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '2', 'بجلی کا سامان', '10/03/22', '0', '1000'),
(218, 'ٹیوب لائیٹ پٹی 48\"', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '39', 'بجلی کا سامان', '10/03/22', '0', '250'),
(219, 'پاور پلگ', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '4', 'بجلی کا سامان', '10/03/22', '0', '150'),
(220, 'لائیٹ پلگ  ( اولڈ )', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '15', 'بجلی کا سامان', '10/03/22', '0', '150'),
(221, 'بریکر سنگل پول ( اولڈ )', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '3', 'بجلی کا سامان', '10/03/22', '0', '180'),
(222, 'اے سی 1 ٹن  ( اولڈ ماڈل )', 'سرائے ناصر اسٹور', 'اے سی', '1', 'بجلی کا سامان', '10/03/22', '0', '45000'),
(223, 'ڈی بی بکس', '150 دارالصدر اسٹور', 'ڈی بی بکس', '12', 'بجلی کا سامان', '10/03/22', '0', '800'),
(224, 'اے سی 1.5 ٹن', 'چلڈرن پارک اسٹور', 'اے سی 1.5 ٹن ( 1 گری ٫ 1 اورینٹ )', '2', 'بجلی کا سامان', '10/03/22', '1', '65000'),
(225, 'پیڈسٹل فین', 'چلڈرن پارک اسٹور', 'پنکھے', '3', 'بجلی کا سامان', '10/03/22', '0', '4500'),
(226, 'سلنگ فین 56\"', 'سرائے ناصر اسٹور', 'پنکھے', '6', 'بجلی کا سامان', '10/03/22', '0', '4500'),
(227, 'فین ھک راول بلٹ والی', '150 دارالصدر اسٹور', 'الیکٹریکل', '7', 'بجلی کا سامان', '10/03/22', '0', '90'),
(228, 'اگزاسٹ فین 12\"', '150 دارالصدر اسٹور', 'پنکھے', '1', 'بجلی کا سامان', '10/03/22', '0', '2200'),
(229, 'اگزاسٹ فین 18\"', '150 دارالصدر اسٹور', 'پنکھے', '2', 'بجلی کا سامان', '10/03/22', '0', '4500'),
(230, 'اگزاسٹ فین 16\"', '150 دارالصدر اسٹور', 'پنکھے', '3', 'بجلی کا سامان', '10/03/22', '0', '4200'),
(231, 'بیکالائیٹ شیٹ 4\"', '150 دارالصدر اسٹور', 'الیکٹریکل', '24', 'بجلی کا سامان', '10/03/22', '0', '25'),
(232, 'بیکا لائیٹ شیٹ 7*4\"', '150 دارالصدر اسٹور', 'الیکٹریکل', '34', 'بجلی کا سامان', '10/03/22', '0', '45'),
(233, 'بیکالائیٹ شیٹ 10\"*4\"', '150 دارالصدر اسٹور', 'الیکٹریکل', '9', 'بجلی کا سامان', '10/03/22', '0', '65'),
(234, 'فیوز سرامکس', '150 دارالصدر اسٹور', 'الیکٹریکل', '37', 'بجلی کا سامان', '10/03/22', '0', '75'),
(235, 'بلب ھولڈر', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '4', 'بجلی کا سامان', '10/03/22', '0', '25'),
(236, 'سلنگ روز ( اولڈ )', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '38', 'بجلی کا سامان', '10/03/22', '0', '45'),
(237, 'ڈون لائیٹ ھولدر', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '30', 'بجلی کا سامان', '10/03/22', '0', '75'),
(238, 'فینسی لائیٹ ھولڈر 1 * 3', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '5', 'بجلی کا سامان', '10/03/22', '0', '1200'),
(239, 'چینج اور', '150 دارالصدر اسٹور', 'الیکٹریکل اسیسریز', '1', 'بجلی کا سامان', '10/03/22', '0', '250'),
(240, 'موٹر پمپ', '150 دارالصدر اسٹور', 'الیکٹریکل  موٹر', '5', 'بجلی کا سامان', '10/03/22', '2', '12000'),
(241, 'فینسی لائیٹ بکس', '150 دارالصدر اسٹور', 'الکٹریکل اسیسریز', '2', 'بجلی کا سامان', '10/03/22', '0', '4500'),
(242, 'ریسیور', '150 دارالصدر اسٹور', 'الیکٹرونکس', '1', 'بجلی کا سامان', '10/03/22', '0', '3500'),
(243, 'سکرو 1.1/2\"', '150 دارالصدر اسٹور', 'الیکٹریک', '6', 'بجلی کا سامان', '10/03/22', '0', '45'),
(244, 'بورڈ لکڑی 4\"', '150 دارالصدر اسٹور', 'الیکٹریکل', '33', 'بجلی کا سامان', '10/03/22', '0', '20'),
(245, 'بورڈ لکڑی 12\"*4\"', '150 دارالصدر اسٹور', 'الیکٹریکل', '45', 'بجلی کا سامان', '10/03/22', '0', '35'),
(246, 'بورڈ لکڑی مترق سائیز', '150 دارالصدر اسٹور', 'الیکٹریکل', '12', 'بجلی کا سامان', '10/03/22', '1', '45'),
(247, 'راول پلگ 6 نمبر', '150 دارالصدر اسٹور', 'الیکٹریکل', '3', 'بجلی کا سامان', '10/03/22', '2', '25'),
(248, 'راڈ سلنگ فین', '150 دارالصدر اسٹور', 'الیکٹریکل', '90', 'بجلی کا سامان', '10/03/22', '0', '100'),
(249, 'فرول سیٹ  ( اے سی ٹول )', '150 دارالصدر اسٹور', 'الیکٹریکل', '1', 'بجلی کا سامان', '10/03/22', '0', '450'),
(250, 'پینٹ گیلن', '150 دارالصدر اسٹور', 'پینٹ ورکس', '3', 'پینٹ کا سامان', '10/03/22', '0', '1900'),
(252, 'وارنش', '150 دارالصدر اسٹور', 'پینٹ ورکس', '3.5', 'پینٹ کا سامان', '10/03/22', '0', '1800'),
(253, 'ڈسٹیپمپر بالٹی ( اولڈ )', '150 دارالصدر اسٹور', 'پینٹ ورکس', '1', 'پینٹ کا سامان', '10/03/22', '0', '4300'),
(254, 'روبن برکس', '150 دارالصدر اسٹور', 'پینٹ ورکس', '7', 'پینٹ کا سامان', '12/03/22', '0', '150'),
(255, 'سافٹ بورڈ 8\'*4\'', 'ورکشاپ،نزد بیت محمود', 'ووڈ ورکس', '10', 'لکڑی کا سامان', '12/03/22', '0', '1800'),
(256, 'پلائی شیٹ 8\'*4\'', 'ورکشاپ،نزد بیت محمود', 'ووڈ ورکس', '8', 'لکڑی کا سامان', '12/03/22', '1', '1000'),
(257, 'لاٰثانی شیٹ 8\'*4\'*3/4\"', 'ورکشاپ،نزد بیت محمود', 'ووڈ ورکس', '4', 'لکڑی کا سامان', '12/03/22', '0', '1800'),
(258, 'لیمینیشن شیٹ 8\'*4\'*3/4\"', 'ورکشاپ،نزد بیت محمود', 'ووڈورکس', '7', 'لکڑی کا سامان', '12/03/22', '3', '2200'),
(259, 'پکی لکڑی لریں', 'ورکشاپ،نزد بیت محمود', 'ووڈ ورکس', '85', 'لکڑی کا سامان', '12/03/22', '0', '700'),
(260, 'ایڈھسو کوریاں شیٹ  ( ایکسپائیر )', 'سلیکٹ کریں', 'ھارڈوئیر', '4', 'ھارڈوئیر کا سامان', '12/03/22', '0', '2500'),
(261, 'کیل 1\" * 20 نمبر', '150 دارالصدر اسٹور', 'ھارڈ وئیر', '4', 'ھارڈوئیر کا سامان', '12/03/22', '3', '260'),
(262, 'سٹیل کیل 1.1/2\"*20نمبر', '150 دارالصدر اسٹور', 'ھارڈوئیر', '8', 'ھارڈوئیر کا سامان', '12/03/22', '0', '300'),
(263, 'سکریو 1/2\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '11', 'ھارڈوئیر کا سامان', '12/03/22', '1', '50'),
(264, 'سکریو 5/8\"', '150 دارالصدر اسٹور', 'ھاردوئیر', '18', 'ھارڈوئیر کا سامان', '12/03/22', '7', '50'),
(265, 'سکریو 3/4\"', '150 دارالصدر اسٹور', 'ھاردوئیر', '118', 'ھارڈوئیر کا سامان', '12/03/22', '7', '60'),
(266, 'سکرو 1\"', '150 دارالصدر اسٹور', 'ھاردوئیر', '20', 'ھارڈوئیر کا سامان', '12/03/22', '1', '65'),
(267, 'سکریو 1.1/2\"', '150 دارالصدر اسٹور', 'ھاترڈوئیر', '18', 'ھارڈوئیر کا سامان', '12/03/22', '2', '95'),
(268, 'سکریو 2\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '1', 'ھارڈوئیر کا سامان', '12/03/22', '0', '150'),
(269, 'سکریو 2.1/2\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '6', 'ھارڈوئیر کا سامان', '12/03/22', '1', '250'),
(270, 'ٹایپنگ سکرو 1.1/2\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '3', 'ھارڈوئیر کا سامان', '12/03/22', '0', '125'),
(271, 'ٹائیپنگ سکرو 1\"', '150 دارالصدر اسٹور', 'ھارڈ وئیر', '3', 'ھارڈوئیر کا سامان', '12/03/22', '0', '125'),
(272, 'ٹاءیپنگ سکریو 1/2\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '4', 'ھارڈوئیر کا سامان', '12/03/22', '0', '60'),
(273, 'کیبنٹ کیچر سمال', '150 دارالصدر اسٹور', 'ھارڈوئیر', '110', 'ھارڈوئیر کا سامان', '12/03/22', '22', '15'),
(274, 'ڈور میگنٹ کیچر', '150 دارالصدر اسٹور', 'ھارڈوئیر', '147', 'ھارڈوئیر کا سامان', '12/03/22', '0', '80'),
(275, 'قبضہ پٹی 6\'*3/4\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '50', 'ھارڈوئیر کا سامان', '12/03/22', '20', '150'),
(276, 'دراز لاک 3/4\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '2', 'ھارڈوئیر کا سامان', '12/03/22', '2', '220'),
(277, 'ڈور لاک ( اولڈ )', '150 دارالصدر اسٹور', 'ھارڈوئیر', '6', 'ھارڈوئیر کا سامان', '12/03/22', '2', '1200'),
(278, 'ناب لاک', '150 دارالصدر اسٹور', 'ھارڈوئیر', '1', 'ھارڈوئیر کا سامان', '12/03/22', '0', '1200'),
(279, 'دستی 4\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '36', 'ھارڈوئیر کا سامان', '12/03/22', '20', '35'),
(280, 'دستی 6\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '12', 'ھارڈوئیر کا سامان', '12/03/22', '10', '35'),
(281, 'کوٹ ھک سنگل', '150 دارالصدر اسٹور', 'ھارڈوئیر', '130', 'ھارڈوئیر کا سامان', '12/03/22', '0', '45'),
(282, 'کوٹ ھک ڈبل', '150 دارالصدر اسٹور', 'ھارڈوئیر', '22', 'ھارڈوئیر کا سامان', '12/03/22', '2', '60'),
(283, 'چٹکنی 4\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '104', 'ھارڈوئیر کا سامان', '12/03/22', '3', '50'),
(284, 'چٹخنی  6\"', '150 دارالصدر اسٹور', 'ھارڈوئِر', '120', 'ھارڈوئیر کا سامان', '13/03/22', '6', '75'),
(285, 'چٹخنی 8\"', '150 دارالصدر اسٹور', 'ھارڈئیر', '62', 'ھارڈوئیر کا سامان', '13/03/22', '3', '80'),
(286, 'پردا پائیپ سٹیل', '150 دارالصدر اسٹور', 'ھارڈوئیر', '6', 'ھارڈوئیر کا سامان', '13/03/22', '0', '400'),
(287, 'پردا پائیپ جستی', '150 دارالصدر اسٹور', 'ھارڈئیر', '2', 'ھارڈوئیر کا سامان', '13/03/22', '1', '250'),
(288, 'بیرنگ پردا پائیپ', '150 دارالصدر اسٹور', 'ھارڈئیر', '80', 'ھارڈوئیر کا سامان', '13/03/22', '4', '25'),
(289, 'بیرنگ پردا پائیپ', '150 دارالصدر اسٹور', 'ھارڈئیر', '80', 'ھارڈوئیر کا سامان', '13/03/22', '4', '25'),
(290, 'ارل 10\"', '150 دارالصدر اسٹور', 'ھارڈویئیر', '30', 'ھارڈوئیر کا سامان', '13/03/22', '0', '250'),
(291, 'سلائیڈر 18\"', '150 دارالصدر اسٹور', 'ھارڈویئیر', '22', 'ھارڈوئیر کا سامان', '13/03/22', '12', '280'),
(292, 'سلائیڈر 20\"', '150 دارالصدر اسٹور', 'ھارڈویئر', '43', 'ھارڈوئیر کا سامان', '13/03/22', '11', '330'),
(293, 'بارڈر گولہ 6\'*3\"', '150 دارالصدر اسٹور', 'ووڈورکس', '6', 'ھارڈوئیر کا سامان', '13/03/22', '3', '330'),
(294, 'ڈور سپرنگ', '150 دارالصدر اسٹور', 'ھارڈوِئیر', '12', 'ھارڈوئیر کا سامان', '13/03/22', '2', '350'),
(295, 'سٹیل کیل 4\"', '150 دارالصدر اسٹور', 'ھارڈوِئیر', '6', 'ھارڈوئیر کا سامان', '13/03/22', '1', '350'),
(296, 'سٹیل کیل 3\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '6', 'ھارڈوئیر کا سامان', '13/03/22', '3', '350'),
(297, 'سٹیل کیل 1.1/2\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '8', 'ھارڈوئیر کا سامان', '13/03/22', '4', '325'),
(298, 'سٹیل کیل 1\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '8', 'ھارڈوئیر کا سامان', '13/03/22', '4', '325'),
(300, 'دیمک مار دوائی ( ایکسپائیر )', '150 دارالصدر اسٹور', 'ووڈورکس', '2', 'ھارڈوئیر کا سامان', '13/03/22', '1', '1500'),
(301, 'شیشہ 12ایم ایم', 'سرائے ناصر اسٹور', 'شیشہ 3 پیس', '66', 'ھارڈوئیر کا سامان', '13/03/22', '0', '450'),
(302, 'ربڑھ سیل جوائینڈر', '150 دارالصدر اسٹور', 'ھارڈوئیر', '15', 'ھارڈوئیر کا سامان', '14/03/22', '0', '150'),
(303, 'ونڈو بلائینڈر ( اولڈ )', '150 دارالصدر اسٹور', 'ھارڈوئیر', '4', 'ھارڈوئیر کا سامان', '14/03/22', '0', '1500'),
(304, 'راول بلٹ 3/8\"', '150 دارالصدر اسٹور', 'ھارڈوئیر', '32', 'ھارڈوئیر کا سامان', '14/03/22', '0', '25'),
(305, 'مارنل فکسرکلمپ', '150 دارالصدر اسٹور', 'ھارڈوئیتر', '60', 'ھارڈوئیر کا سامان', '14/03/22', '0', '45'),
(306, 'شیپر مشین', 'ورکشاپ،نزد بیت محمود', 'ووڈ ورکس مشین', '1', 'ھارڈوئیر کا سامان', '14/03/22', '0', '55000'),
(307, 'سان مشین', 'ورکشاپ،نزد بیت محمود', 'ھاردوئیر مشین', '1', 'ھارڈوئیر کا سامان', '14/03/22', '0', '6000'),
(308, 'ورینچ 14\"', 'ورکشاپ،نزد بیت محمود', 'ھارڈوئِر ٹَول', '1', 'ھارڈوئیر کا سامان', '14/03/22', '0', '750'),
(309, 'روٹر مشین', 'ورکشاپ،نزد بیت محمود', 'ھارڈوئیر مشین', '1', 'ھارڈوئیر کا سامان', '14/03/22', '0', '5000'),
(310, 'لکڑی اڈا 10\'x۔5\'', 'ورکشاپ،نزد بیت محمود', 'ووڈ ورکس', '1', 'لکڑی کا سامان', '14/03/22', '0', '12000'),
(311, 'ٹیبل', 'ورکشاپ،نزد بیت محمود', 'ھارڈوئیر', '2', 'ھارڈوئیر کا سامان', '14/03/22', '0', '8000'),
(312, 'سینٹ', 'دارالفتوح اسٹور', 'سول ورکس', '3790', 'سول کا سامان', '16/03/22', '3775', '710'),
(313, 'چپس 8 نمبر 8.1/2 نمبر', 'دارالفتوح اسٹور', 'سول ورکس', '215', 'سول کا سامان', '16/03/22', '0', '130'),
(314, 'ماربل سلیب کچن', 'دارالفتوح اسٹور', 'سول ورکس ماربل', '244', 'سول کا سامان', '16/03/22', '244', '200'),
(315, 'سیڑھی ماربل', 'دارالفتوح اسٹور', 'سول ورکس ماربل', '465.5', 'سول کا سامان', '16/03/22', '465.5', '150'),
(316, 'ماربل ٹائیل پالش والی 12x\"24\"', 'دارالفتوح اسٹور', 'سول ورکس ماربل', '370', 'سول کا سامان', '16/03/22', '370', '90'),
(317, 'ماربل سکارٹنگ 4\"', 'دارالفتوح اسٹور', 'سول ورکس ماربل', '2580', 'سول کا سامان', '16/03/22', '2390', '105'),
(318, 'سرامکس ٹائیل', 'دارالفتوح اسٹور', 'سول ورکس ٹائیل', '42', 'سول کا سامان', '16/03/22', '0', '1250'),
(319, 'سرامکس ٹائیل 250*500ایم ایم', 'دارالفتوح اسٹور', 'سول ورکس ٹائیل', '36', 'سول کا سامان', '16/03/22', '13.5', '1250'),
(320, 'سرامکس ٹائیل 6\"*6\"', 'دارالفتوح اسٹور', 'سول ورکس ٹائیل', '54', 'سول کا سامان', '16/03/22', '0', '800'),
(321, 'سرامکس ٹائیل 10\"*16\"', 'دارالفتوح اسٹور', 'سول ورکس ٹائِل', '10.5', 'سول کا سامان', '16/03/22', '0', '800'),
(322, 'سرامکس بانڈ سیمنٹ', 'دارالفتوح اسٹور', 'سول ورکس ٹائیل', '15', 'سول کا سامان', '16/03/22', '3', '400'),
(323, 'اینٹ درجہ اول ( برکس )', 'دارالفتوح اسٹور', 'سول ورکس', '399000', 'سول کا سامان', '16/03/22', '269000', '10'),
(324, 'برکس ٹائیل', 'دارالفتوح اسٹور', 'سول ورکس برکس ٹائیل', '12100', 'سول کا سامان', '16/03/22', '11100', '8500'),
(325, 'برکس ٹائیل', 'دارالفتوح اسٹور', 'سول ورکس برکس ٹائیل', '12100', 'سول کا سامان', '16/03/22', '11100', '8500'),
(326, 'بجر', 'دارالفتوح اسٹور', 'سول ورکس کرش', '1350', 'سول کا سامان', '16/03/22', '1150', '63'),
(327, 'سٹیل 3/8\"', 'دارالفتوح اسٹور', 'سول ورکس سٹیل', '3740', 'سول کا سامان', '16/03/22', '0', '190'),
(328, 'سٹیل 3/8\"', 'دارالفتوح اسٹور', 'سول ورکس سٹیل', '3740', 'سول کا سامان', '16/03/22', '0', '190'),
(329, 'سٹیل 1/2\"', 'دارالفتوح اسٹور', 'سول ورکس سٹیل', '727', 'سول کا سامان', '16/03/22', '0', '190'),
(330, 'سٹیل 3/4\"', 'دارالفتوح اسٹور', 'سول ورکس سٹیل', '851', 'سول کا سامان', '16/03/22', '0', '190'),
(331, 'تارکول', 'دارالفتوح اسٹور', 'سول ورکس ( تارکول )', '480', 'سول کا سامان', '16/03/22', '280', '190'),
(332, 'کرش مکس 1/2\"*3\"8\"', 'دارالفتوح اسٹور', 'سول ورکس کرش', '10800', 'سول کا سامان', '17/03/22', '10600', '63'),
(333, 'ایملشن / ڈیسٹیمپر', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '25', 'پینٹ کا سامان', '17/03/22', '5', '4800'),
(334, 'ویدرشیلڈ ڈرم', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '6', 'پینٹ کا سامان', '17/03/22', '0', '8500'),
(335, 'پینٹ گیلن', 'دارالفتوح اسٹور', 'ھارڈووئیر پینٹ ورکس', '40', 'پینٹ کا سامان', '17/03/22', '16', '2300'),
(336, 'ٹائیٹیمئیم', 'دارالفتوح اسٹور', 'ھارڈویئِر پینٹ ورکس', '4', 'پینٹ کا سامان', '17/03/22', '4', '2000'),
(337, 'وال پٹی ڈرم', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '90', 'پینٹ کا سامان', '17/03/22', '70', '2400'),
(338, 'ریگمار شیٹ', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '364', 'پینٹ کا سامان', '17/03/22', '316', '40'),
(339, 'تیل مٹی', 'دارالفتوح اسٹور', 'ھارڈویئیر پینٹ ورکس', '60', 'پینٹ کا سامان', '17/03/22', '30', '155'),
(340, 'اکریلک کیمیکل', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '96', 'پینٹ کا سامان', '19/03/22', '96', '300'),
(341, 'ململ کپڑا', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '15', 'پینٹ کا سامان', '19/03/22', '15', '30'),
(342, 'پلاسٹک آف پیرس', 'دارالفتوح اسٹور', 'ھارڈویئیر پینٹ ورکس', '75', 'پینٹ کا سامان', '19/03/22', '50', '25'),
(343, 'گلیو', 'دارالفتوح اسٹور', 'ھارڈویئر پینٹ ورکس', '4', 'پینٹ کا سامان', '19/03/22', '4', '250'),
(344, 'چاک', 'دارالفتوح اسٹور', 'ھاردویئر پینٹ ورکس', '5', 'پینٹ کا سامان', '19/03/22', '5', '750'),
(345, 'سفید سیمنٹ', 'دارالفتوح اسٹور', 'ھارڈویئیر پینٹ ورکس', '1', 'پینٹ کا سامان', '19/03/22', '1', '1400'),
(346, 'لکڑی پڑتل', 'دارالفتوح اسٹور', 'ھارڈویئر ووڈ ورکس', '98.46', 'لکڑی کا سامان', '19/03/22', '86', '2600'),
(347, 'لکڑی کیل', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '500.85', 'لکڑی کا سامان', '19/03/22', '450.85', '3800'),
(348, 'نیم گولہ 3/4\" * 8\'', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '280', 'لکڑی کا سامان', '19/03/22', '280', '80'),
(349, 'نیم گولہ 1\" * 8\'', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '400', 'لکڑی کا سامان', '19/03/22', '375', '152'),
(350, 'بارڈر گولہ  1/2\"* 2.1/2\" * 8\'', 'دارالفتوح اسٹور', 'ھارڈویئر ووڈورکس', '356', 'لکڑی کا سامان', '19/03/22', '256', '400'),
(351, 'کارنس کاٹیل 2\"*10\'', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '14', 'لکڑی کا سامان', '19/03/22', '14', '900'),
(352, 'بف ریگمار 80 نمبر۔ 60 نمبر', 'دارالفتوح اسٹور', 'ھارڈویئیر وودورکس', '202', 'لکڑی کا سامان', '19/03/22', '202', '10'),
(353, 'لیمینیشن شیٹ 3/4\"*84\'*8\'', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '110', 'لکڑی کا سامان', '19/03/22', '93', '2392'),
(354, 'پلائی شیٹ / کمرشل شیٹ', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '50', 'لکڑی کا سامان', '19/03/22', '50', '585'),
(355, 'لاثانی شیٹ 3/8\"', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '4', 'لکڑی کا سامان', '19/03/22', '3', '1300'),
(356, 'دیمک مار دوائی', 'دارالفتوح اسٹور', 'ھارڈوئیر ووڈورکس', '4', 'لکڑی کا سامان', '19/03/22', '2', '1725'),
(357, 'گلیو ICI', 'دارالفتوح اسٹور', 'ھارڈویئیر ووڈورکس', '65', 'لکڑی کا سامان', '19/03/22', '65', '250'),
(358, 'ایلفی سلوشن', 'دارالفتوح اسٹور', 'ھاردویئیر ووڈورکس', '13', 'لکڑی کا سامان', '19/03/22', '13', '185'),
(359, 'لاک  2\" ٹرائی سرکل', 'دارالفتوح اسٹور', 'ھارڈویئیر', '6', 'ھارڈوئیر کا سامان', '19/03/22', '4', '290'),
(360, 'چٹخنی 8\" براس', 'دارالفتوح اسٹور', 'ھارڈوئیر اسیسریز', '142', 'ھارڈوئیر کا سامان', '19/03/22', '1', '307'),
(361, 'چٹخنی 12\" براس', 'دارالفتوح اسٹور', 'ھارڈویئر اسیسریز', '8', 'ھارڈوئیر کا سامان', '19/03/22', '0', '466'),
(362, 'دستی چادری', 'دارالفتوح اسٹور', 'ھارڈویئیر اسیسریز', '156', 'ھارڈوئیر کا سامان', '19/03/22', '2', '33'),
(363, 'دستی چادری 4\'', 'دارالیمن اسٹور', 'ھارڈویئر اسیسریز', '60', 'ھارڈوئیر کا سامان', '19/03/22', '0', '18'),
(364, 'دستی سپیشل 3/4\"', 'دارالفتوح اسٹور', 'ھارڈویئیر اسیسریز', '265', 'ھارڈوئیر کا سامان', '19/03/22', '0', '88'),
(365, 'ارل 10\"', 'دارالفتوح اسٹور', 'ھارڈویئر اسیسریز', '24', 'ھارڈوئیر کا سامان', '19/03/22', '5', '350'),
(366, 'میگنٹَ کیچر کیبنٹ', 'دارالفتوح اسٹور', 'ھارڈویئیر اسیسریز', '360', 'ھارڈوئیر کا سامان', '19/03/22', '0', '27.50'),
(367, 'دراز چینل 20\"', 'دارالفتوح اسٹور', 'ھارڈویئیر اسیسریز', '90', 'ھارڈوئیر کا سامان', '19/03/22', '80', '570'),
(368, 'پیچ 3\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '3', 'ھارڈوئیر کا سامان', '19/03/22', '3', '360'),
(369, 'واشر', 'دارالفتوح اسٹور', 'ھارڈویئیر', '2', 'ھارڈوئیر کا سامان', '19/03/22', '0', '160'),
(370, 'پیچ 5/8\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '24', 'ھارڈوئیر کا سامان', '19/03/22', '24', '90'),
(371, 'سکرو 5/8\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '60', 'ھارڈوئیر کا سامان', '19/03/22', '60', '65'),
(372, 'سکرو 5/8\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '60', 'ھارڈوئیر کا سامان', '19/03/22', '60', '65'),
(373, 'پیچ 3/4\"', 'دارالفتوح اسٹور', 'ھارڈویئِر', '72', 'ھارڈوئیر کا سامان', '19/03/22', '66', '75'),
(374, 'پیچ dw۔ 1.1/2\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '30', 'ھارڈوئیر کا سامان', '19/03/22', '10', '170'),
(375, 'پیچ 1/2\"', 'دارالفتوح اسٹور', 'ھارڈویئر', '12', 'ھارڈوئیر کا سامان', '19/03/22', '12', '45'),
(376, 'ٹیپٹ پیچ 1\"', 'دارالفتوح اسٹور', 'ھارڈویئر', '3', 'ھارڈوئیر کا سامان', '19/03/22', '0', '130'),
(377, 'کیل ٹاپلس', 'دارالفتوح اسٹور', 'ًھارڈویئیر', '5', 'ھارڈوئیر کا سامان', '19/03/22', '5', '290'),
(378, 'کیل ٹاپلس 1.1/2\"', 'دارالفتوح اسٹور', 'ھارڈویئر', '19', 'ھارڈوئیر کا سامان', '19/03/22', '18', '260'),
(379, 'کیل ٹاپلس 2\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '13', 'ھارڈوئیر کا سامان', '19/03/22', '10', '300'),
(380, 'قبضہ پٹی 7\'*3/4\"', 'دارالفتوح اسٹور', 'ھارڈویئر', '200', 'ھارڈوئیر کا سامان', '19/03/22', '110', '237'),
(381, 'برچی کیل 3/4\"', 'دارالفتوح اسٹور', 'ھارڈویئر', '3', 'ھارڈوئیر کا سامان', '19/03/22', '2', '200'),
(382, 'سٹیل کیل', 'دارالفتوح اسٹور', 'ھارڈویئر', '11', 'ھارڈوئیر کا سامان', '19/03/22', '11', '360'),
(383, 'سٹیل کیل 2\"', 'دارالفتوح اسٹور', 'ھارڈویئر', '2', 'ھارڈوئیر کا سامان', '19/03/22', '2', '360'),
(384, 'پیپر ٹیپ 1\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '1', 'ھارڈوئیر کا سامان', '19/03/22', '1', '100'),
(385, 'گرینڈر ڈسک ویل 4\"', 'دارالفتوح اسٹور', 'ھارڈویئیر', '9', 'ھارڈوئیر کا سامان', '19/03/22', '9', '80'),
(386, 'پائیپ 3\"', 'دارالفتوح اسٹور', 'سینٹری ورکس pvc', '15', 'سینٹری کا سامان', '21/03/22', '2', '2038'),
(387, 'پائیپ 4\" pvc', 'دارالفتوح اسٹور', 'سینٹری ورکس', '7', 'سینٹری کا سامان', '21/03/22', '1', '3140'),
(388, 'پائیپ 6\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری ورکس', '3', 'سینٹری کا سامان', '21/03/22', '0', '5105'),
(389, 'پائیپ 10\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری', '1', 'سینٹری کا سامان', '21/03/22', '0', '9100'),
(390, 'ایلبو 3\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری', '17', 'سینٹری کا سامان', '21/03/22', '5', '275'),
(391, 'ایلبو4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری', '33', 'سینٹری کا سامان', '21/03/22', '0', '310'),
(392, 'ایلبو 3\" x ۔45º', 'دارالفتوح اسٹور', 'سینٹری', '22', 'سینٹری کا سامان', '21/03/22', '2', '191'),
(393, 'ٹی 2\"x۔4\"', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '3', 'سینٹری کا سامان', '21/03/22', '0', '417'),
(394, 'ٹی 3\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری', '30', 'سینٹری کا سامان', '21/03/22', '0', '275'),
(395, 'ٹی 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '10', 'سینٹری کا سامان', '21/03/22', '0', '310'),
(396, 'پلگ ٹی 3\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '11', 'سینٹری کا سامان', '21/03/22', '0', '310'),
(397, 'پلگ ٹی 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '10', 'سینٹری کا سامان', '21/03/22', '0', '508'),
(398, 'وائے ٹی 3\"X۔4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '7', 'سینٹری کا سامان', '21/03/22', '0', '565'),
(399, 'وائے ٹی 3\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '17', 'سینٹری کا سامان', '21/03/22', '0', '359'),
(400, 'وائے ٹیہ 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '25', 'سینٹری کا سامان', '21/03/22', '0', '568'),
(401, 'کراس ٹی 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '4', 'سینٹری کا سامان', '21/03/22', '0', '946'),
(402, 'پی ٹرپ 4\" سرامکس', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '22', 'سینٹری کا سامان', '21/03/22', '0', '345'),
(403, 'پی ٹریپ 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '11', 'سینٹری کا سامان', '21/03/22', '2', '616'),
(404, 'سلوشن', 'دارالفتوح اسٹور', 'سینٹری فٹنگ', '7', 'سینٹری کا سامان', '21/03/22', '7', '334'),
(435, 'ساکٹ 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری ورکس پی وی سی', '11', 'سینٹری کا سامان', '22/03/22', '11', '272'),
(436, 'اینڈ کپ 3\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری ورکس', '6', 'سینٹری کا سامان', '22/03/22', '6', '162'),
(437, 'اینڈ کپ 4\" پی وی سی', 'دارالفتوح اسٹور', 'سینٹری ورکس', '9', 'سینٹری کا سامان', '22/03/22', '7', '193'),
(438, 'پائیپ 32 ایم ایم پی پی آر سی', 'دارالفتوح اسٹور', 'سینٹری ورکس پی پی آر سی', '68', 'سینٹری کا سامان', '22/03/22', '4', '775'),
(439, 'پائیپ 63 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس پی پی آر سی', '3', 'سینٹری کا سامان', '22/03/22', '2', '4025'),
(440, 'ایلبو 32 ایم ایم پی پی آر سی', 'دارالفتوح اسٹور', 'سینٹری ورکس پی پی آرسی فٹنگ', '63', 'سینٹری کا سامان', '22/03/22', '15', '38'),
(441, 'ایلبو 32ایم ایم * 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '15', 'سینٹری کا سامان', '22/03/22', '0', '47'),
(442, 'ساکٹ 32*25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '8', 'سینٹری کا سامان', '22/03/22', '0', '30'),
(443, 'ساکٹ 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '31', 'سینٹری کا سامان', '22/03/22', '0', '14'),
(444, 'ساکٹ 32 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '37', 'سینٹری کا سامان', '22/03/22', '11', '27'),
(445, 'ٹی 32*25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '36', 'سینٹری کا سامان', '22/03/22', '4', '58'),
(446, 'ٹی 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '65', 'سینٹری کا سامان', '22/03/22', '0', '21'),
(447, 'ٹی 32 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '85', 'سینٹری کا سامان', '22/03/22', '8', '50'),
(448, 'اور کراس 32 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس پی پی آر سی', '34', 'سینٹری کا سامان', '24/03/22', '4', '108'),
(449, 'اور کراس 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکسس', '25', 'سینٹری کا سامان', '24/03/22', '3', '61'),
(450, 'یونین 32 ایم ایم پی پی آر سی', 'دارالفتوح اسٹور', 'سینٹری ورکس', '32', 'سینٹری کا سامان', '24/03/22', '0', '159'),
(451, 'اینڈ کپ 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '27', 'سینٹری کا سامان', '24/03/22', '7', '20'),
(452, 'اینڈٰ کپ 32 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '24', 'سینٹری کا سامان', '24/03/22', '4', '38'),
(453, 'ایلبو 32 ایم ایم * 1/2\"', 'دارالفتوح اسٹور', 'سینٹری ورکس', '0', 'سینٹری کا سامان', '24/03/22', '0', '8'),
(454, 'ساکٹ 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '17', 'سینٹری کا سامان', '24/03/22', '0', '117'),
(455, 'ٹی 25 ایم ایم', 'دارالفتوح اسٹور', 'سینٹری ورکس', '28', 'سینٹری کا سامان', '24/03/22', '0', '126'),
(456, 'پائیپ 3\" جی آئی', 'دارالفتوح اسٹور', 'سینٹری ورکس جی آئی', '0.45', 'سینٹری کا سامان', '24/03/22', '0', '8470'),
(457, 'ھینڈل وال 1/2\" براس', 'دارالفتوح اسٹور', 'سینٹری ورکس', '18', 'سینٹری کا سامان', '24/03/22', '10', '550'),
(458, 'گیس نوزل 1/2\"', 'دارالفتوح اسٹور', 'سینٹری ورکس', '15', 'سینٹری کا سامان', '24/03/22', '0', '30'),
(459, 'ایف ایم ایلبو 1/2\" جی آئی', 'دارالفتوح اسٹور', 'سینٹری ورکس', '15', 'بجلی کا سامان', '24/03/22', '0', '75'),
(460, 'بیرل نپل 1/2\" جی آئی', 'دارالفتوح اسٹور', 'سینٹری ورکس', '15', 'سینٹری کا سامان', '24/03/22', '0', '70'),
(461, 'فلور جالی 6\" پلاسٹک', 'دارالفتوح اسٹور', 'سینٹری ورکس باتھ ایسریز', '60', 'سینٹری کا سامان', '24/03/22', '60', '250'),
(462, 'کموڈ', 'دارالفتوح اسٹور', 'سینٹری ورکس باتھ اسیسریز', '12', 'سینٹری کا سامان', '24/03/22', '8', '5400'),
(463, 'بیسن وتھ پیڈسٹل', 'دارالفتوح اسٹور', 'سینتری ورکس باترھ اسیسریز', '18', 'سینٹری کا سامان', '24/03/22', '12', '2500'),
(464, 'ویسٹ پائیپ بیسن', 'دارالفتوح اسٹور', 'سینٹری ورکس', '18', 'سینٹری کا سامان', '24/03/22', '12', '150'),
(465, 'سنک باول', 'دارالفتوح اسٹور', 'سینٹری ورکس کچن اسیسریز', '6', 'سینٹری کا سامان', '24/03/22', '5', '2700'),
(466, 'سنک میکسچر', 'دارالفتوح اسٹور', 'سینٹری ورکس کچن اسیسریز', '6', 'سینٹری کا سامان', '24/03/22', '4', '4500'),
(467, 'ویسٹ پائپ سنک بمع ویسٹ', 'دارالفتوح اسٹور', 'سینٹری ورکس کچن اسیسریز', '6', 'سینٹری کا سامان', '24/03/22', '4', '180'),
(468, 'باتھ سیٹ', 'دارالفتوح اسٹور', 'سینٹری ورکس بتھ اسیسریز', '12', 'سینٹری کا سامان', '24/03/22', '8', '14500'),
(469, 'ببکاک سنگل', 'دارالفتوح اسٹور', 'سینٹری ورکس باتھ اسیسریز', '12', 'سینٹری کا سامان', '24/03/22', '8', '800'),
(470, 'ٹفلن ٹیپ رول', 'دارالفتوح اسٹور', 'سینٹری ورکس', '100', 'سینٹری کا سامان', '24/03/22', '65', '30'),
(471, 'سی پی نوزل', 'دارالفتوح اسٹور', 'سینٹری ورکس سی پی', '100', 'سینٹری کا سامان', '24/03/22', '100', '75'),
(472, 'بلٹ کٹ بیسن', 'دارالفتوح اسٹور', 'سینٹری ورکس', '16', 'سینٹری کا سامان', '24/03/22', '12', '265'),
(473, 'بلٹ کٹ کموڈ', 'دارالفتوح اسٹور', 'سینٹری ورکس سی پی', '12', 'سینٹری کا سامان', '24/03/22', '8', '150'),
(474, 'پائیپ 3/4\" پی وی سی', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '2500', 'سینٹری کا سامان', '24/03/22', '0', '18'),
(475, 'پائیپ 1\" پی وی سی', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '300', 'بجلی کا سامان', '24/03/22', '260', '30.5'),
(476, 'ساکٹ 1\" پی وی سی', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '24', 'بجلی کا سامان', '24/03/22', '14', '14'),
(477, 'ایلبو 1\" پی وی سی', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '38', 'بجلی کا سامان', '24/03/22', '28', '29'),
(478, 'جنگشن بکس وال', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '72', 'بجلی کا سامان', '24/03/22', '72', '35'),
(479, 'بورڈ بجلی 7\"*4\"', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '64', 'بجلی کا سامان', '24/03/22', '48', '45'),
(480, 'تار 3.29', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '13', 'بجلی کا سامان', '24/03/22', '10', '4250'),
(481, 'تار 7.29', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '8', 'بجلی کا سامان', '24/03/22', '7', '6650'),
(482, 'تار 7.44', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '6', 'بجلی کا سامان', '24/03/22', '5', '13500'),
(483, 'تار 7.64 کاپر', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '3', 'بجلی کا سامان', '24/03/22', '2.75', '31600'),
(484, 'ڈش کیبل rg-7', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '2', 'بجلی کا سامان', '24/03/22', '1.25', '4500'),
(485, 'ٹیلی فون کیبل کنکشن وائیر', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '1', 'بجلی کا سامان', '24/03/22', '.5', '3200'),
(486, 'ٹیپ رول', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '23', 'بجلی کا سامان', '24/03/22', '23', '40'),
(487, 'سوئیچ پیانو', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '480', 'بجلی کا سامان', '24/03/22', '432', '25'),
(488, 'ساکٹ پیانو', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '168', 'بجلی کا سامان', '24/03/22', '156', '25'),
(489, 'ڈمر پیانو', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '48', 'بجلی کا سامان', '24/03/22', '48', '100'),
(490, '2 وے سوئیچ پیانو', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '12', 'بجلی کا سامان', '24/03/22', '12', '35'),
(491, 'فون ساکٹ پیانو', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '16', 'بجلی کا سامان', '24/03/22', '6', '35'),
(492, 'ڈش کیبل ساکٹ پیانو', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '6', 'بجلی کا سامان', '24/03/22', '6', '35'),
(493, 'فین شیٹ 8\" پی وی سی', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '54', 'بجلی کا سامان', '24/03/22', '50', '45'),
(494, 'سرکٹ بریکر سنگل پول', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '60', 'بجلی کا سامان', '24/03/22', '51', '300'),
(495, 'سرکٹ برکر ڈبل پول', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '6', 'سول کا سامان', '24/03/22', '6', '550'),
(496, 'ڈی بی لائیٹ', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '12', 'بجلی کا سامان', '24/03/22', '12', '100');
INSERT INTO `stores` (`id`, `ishya_name`, `maqam`, `detail`, `amount`, `saman_type`, `date`, `naqas`, `rate`) VALUES
(497, 'چینج اور', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '6', 'بجلی کا سامان', '24/03/22', '6', '650'),
(498, 'وولٹ میٹر', 'دارالفتوح اسٹور', 'الیکترک ورکس', '6', 'بجلی کا سامان', '24/03/22', '6', '450'),
(499, 'بلب ھولڈر کنسیلڈ', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '228', 'بجلی کا سامان', '24/03/22', '190', '40'),
(500, 'سلنگ روز کنسیلڈ', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '36', 'بجلی کا سامان', '24/03/22', '36', '40'),
(501, 'کنکٹر سٹرپ', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '12', 'بجلی کا سامان', '24/03/22', '6', '120'),
(502, 'کاپر کنکھی', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '2', 'بجلی کا سامان', '24/03/22', '1', '150'),
(503, 'لائیٹ پلگ', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '32', 'بجلی کا سامان', '24/03/22', '24', '350'),
(504, 'پاور پلگ', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '10', 'بجلی کا سامان', '24/03/22', '6', '550'),
(506, 'بیل پش بٹن', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '6', 'بجلی کا سامان', '24/03/22', '6', '40'),
(507, 'بیل', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '6', 'بجلی کا سامان', '24/03/22', '6', '500'),
(508, 'سکرو 3\" ڈرائی وال', 'دارالفتوح اسٹور', 'الیکٹرک ورکرس', '1', 'سول کا سامان', '24/03/22', '1', '395'),
(509, 'سکرو 2.5\"', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '5', 'بجلی کا سامان', '24/03/22', '5', '350'),
(510, 'سکرو 2\" ڈرائی وال', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '10', 'بجلی کا سامان', '24/03/22', '8', '200'),
(511, 'سکرو 1.5\"  ڈرائی وال', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '10', 'بجلی کا سامان', '24/03/22', '8', '180'),
(512, 'سکرو 3/4\" ڈرائی وال', 'دارالفتوح اسٹور', 'الیکٹرک ورکس', '10', 'بجلی کا سامان', '24/03/22', '8', '90'),
(20220330, 'ٹی کاک', 'دارالفتوح اسٹور', 'سینٹری ورکس سی پی', '18', 'سینٹری کا سامان', '31/03/22', '12', '1200'),
(20220331, 'ربڑھ کنکشن', 'دارالفتوح اسٹور', 'سینٹری ورکس سی پی', '12', 'سینٹری کا سامان', '31/03/22', '10', '250'),
(20220332, 'کور کموڈ', 'دارالفتوح اسٹور', 'سینٹری ورکس باتھ اسیسریز', '12', 'سینٹری کا سامان', '03/04/22', '8', '1500'),
(20220333, 'بیسن مکسچر', 'دارالفتوح اسٹور', 'سینٹری ورکس سی پی', '6', 'سینٹری کا سامان', '24/03/22', '4', '2800'),
(20220334, 'تمبل کموڈ', 'دارالفتوح اسٹور', 'سینٹری باتھ اسیسریز', '12', 'سینٹری کا سامان', '03/04/22', '8', '350'),
(20220335, 'ویسٹ کپملین ( بیسن ویسٹ )', 'دارالفتوح اسٹور', 'سینٹری باتھ اسیسریز', '6', 'سینٹری کا سامان', '03/04/22', '4', '500'),
(20220336, 'فلش ٹینک', 'دارالفتوح اسٹور', 'سینٹری ورکس باتھ اسیسریز', '6', 'سینٹری کا سامان', '03/04/22', '4', '2500'),
(20220337, 'پائیپ ایم ایس 6\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '10', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220338, 'ایم ایس پائیپ 3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '9', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220339, 'گیٹ والو 6\"ϕ کڈز برانڈ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '4', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220340, 'گیٹ والو 3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '3', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220341, 'ایم ایس ٹی 3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '2', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220342, 'ایم ایس۔ اینڈ کپ 6\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '4', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220343, 'ایم ایس اینڈ کپ 3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '6', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220344, 'ایم ایس ریڈیوسر 6\"*3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '2', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220345, 'ایم ایس فلنچ 6\"ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '40', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220346, 'ایم ایس فلنچ 3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '36', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220347, 'ربڑھ فلنچ سیل 6\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '40', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220348, 'ایم ایس فلنچ سیل 3\" ϕ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹَنگ', '40', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220349, 'ایم ایس نٹ بلٹ', 'دارالفتوح اسٹور', 'ایم ایس سینٹری فٹنگ', '1', 'سینٹری کا سامان', '05/04/22', '0', '0000'),
(20220350, 'زنک پاوڈر', 'دارالفتوح اسٹور', 'ھارڈوئیر پینٹ ورکس', '3', 'پینٹ کا سامان', '07/04/22', '3', '500'),
(20220351, 'سی پی ربڑھ واشر', '150 دارالصدر اسٹور', 'سینٹری ورکس سی پی', '100', 'سینٹری کا سامان', '12/04/22', '5', '10'),
(20220352, 'سی پی ربڑھ واشر', '150 دارالصدر اسٹور', 'سینٹری ورکس سی پی', '100', 'سینٹری کا سامان', '12/04/22', '5', '10'),
(20220353, 'سی پی ربڑھ واشر', '150 دارالصدر اسٹور', 'سینٹری ورکس سی پی', '100', 'سینٹری کا سامان', '12/04/22', '5', '10'),
(20220354, 'سی پی ربڑھ واشر', '150 دارالصدر اسٹور', 'سینٹری فٹنگ سی پی', '100', 'سینٹری کا سامان', '12/04/22', '5', '15'),
(20220355, 'سی پی ربڑھ واشر', '150 دارالصدر اسٹور', 'سینٹری فٹنگ سی پی', '100', 'سینٹری کا سامان', '12/04/22', '5', '15'),
(20220356, 'واشر ربڑھ کنکشن', '150 دارالصدر اسٹور', 'سینٹَری', '100', 'سینٹری کا سامان', '12/04/22', '5', '15'),
(20220357, 'واشر ربڑھ کنکشن', '150 دارالصدر اسٹور', 'سینٹَری', '100', 'سینٹری کا سامان', '12/04/22', '5', '15'),
(20220359, 'سی پی ربڑھ واشر', '150 دارالصدر اسٹور', 'سینٹری فٹنگ سی پی', '100', 'سینٹری کا سامان', '12/04/22', '5', '15'),
(20220360, 'اے سی 1.5 ٹن ( اولڈ )', 'چلڈرن پارک اسٹور', 'اے سی 1.5 ٹن ( اولڈ )', '5', 'بجلی کا سامان', '16/04/22', '0', '75000'),
(20220361, 'اے اسی 2 ٹن', 'چلڈرن پارک اسٹور', 'اے سی 2ٹن ( اورینٹ ) ( گری )', '2', 'بجلی کا سامان', '16/04/22', '1', '90000'),
(20220362, 'اے سی 2 ٹن', 'چلڈرن پارک اسٹور', 'اے سی 2 ٹن ( اورینٹ + گری )', '2', 'بجلی کا سامان', '16/04/22', '1', '90000'),
(20220363, 'سٹیل کیل 1\" * 20 نمبر', 'دارالفتوح اسٹور', 'ھارڈوئیر', '1', 'ھارڈوئیر کا سامان', '16/04/22', '1', '360');

-- --------------------------------------------------------

--
-- Table structure for table `tameer_chakars`
--

CREATE TABLE `tameer_chakars` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `name` varchar(1000) NOT NULL,
  `chakar` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `total` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `tameer_chakars`
--

INSERT INTO `tameer_chakars` (`id`, `date`, `name`, `chakar`, `detail`, `total`) VALUES
(2, '09/03/22', 'عبدالستار رکشہ ڈرائیور', '3', '3 چکر سامان شفت  ٹائیل کے ڈبے بمہ کت پیس . لیمینشن شیٹون کی شفٹنگ', '1000');

-- --------------------------------------------------------

--
-- Table structure for table `tameer_painter_bills`
--

CREATE TABLE `tameer_painter_bills` (
  `id` bigint(100) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `per_foot` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `tameer_painter_bills`
--

INSERT INTO `tameer_painter_bills` (`id`, `painter_name`, `date`, `day`, `kaam`, `rakbah`, `per_foot`) VALUES
(1, 'dsa', '11/10/2021', 'gf', '2', '2', '2'),
(2, 'xZ', '11/10/2021', 'gf', '2', '2', '2');

-- --------------------------------------------------------

--
-- Table structure for table `tameer_quater_marbels`
--

CREATE TABLE `tameer_quater_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `foot` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `store_name` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `tameer_quater_marbels`
--

INSERT INTO `tameer_quater_marbels` (`id`, `date`, `inc_id`, `muhala`, `foot`, `rate`, `amount`, `detail`, `store_name`) VALUES
(2, '23/02/22', '1', 'تعمیر کوارٹرز دارالنصر', '2', '2', '2', 'i90p', 'zdf');

-- --------------------------------------------------------

--
-- Table structure for table `tameer_quater_painters`
--

CREATE TABLE `tameer_quater_painters` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `tander_otps`
--

CREATE TABLE `tander_otps` (
  `id` int(100) NOT NULL,
  `to` varchar(1000) NOT NULL,
  `from` varchar(1000) NOT NULL,
  `text` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `tank_painter_bills`
--

CREATE TABLE `tank_painter_bills` (
  `id` bigint(100) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `per_foot` varchar(1000) NOT NULL,
  `weight` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `day` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `thekedar_bill_tameers`
--

CREATE TABLE `thekedar_bill_tameers` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `thekedar_name` varchar(1000) NOT NULL,
  `thekedar_type` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `mrubah_rate` varchar(1000) NOT NULL,
  `mrubah_per_rate` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `progress` varchar(1000) NOT NULL,
  `maqam` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `thekedar_bill_tameers`
--

INSERT INTO `thekedar_bill_tameers` (`id`, `date`, `thekedar_name`, `thekedar_type`, `detail`, `mrubah_rate`, `mrubah_per_rate`, `security_rate`, `progress`, `maqam`) VALUES
(3, '18/12/2021', 'kjl', 'سول ورکس', 'jk', '2', '2', '2', '2', 'دارالفتوح');

-- --------------------------------------------------------

--
-- Table structure for table `thekedar_bill_water_tanks`
--

CREATE TABLE `thekedar_bill_water_tanks` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `thekedar_name` varchar(1000) NOT NULL,
  `thekedar_type` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `mrubah_rate` varchar(1000) NOT NULL,
  `mrubah_per_rate` varchar(1000) NOT NULL,
  `progress` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `thekedar_bill_water_tanks`
--

INSERT INTO `thekedar_bill_water_tanks` (`id`, `date`, `thekedar_name`, `thekedar_type`, `detail`, `mrubah_rate`, `mrubah_per_rate`, `progress`, `security_rate`) VALUES
(10, '18/12/2021', 'dsas', 'سول ورکس', 'kl', '2', '2', '2', '2');

-- --------------------------------------------------------

--
-- Table structure for table `thekedar_water_tanks`
--

CREATE TABLE `thekedar_water_tanks` (
  `id` bigint(100) NOT NULL,
  `thekedar_name` varchar(1000) NOT NULL,
  `thekedar_type` varchar(1000) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `mrubah_rate` varchar(1000) NOT NULL,
  `mrubah_per_rate` varchar(1000) NOT NULL,
  `progress` varchar(1000) NOT NULL,
  `security_rate` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `thekedar_water_tanks`
--

INSERT INTO `thekedar_water_tanks` (`id`, `thekedar_name`, `thekedar_type`, `detail`, `mrubah_rate`, `mrubah_per_rate`, `progress`, `security_rate`, `date`, `adaigi`) VALUES
(1, 'کلیم احمد سلیمی', 'سول ورکس', 'کام مکمل فٹ فلور بمعہ فلور پالش', '3484', '370', '5', '3222', '02/03/22', '1'),
(2, 'وسیم احمد بلڈنگ', 'سول ورکس', 'کھدائی بنیاد', '256', '10', '1', '0', '21/03/22', '1'),
(3, 'وسیم احمد بلڈنگ', 'سول ورکس', 'بجر بنیاد', '128.5', '18', '1', '0', '21/03/22', '1'),
(4, 'وسیم احمد بلڈنگ', 'سول ورکس', 'چنائی ٹووال', '320', '30', '1', '0', '21/03/22', '1'),
(5, 'وسیم احمد بلڈنگ', 'سول ورکس', 'چنائی ٹووال', '320', '30', '1', '0', '21/03/22', '1'),
(6, 'وسیم احمد بلڈنگ', 'سول ورکس', 'سولنگ پیمائش', '120.75', '15', '1', '0', '21/03/22', '1'),
(7, 'وسیم احمد بلڈنگ', 'سول ورکس', 'سولنگ پیمائش', '36.75', '15', '1', '0', '21/03/22', '1'),
(8, 'وسیم احمد بلڈنگ', 'سول ورکس', 'سولنگ پیمائش', '162.5', '15', '1', '0', '21/03/22', '1'),
(9, 'وسیم احمد بلڈنگ', 'سول ورکس', 'سولنگ پیمائش', '158.75', '15', '1', '0', '21/03/22', '1'),
(10, 'وسیم احمد بلڈنگ', 'سول ورکس', 'سولنگ پیمائش', '323', '15', '1', '0', '21/03/22', '1'),
(11, 'وسیم احمد بلڈنگ', 'سینٹری  کنٹریکٹر', 'گراونڈ فلور،فرسٹ فلور، سیکنڈ فلور، تھرڈ فلور،اوورہیڈواٹر ٹینک', '1', '1', '1', '172629', '05/04/22', '1');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(100) NOT NULL,
  `name` varchar(1000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(1000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(2000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `confirm_password` varchar(2000) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `confirm_password`) VALUES
(12, 'جری', 'jarryullah46@gmail.com', '$2y$10$v1n7LAm.6v7phP.TQCpBsuYQAUK4b4kHD72dJzfkv0E.E12dgp8oS', '$2y$10$v1n7LAm.6v7phP.TQCpBsuYQAUK4b4kHD72dJzfkv0E.E12dgp8oS');

-- --------------------------------------------------------

--
-- Table structure for table `water_tank_marbels`
--

CREATE TABLE `water_tank_marbels` (
  `id` bigint(100) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `foot` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `amount` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `store_name` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `water_tank_marbels`
--

INSERT INTO `water_tank_marbels` (`id`, `date`, `inc_id`, `foot`, `detail`, `amount`, `rate`, `store_name`) VALUES
(1, '23/02/22', '1', '2', 'huj', '2', '2', 'hujk');

-- --------------------------------------------------------

--
-- Table structure for table `water_tank_painters`
--

CREATE TABLE `water_tank_painters` (
  `id` bigint(100) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `per_murabah_rate` varchar(1000) NOT NULL,
  `rakbah` varchar(1000) NOT NULL,
  `painter_name` varchar(1000) NOT NULL,
  `kaam` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `wood_work_bill_tameers`
--

CREATE TABLE `wood_work_bill_tameers` (
  `id` bigint(100) NOT NULL,
  `thekedar_name` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `per_foot` varchar(1000) NOT NULL,
  `advance` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `wood_work_bill_tameers`
--

INSERT INTO `wood_work_bill_tameers` (`id`, `thekedar_name`, `muhala`, `date`, `detail`, `adaigi`, `rate`, `per_foot`, `advance`) VALUES
(4, 'dsa', 'دارالصدر', '12/17/2021', 'cx', '3', '2', '2', '2');

-- --------------------------------------------------------

--
-- Table structure for table `wood_work_bill_tanks`
--

CREATE TABLE `wood_work_bill_tanks` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `thekedar_name` varchar(1000) NOT NULL,
  `adaighi` varchar(1000) NOT NULL,
  `per_foot` varchar(1000) NOT NULL,
  `advance` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `wood_work_tameers`
--

CREATE TABLE `wood_work_tameers` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `muhala` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `advance` varchar(1000) NOT NULL,
  `adaighi` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `murabah_foot` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `wood_work_tameers`
--

INSERT INTO `wood_work_tameers` (`id`, `detail`, `date`, `store_name`, `muhala`, `inc_id`, `advance`, `adaighi`, `rate`, `murabah_foot`) VALUES
(1, 'سالڈ ڈور لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '240', '770'),
(2, 'پلائی ڈور لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '130', '532'),
(3, 'جالی ڈور  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '180', '140'),
(4, 'الماری فریم پلے + کچن فریم پلے  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '180', '1323'),
(5, 'کچن کیبنٹ  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '230', '2475'),
(6, 'دراز  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '1300', '66'),
(7, 'جالی والے فریم  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '240', '42'),
(8, 'T.V ٹرالی والے فریم  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '2500', '6'),
(9, 'باڈر  لیبر ریٹ', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '6', '36'),
(10, 'ٹوٹل پیمائش', '13/04/22', 'طارق احمد ووڈورکس', 'تعمیر کوارٹرز دارالفتوح', '1', '1', '1', '20', '2391');

-- --------------------------------------------------------

--
-- Table structure for table `wood_work_tank_steels`
--

CREATE TABLE `wood_work_tank_steels` (
  `id` bigint(100) NOT NULL,
  `detail` varchar(5000) NOT NULL,
  `date` varchar(1000) NOT NULL,
  `store_name` varchar(1000) NOT NULL,
  `inc_id` varchar(1000) NOT NULL,
  `advance` varchar(1000) NOT NULL,
  `adaigi` varchar(1000) NOT NULL,
  `rate` varchar(1000) NOT NULL,
  `per_foot` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `wood_work_tank_steels`
--

INSERT INTO `wood_work_tank_steels` (`id`, `detail`, `date`, `store_name`, `inc_id`, `advance`, `adaigi`, `rate`, `per_foot`) VALUES
(1, 'سلائڈ دروازے', '17/03/22', 'طارق احمد ووڈورکس', '1', '1', '1', '3', '21'),
(2, 'لیبر', '17/03/22', 'طارق احمد ووڈورکس', '1', '1', '1', '63', '250');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `add_daftrs`
--
ALTER TABLE `add_daftrs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `add_tameer_quaters`
--
ALTER TABLE `add_tameer_quaters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amad_daftr_entries`
--
ALTER TABLE `amad_daftr_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amad_daftr_letter_entries`
--
ALTER TABLE `amad_daftr_letter_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amad_quater_entries`
--
ALTER TABLE `amad_quater_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amad_quater_letter_entries`
--
ALTER TABLE `amad_quater_letter_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amad_tameer_quater_entries`
--
ALTER TABLE `amad_tameer_quater_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amad_tank_entries`
--
ALTER TABLE `amad_tank_entries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chair_bill_daftrs`
--
ALTER TABLE `chair_bill_daftrs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chair_daftrs`
--
ALTER TABLE `chair_daftrs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_bills`
--
ALTER TABLE `daftr_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_bill_cable_dicts`
--
ALTER TABLE `daftr_bill_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_bill_carpenters`
--
ALTER TABLE `daftr_bill_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_bill_marbels`
--
ALTER TABLE `daftr_bill_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_bill_painters`
--
ALTER TABLE `daftr_bill_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_bill_paint_days`
--
ALTER TABLE `daftr_bill_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_cable_dicts`
--
ALTER TABLE `daftr_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_chakars`
--
ALTER TABLE `daftr_chakars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_details`
--
ALTER TABLE `daftr_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_detail_carpenters`
--
ALTER TABLE `daftr_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_detail_mistris`
--
ALTER TABLE `daftr_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_detail_painters`
--
ALTER TABLE `daftr_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_marbels`
--
ALTER TABLE `daftr_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_paint_days`
--
ALTER TABLE `daftr_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_paint_yomiya_bills`
--
ALTER TABLE `daftr_paint_yomiya_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_steels`
--
ALTER TABLE `daftr_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_steel_bills`
--
ALTER TABLE `daftr_steel_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_stores`
--
ALTER TABLE `daftr_stores`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `daftr_yomiya_detail_carpenters`
--
ALTER TABLE `daftr_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_factory_detail_steels`
--
ALTER TABLE `darul_factory_detail_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuhs`
--
ALTER TABLE `darul_fatuhs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuh_details`
--
ALTER TABLE `darul_fatuh_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuh_detail_carpenters`
--
ALTER TABLE `darul_fatuh_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuh_detail_mistris`
--
ALTER TABLE `darul_fatuh_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuh_detail_painters`
--
ALTER TABLE `darul_fatuh_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuh_detail_steels`
--
ALTER TABLE `darul_fatuh_detail_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_fatuh_yomiya_detail_carpenters`
--
ALTER TABLE `darul_fatuh_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasars`
--
ALTER TABLE `darul_nasars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasar_details`
--
ALTER TABLE `darul_nasar_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasar_detail_carpenters`
--
ALTER TABLE `darul_nasar_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasar_detail_mistris`
--
ALTER TABLE `darul_nasar_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasar_detail_painters`
--
ALTER TABLE `darul_nasar_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasar_detail_steels`
--
ALTER TABLE `darul_nasar_detail_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_nasar_yomiya_detail_carpenters`
--
ALTER TABLE `darul_nasar_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadars`
--
ALTER TABLE `darul_sadars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_chakars`
--
ALTER TABLE `darul_sadar_chakars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_details`
--
ALTER TABLE `darul_sadar_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_detail_carpenters`
--
ALTER TABLE `darul_sadar_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_detail_mistris`
--
ALTER TABLE `darul_sadar_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_detail_painters`
--
ALTER TABLE `darul_sadar_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_detail_steels`
--
ALTER TABLE `darul_sadar_detail_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_sadar_yomiya_detail_carpenters`
--
ALTER TABLE `darul_sadar_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeens`
--
ALTER TABLE `darul_waqfeens`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeen_details`
--
ALTER TABLE `darul_waqfeen_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeen_detail_carpenters`
--
ALTER TABLE `darul_waqfeen_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeen_detail_mistris`
--
ALTER TABLE `darul_waqfeen_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeen_detail_painters`
--
ALTER TABLE `darul_waqfeen_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeen_detail_steels`
--
ALTER TABLE `darul_waqfeen_detail_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_waqfeen_yomiya_detail_carpenters`
--
ALTER TABLE `darul_waqfeen_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_details`
--
ALTER TABLE `darul_yaman_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_detail_carpenters`
--
ALTER TABLE `darul_yaman_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_detail_mistris`
--
ALTER TABLE `darul_yaman_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_detail_painters`
--
ALTER TABLE `darul_yaman_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_detail_steels`
--
ALTER TABLE `darul_yaman_detail_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_quaters`
--
ALTER TABLE `darul_yaman_quaters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `darul_yaman_yomiya_detail_carpenters`
--
ALTER TABLE `darul_yaman_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `electric_bill_tameer_quaters`
--
ALTER TABLE `electric_bill_tameer_quaters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `electric_bill_water_tanks`
--
ALTER TABLE `electric_bill_water_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `electric_tameer_quaters`
--
ALTER TABLE `electric_tameer_quaters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `electric_water_tanks`
--
ALTER TABLE `electric_water_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `factory_areas`
--
ALTER TABLE `factory_areas`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `factory_area_details`
--
ALTER TABLE `factory_area_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `factory_area_detail_carpenters`
--
ALTER TABLE `factory_area_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `factory_area_detail_mistris`
--
ALTER TABLE `factory_area_detail_mistris`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `factory_area_detail_painters`
--
ALTER TABLE `factory_area_detail_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `factory_area_yomiya_detail_carpenters`
--
ALTER TABLE `factory_area_yomiya_detail_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ishya_quater_tameers`
--
ALTER TABLE `ishya_quater_tameers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ishya_rateds`
--
ALTER TABLE `ishya_rateds`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ishya_water_tanks`
--
ALTER TABLE `ishya_water_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bills`
--
ALTER TABLE `quater_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bill_cable_dicts`
--
ALTER TABLE `quater_bill_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bill_carpenters`
--
ALTER TABLE `quater_bill_carpenters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bill_marbels`
--
ALTER TABLE `quater_bill_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bill_painters`
--
ALTER TABLE `quater_bill_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bill_painter_days`
--
ALTER TABLE `quater_bill_painter_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_bill_paint_days`
--
ALTER TABLE `quater_bill_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_factory_cable_dicts`
--
ALTER TABLE `quater_factory_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_factory_marbels`
--
ALTER TABLE `quater_factory_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_factory_paint_days`
--
ALTER TABLE `quater_factory_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_fatuh_cable_dicts`
--
ALTER TABLE `quater_fatuh_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_fatuh_marbels`
--
ALTER TABLE `quater_fatuh_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_fatuh_paint_days`
--
ALTER TABLE `quater_fatuh_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_nasar_cable_dicts`
--
ALTER TABLE `quater_nasar_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_nasar_marbels`
--
ALTER TABLE `quater_nasar_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_nasar_paint_days`
--
ALTER TABLE `quater_nasar_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_sadar_cable_dicts`
--
ALTER TABLE `quater_sadar_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_sadar_marbels`
--
ALTER TABLE `quater_sadar_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_steel_bills`
--
ALTER TABLE `quater_steel_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_stores`
--
ALTER TABLE `quater_stores`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_stores_tameers`
--
ALTER TABLE `quater_stores_tameers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_tameer_steels`
--
ALTER TABLE `quater_tameer_steels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_tameer_thekedars`
--
ALTER TABLE `quater_tameer_thekedars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_waqfeen_cable_dicts`
--
ALTER TABLE `quater_waqfeen_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_waqfeen_marbels`
--
ALTER TABLE `quater_waqfeen_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_waqfeen_paint_days`
--
ALTER TABLE `quater_waqfeen_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_yaman_cable_dicts`
--
ALTER TABLE `quater_yaman_cable_dicts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_yaman_marbels`
--
ALTER TABLE `quater_yaman_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `quater_yaman_paint_days`
--
ALTER TABLE `quater_yaman_paint_days`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sadar_paint_yomiya_bills`
--
ALTER TABLE `sadar_paint_yomiya_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `steel_decorator_bill_tameers`
--
ALTER TABLE `steel_decorator_bill_tameers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `steel_decorator_bill_tanks`
--
ALTER TABLE `steel_decorator_bill_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `steel_decorator_tanks`
--
ALTER TABLE `steel_decorator_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `stores`
--
ALTER TABLE `stores`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `tameer_chakars`
--
ALTER TABLE `tameer_chakars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tameer_painter_bills`
--
ALTER TABLE `tameer_painter_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tameer_quater_marbels`
--
ALTER TABLE `tameer_quater_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tameer_quater_painters`
--
ALTER TABLE `tameer_quater_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tank_painter_bills`
--
ALTER TABLE `tank_painter_bills`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `thekedar_bill_tameers`
--
ALTER TABLE `thekedar_bill_tameers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `thekedar_bill_water_tanks`
--
ALTER TABLE `thekedar_bill_water_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `thekedar_water_tanks`
--
ALTER TABLE `thekedar_water_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `water_tank_marbels`
--
ALTER TABLE `water_tank_marbels`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `water_tank_painters`
--
ALTER TABLE `water_tank_painters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `wood_work_bill_tameers`
--
ALTER TABLE `wood_work_bill_tameers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `wood_work_bill_tanks`
--
ALTER TABLE `wood_work_bill_tanks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `wood_work_tameers`
--
ALTER TABLE `wood_work_tameers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `wood_work_tank_steels`
--
ALTER TABLE `wood_work_tank_steels`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `add_daftrs`
--
ALTER TABLE `add_daftrs`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- AUTO_INCREMENT for table `add_tameer_quaters`
--
ALTER TABLE `add_tameer_quaters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `amad_daftr_entries`
--
ALTER TABLE `amad_daftr_entries`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT for table `amad_daftr_letter_entries`
--
ALTER TABLE `amad_daftr_letter_entries`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `amad_quater_entries`
--
ALTER TABLE `amad_quater_entries`
  MODIFY `id` bigint(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=361;

--
-- AUTO_INCREMENT for table `amad_quater_letter_entries`
--
ALTER TABLE `amad_quater_letter_entries`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT for table `amad_tameer_quater_entries`
--
ALTER TABLE `amad_tameer_quater_entries`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `amad_tank_entries`
--
ALTER TABLE `amad_tank_entries`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `chair_bill_daftrs`
--
ALTER TABLE `chair_bill_daftrs`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chair_daftrs`
--
ALTER TABLE `chair_daftrs`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `daftr_bills`
--
ALTER TABLE `daftr_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_bill_cable_dicts`
--
ALTER TABLE `daftr_bill_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `daftr_bill_carpenters`
--
ALTER TABLE `daftr_bill_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `daftr_bill_marbels`
--
ALTER TABLE `daftr_bill_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `daftr_bill_painters`
--
ALTER TABLE `daftr_bill_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `daftr_bill_paint_days`
--
ALTER TABLE `daftr_bill_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `daftr_cable_dicts`
--
ALTER TABLE `daftr_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_chakars`
--
ALTER TABLE `daftr_chakars`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `daftr_details`
--
ALTER TABLE `daftr_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=75;

--
-- AUTO_INCREMENT for table `daftr_detail_carpenters`
--
ALTER TABLE `daftr_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `daftr_detail_mistris`
--
ALTER TABLE `daftr_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `daftr_detail_painters`
--
ALTER TABLE `daftr_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_marbels`
--
ALTER TABLE `daftr_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_paint_days`
--
ALTER TABLE `daftr_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `daftr_paint_yomiya_bills`
--
ALTER TABLE `daftr_paint_yomiya_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_steels`
--
ALTER TABLE `daftr_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_steel_bills`
--
ALTER TABLE `daftr_steel_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `daftr_stores`
--
ALTER TABLE `daftr_stores`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `daftr_yomiya_detail_carpenters`
--
ALTER TABLE `daftr_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `darul_factory_detail_steels`
--
ALTER TABLE `darul_factory_detail_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_fatuhs`
--
ALTER TABLE `darul_fatuhs`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT for table `darul_fatuh_details`
--
ALTER TABLE `darul_fatuh_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `darul_fatuh_detail_carpenters`
--
ALTER TABLE `darul_fatuh_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_fatuh_detail_mistris`
--
ALTER TABLE `darul_fatuh_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `darul_fatuh_detail_painters`
--
ALTER TABLE `darul_fatuh_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_fatuh_detail_steels`
--
ALTER TABLE `darul_fatuh_detail_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_fatuh_yomiya_detail_carpenters`
--
ALTER TABLE `darul_fatuh_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_nasars`
--
ALTER TABLE `darul_nasars`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- AUTO_INCREMENT for table `darul_nasar_details`
--
ALTER TABLE `darul_nasar_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `darul_nasar_detail_carpenters`
--
ALTER TABLE `darul_nasar_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_nasar_detail_mistris`
--
ALTER TABLE `darul_nasar_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `darul_nasar_detail_painters`
--
ALTER TABLE `darul_nasar_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `darul_nasar_detail_steels`
--
ALTER TABLE `darul_nasar_detail_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `darul_nasar_yomiya_detail_carpenters`
--
ALTER TABLE `darul_nasar_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `darul_sadars`
--
ALTER TABLE `darul_sadars`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=120;

--
-- AUTO_INCREMENT for table `darul_sadar_chakars`
--
ALTER TABLE `darul_sadar_chakars`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `darul_sadar_details`
--
ALTER TABLE `darul_sadar_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=70;

--
-- AUTO_INCREMENT for table `darul_sadar_detail_carpenters`
--
ALTER TABLE `darul_sadar_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `darul_sadar_detail_mistris`
--
ALTER TABLE `darul_sadar_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `darul_sadar_detail_painters`
--
ALTER TABLE `darul_sadar_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `darul_sadar_detail_steels`
--
ALTER TABLE `darul_sadar_detail_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `darul_sadar_yomiya_detail_carpenters`
--
ALTER TABLE `darul_sadar_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `darul_waqfeens`
--
ALTER TABLE `darul_waqfeens`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `darul_waqfeen_details`
--
ALTER TABLE `darul_waqfeen_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `darul_waqfeen_detail_carpenters`
--
ALTER TABLE `darul_waqfeen_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_waqfeen_detail_mistris`
--
ALTER TABLE `darul_waqfeen_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_waqfeen_detail_painters`
--
ALTER TABLE `darul_waqfeen_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `darul_waqfeen_detail_steels`
--
ALTER TABLE `darul_waqfeen_detail_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_waqfeen_yomiya_detail_carpenters`
--
ALTER TABLE `darul_waqfeen_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_yaman_details`
--
ALTER TABLE `darul_yaman_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_yaman_detail_carpenters`
--
ALTER TABLE `darul_yaman_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_yaman_detail_mistris`
--
ALTER TABLE `darul_yaman_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `darul_yaman_detail_painters`
--
ALTER TABLE `darul_yaman_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_yaman_detail_steels`
--
ALTER TABLE `darul_yaman_detail_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `darul_yaman_quaters`
--
ALTER TABLE `darul_yaman_quaters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `darul_yaman_yomiya_detail_carpenters`
--
ALTER TABLE `darul_yaman_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `electric_bill_tameer_quaters`
--
ALTER TABLE `electric_bill_tameer_quaters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `electric_bill_water_tanks`
--
ALTER TABLE `electric_bill_water_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `electric_tameer_quaters`
--
ALTER TABLE `electric_tameer_quaters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `electric_water_tanks`
--
ALTER TABLE `electric_water_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `factory_areas`
--
ALTER TABLE `factory_areas`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `factory_area_details`
--
ALTER TABLE `factory_area_details`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `factory_area_detail_carpenters`
--
ALTER TABLE `factory_area_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `factory_area_detail_mistris`
--
ALTER TABLE `factory_area_detail_mistris`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `factory_area_detail_painters`
--
ALTER TABLE `factory_area_detail_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `factory_area_yomiya_detail_carpenters`
--
ALTER TABLE `factory_area_yomiya_detail_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `ishya_quater_tameers`
--
ALTER TABLE `ishya_quater_tameers`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `ishya_rateds`
--
ALTER TABLE `ishya_rateds`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `ishya_water_tanks`
--
ALTER TABLE `ishya_water_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_bills`
--
ALTER TABLE `quater_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_bill_cable_dicts`
--
ALTER TABLE `quater_bill_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_bill_carpenters`
--
ALTER TABLE `quater_bill_carpenters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `quater_bill_marbels`
--
ALTER TABLE `quater_bill_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `quater_bill_painters`
--
ALTER TABLE `quater_bill_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `quater_bill_painter_days`
--
ALTER TABLE `quater_bill_painter_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `quater_bill_paint_days`
--
ALTER TABLE `quater_bill_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `quater_factory_cable_dicts`
--
ALTER TABLE `quater_factory_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_factory_marbels`
--
ALTER TABLE `quater_factory_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_factory_paint_days`
--
ALTER TABLE `quater_factory_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_fatuh_cable_dicts`
--
ALTER TABLE `quater_fatuh_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_fatuh_marbels`
--
ALTER TABLE `quater_fatuh_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_fatuh_paint_days`
--
ALTER TABLE `quater_fatuh_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `quater_nasar_cable_dicts`
--
ALTER TABLE `quater_nasar_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_nasar_marbels`
--
ALTER TABLE `quater_nasar_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_nasar_paint_days`
--
ALTER TABLE `quater_nasar_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_sadar_cable_dicts`
--
ALTER TABLE `quater_sadar_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `quater_sadar_marbels`
--
ALTER TABLE `quater_sadar_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `quater_steel_bills`
--
ALTER TABLE `quater_steel_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `quater_stores`
--
ALTER TABLE `quater_stores`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `quater_stores_tameers`
--
ALTER TABLE `quater_stores_tameers`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `quater_tameer_steels`
--
ALTER TABLE `quater_tameer_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_tameer_thekedars`
--
ALTER TABLE `quater_tameer_thekedars`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `quater_waqfeen_cable_dicts`
--
ALTER TABLE `quater_waqfeen_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_waqfeen_marbels`
--
ALTER TABLE `quater_waqfeen_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_waqfeen_paint_days`
--
ALTER TABLE `quater_waqfeen_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_yaman_cable_dicts`
--
ALTER TABLE `quater_yaman_cable_dicts`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_yaman_marbels`
--
ALTER TABLE `quater_yaman_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quater_yaman_paint_days`
--
ALTER TABLE `quater_yaman_paint_days`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sadar_paint_yomiya_bills`
--
ALTER TABLE `sadar_paint_yomiya_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `steel_decorator_bill_tameers`
--
ALTER TABLE `steel_decorator_bill_tameers`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `steel_decorator_bill_tanks`
--
ALTER TABLE `steel_decorator_bill_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `steel_decorator_tanks`
--
ALTER TABLE `steel_decorator_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `stores`
--
ALTER TABLE `stores`
  MODIFY `id` bigint(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20220364;

--
-- AUTO_INCREMENT for table `tameer_chakars`
--
ALTER TABLE `tameer_chakars`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `tameer_painter_bills`
--
ALTER TABLE `tameer_painter_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `tameer_quater_marbels`
--
ALTER TABLE `tameer_quater_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `tameer_quater_painters`
--
ALTER TABLE `tameer_quater_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tank_painter_bills`
--
ALTER TABLE `tank_painter_bills`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `thekedar_bill_tameers`
--
ALTER TABLE `thekedar_bill_tameers`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `thekedar_bill_water_tanks`
--
ALTER TABLE `thekedar_bill_water_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `thekedar_water_tanks`
--
ALTER TABLE `thekedar_water_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `water_tank_marbels`
--
ALTER TABLE `water_tank_marbels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `water_tank_painters`
--
ALTER TABLE `water_tank_painters`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `wood_work_bill_tameers`
--
ALTER TABLE `wood_work_bill_tameers`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `wood_work_bill_tanks`
--
ALTER TABLE `wood_work_bill_tanks`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `wood_work_tameers`
--
ALTER TABLE `wood_work_tameers`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `wood_work_tank_steels`
--
ALTER TABLE `wood_work_tank_steels`
  MODIFY `id` bigint(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
